Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/counter/commands.po
Languages: fr, ru

source: Important Commands
fr: Commandes importantes
ru: Важные команды

source: Faucet Account Information
fr: Informations sur le compte Faucet
ru: Информация об аккаунте Крана

source: This command is part of NCTL and provides a view into the faucet account details. The faucet is the default account created on the network. Generally on the Mainnet, your own account is used to fund transactions. However, for the sake of this tutorial, we do not need accounts and will use the faucet to execute deploys. This command supplies two key pieces of information: the account’s `secret key` location and the `account hash`, which are used to sign deploys and query the network state, respectively.
fr: Cette commande fait partie de NCTL et permet de visualiser les détails du compte faucet. Le faucet est le compte par défaut créé sur le réseau. En général, sur le Mainnet, votre propre compte est utilisé pour financer les transactions. Cependant, dans le cadre de ce tutoriel, nous n'avons pas besoin de comptes et nous utiliserons Faucet pour exécuter les déploiements. Cette commande fournit deux informations clés : l'emplacement de la `secret key` du compte et le `account hash`, qui sont utilisés pour signer les déploiements et interroger l'état du réseau, respectivement.
ru: Эта команда является частью NCTL и предоставляет представление сведений об учетной записи крана. Кран - это учетная запись по умолчанию, созданная в сети. Как правило, в Основной сети для финансирования транзакций используется ваш собственный аккаунт. Однако ради этого урока нам не нужны учетные записи, и мы будем использовать кран для выполнения развертываний. Эта команда предоставляет две ключевые части информации: местоположение "секретного ключа" учетной записи и "хеш учетной записи", которые используются для подписи развертываний и запроса состояния сети соответственно.

source: State Root Hash
ru: Корневой хеш состояния

source: The first command that we will cover as part of the `casper-client` tool is the `get-state-root-hash` command. The state root hash is an identifier of the current network state. It is similar to a Git commit ID for commit history. It gives a snapshot of the blockchain state at a moment in time. For this tutorial, it will be used to query the network state after we take actions with deployments.
fr: La première commande que nous allons aborder dans le cadre de l'outil `casper-client` est la commande `get-state-root-hash`. Le 'state root hash' est un identifiant de l'état actuel du réseau. Il est similaire à un ID de commit Git pour l'historique des commit. Il donne un instantané de l'état de la blockchain à un moment donné. Pour ce tutoriel, il sera utilisé pour interroger l'état du réseau après avoir effectué des actions avec les déploiements.
ru: Первая команда, которую мы рассмотрим как часть инструмента`casper-client` - это команда `get-state-root-hash`. Корневой хеш состояния - это идентификатор текущего состояния сети. Это похоже на идентификатор фиксации Git для истории фиксации. Это дает моментальный снимок состояния блокчейна в определенный момент времени. В этом руководстве он будет использоваться для запроса состояния сети после выполнения действий с развертываниями.

source: After any deploys to the network, you must get the new state root hash to see the new changes reflected. Otherwise, you will be looking at events in the past.
fr: Après tout déploiement sur le réseau, vous devez obtenir le nouveau 'state root hash' pour voir les nouveaux changements reflétés. Sinon, vous regarderez des événements du passé.
ru: После любого развертывания в сети вы должны получить корневой хеш нового состояния, чтобы увидеть отражение новых изменений. В противном случае вы будете смотреть на события в прошлом.

source: Querying Network State
fr: Interroger l'état du réseau
ru: Запрос состояния сети

source: This command allows you to query the state of a Casper network at a given moment in time, which is specified by the `state-root-hash` described above.
fr: Cette commande vous permet d'interroger l'état d'un réseau Casper à un moment donné dans le temps, qui est spécifié par le `state-root-hash` décrit ci-dessus.
ru: Эта команда позволяет вам запрашивать состояние сети Casper в данный момент времени, которое определяется описанным выше "корневым хешем состояния".

source: The `node-address` is the server (localhost when running on a local NCTL network).
fr: Le `node-address` est le serveur (localhost lorsqu'il fonctionne sur un réseau local NCTL).
ru: Адрес ноды `node-address` - это сервер (локальный хост при работе в локальной сети NCTL).

source: The `key` is the identifier for the query. It must be either the account public key, account hash, contract address hash, transfer hash, or deploy hash. We will demonstrate two of these key types in this tutorial.
fr: La `key` est l'identifiant de la requête. Il doit s'agir de la clé publique du compte, du hash du compte, du hash de l'adresse du contrat, du hash du transfert ou du hash du déploiement. Nous allons démontrer deux de ces types de clés dans ce tutoriel.
ru: `Ключ` - это идентификатор запроса. Это должен быть либо открытый ключ учетной записи, хеш учетной записи, хеш адреса контракта, хеш трансфера или хеш развертывания. В этом уроке мы продемонстрируем два из этих ключевых типов.

source: The optional query path argument (`q`) allows you to drill into the specifics of a query concerning the key.
fr: L'argument optionnel "query path" (`q`) vous permet d'approfondir les spécificités d'une requête concernant la clé.
ru: Необязательный аргумент пути запроса (`q`) позволяет детализировать специфику запроса, касающегося ключа.

source: Put Deploys (onto the Chain)
fr: Put Deploys (sur la chaîne)
ru: Поместите развертывания (в Цепь)

source: Deploy via a compiled WASM binary
fr: Déployer via un binaire WASM compilé
ru: Развертывание с помощью скомпилированного двоичного файла WASM

source: This command creates a deploy and sends it to the network for execution. In this first usage of the command,
fr: Cette commande crée un déploiement et l'envoie au réseau pour exécution. Dans cette première utilisation de la commande,
ru: Эта команда создает развертывание и отправляет его в сеть для выполнения. В этом первом использовании команды,

source: The `session-path` points to a compiled WASM contract.
fr: Le `session-path` pointe vers un contrat WASM compilé.
ru: Путь сеанса `session-path` указывает на скомпилированный контракт WASM.

source: This contract is then deployed to the network specified by `node-address` and `chain-name`. By default, NCTL names the chain “casper-net-1” but this is configurable.
fr: Ce contrat est ensuite déployé sur le réseau spécifié par `node-address` et `chain-name`. Par défaut, NCTL nomme la chaîne "casper-net-1" mais ceci est configurable.
ru: Затем этот контракт развертывается в сети, указанной "адресом ноды" и "именем цепочки". По умолчанию NCTL называет цепочку “casper-net-1”, но это настраиваемый параметр.

source: The `payment-amount` is in units of motes (1 nano-CSPR) and is required to pay the transaction fee for the deployment. If it is too small, the transaction will get denied due to insufficient funds.
fr: Ce contrat est ensuite déployé sur le réseau spécifié par `node-address` et `chain-name`. Par défaut, NCTL nomme la chaîne "casper-net-1" mais ceci est configurable.
ru: Сумма платежа `payment-amount` указана в единицах измерения motes (1 нано-CSPR) и требуется для оплаты комиссии за транзакцию за развертывание. Если их слишком мало, транзакция будет отклонена из-за нехватки средств.

source: Deploy via a named key already on the blockchain
fr: Déployer via une clé nommée déjà sur la blockchain
ru: Развертывание с помощью именованного ключа уже в блокчейне

source: This second usage of `put-deploy` does not place a new contract on the chain, but it allows you to call entry points (functions) defined in smart contracts.
fr: Cette deuxième utilisation de `put-deploy` ne place pas un nouveau contrat sur la chaîne, mais elle vous permet d'appeler des points d'entrée (fonctions) définis dans les smart contracts.
ru: Это второе использование размещения развертывания `put-deploy` не помещает новый контракт в цепочку, но позволяет вызывать точки входа (функции), определенные в смарт-контрактах.

source: Here we show the example using “counter” and “counter_inc” because, in the `Counter tutorial <walkthrough.html>`_, we have defined a smart contract by the name of “counter”, and there is an entry-point named “counter_inc” defined within it. However, these will be different when you write your contracts.
fr: Ici, nous montrons l'exemple en utilisant "counter" et "counter_inc" parce que, dans le `Tutoriel counter <walkthrough.html>`_, nous avons défini un contrat intelligent du nom de "counter", et il y a un point d'entrée nommé "counter_inc" défini dans celui-ci. Cependant, ceux-ci seront différents lorsque vous écrirez vos contrats.
ru: Здесь мы показываем пример с использованием “counter” и “counter_inc”, потому что в учебнике по счетчику `Counter tutorial <walkthrough.html>`_, мы определили смарт-контракт под названием счетчик - “counter” , и в нем определена точка входа с именем “counter_inc”. Однако они будут отличаться, когда вы будете писать свои контракты.

source: Get Deploys (from the Chain)
fr: Get Deploys (de la chaîne)
ru: Получение развертываний (из Цепочки)

source: The `get-deploy` command is complementary to the `put-deploy` command. It retrieves a deploy from the network and allows you to check the status of the deploy. The `DEPLOY_HASH` is the identifier to a specific deploy and is returned by the `put-deploy` command.
fr: La commande `get-deploy` est complémentaire de la commande `put-deploy`. Elle récupère un déploiement sur le réseau et vous permet de vérifier le statut du déploiement. Le `DEPLOY_HASH` est l'identifiant d'un déploiement spécifique et est retourné par la commande `put-deploy`.
ru: Команда получения развертывания `get-deploy` дополняет команду размещения развертывания `put-deploy`. Она извлекает развертывание из сети и позволяет проверить состояние развертывания. `DEPLOY_HASH` является идентификатором конкретного развертывания и возвращается командой `put-deploy`.
