Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/index.po
Languages: ru

source: Introduction
ru: Вступление

source: Developers
ru: Разработчики

source: This guide is designed to support developers getting started with the development of smart contracts on the Casper blockchain in AssemblyScript or Rust. For Rust, there is a contract development kit that includes a runtime environment, reference documentation, and test framework. You can install our environment locally, create and test Smart Contracts with our Smart Contracts and Test Libraries, and use these libraries to build your own applications.
ru: Это руководство предназначено для разработчиков, начинающих разработку смарт-контрактов на блокчейне Casper с использованием AssemblyScript или Rust.

source: It is recommended you have prior knowledge about Unix-based operating systems, like GNU/Linux or macOS, and programming knowledge with:
ru: Рекомендуется иметь предварительные знания об Unix подобных операционных системах, таких как GNU / Linux или macOS, а также знания программирования, а именно:

source: JavaScript (optional)
ru: JavaScript (опционально)

source: Python (optional)
ru: Python (опционально)

source: The topics on the index include present and future documentation initiatives in our roadmap and are organized so that you will be able to:
ru: Темы в указателе включают текущие и будущие инициативы по документации в нашей дорожной карте и организованы таким образом, чтобы вы могли:

source: Understand more about the Casper Network
ru: Понять больше о сети Casper Network

source: Learn how to build and operate applications on the platform
ru: Узнать, как собирать и управлять приложениями на платформе

source: Learn how to set up a Casper Network locally
ru: Научиться настраивать локальную сеть Casper Network

source: Work with the contracts API to access the network\'s Rust resources
ru: Работать с API контрактов для доступа к сетевым ресурсам Rust

source: Learn how to create and test smart contracts using available libraries
ru: Научиться, как создавать и тестировать смарт-контракты, используя доступные библиотеки

source: Work with the multi-signature capability to sign transactions
ru: Работа с возможностями мультиподписей для подписания транзакций

source: The motivation for our roadmap is inspired by feedback we are receiving from your recommendations. We hope you continue to provide your feedback as you embark on this journey with us -- we look forward to building a decentralized future together.
ru: Мы черпаем идеи для создания дорожной карты продукта из обратной связи, которую получаем из ваших рекомендаций. Мы надеемся, что вы и дальше будете давать обратную связь, пока мы вместе - и мы хотим создавать это будущее децентрализованных систем вместе с вами.
