Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/setup-of-rust-contract-sdk.po
Languages: ru

source: Getting Started
ru: Начало работы

source: This guide covers the basic tools you will need to set up your first Casper smart contract. You will also be able to build a sample smart contract and run a few basic tests on it on your local machine.
ru: В этом гайде освещены основные инструменты, которые вам понадобятся для настройки вашего первого смарт-контракта Casper. Также вы сможете собрать семпл смарт-контракта и запустить несколько базовых тестов для него на своей локальной машине.

source: Casper’s blockchain is built upon the Rust programming language and compiles down to WebAssembly. The Rust contract SDK is the easiest way to get started with smart contract development. This guide will walk you through the steps to set up your development environment and build your first contract.
ru: Блокчейн Casper строится на языке программирования Rust и компилируется в WebAssembly. Комплект средств разработки контрактов Rust contract SDK - это самый простой способ начать работать с разработкой смарт-контрактов. Этот гайд освещает шаги по настройке среды разработки и сборке вашего первого смарт-контракта.

source: Video Tutorial
ru: Видео туториал

source: For a video walkthrough of this guide, feel free to check out this quick-start video.
ru: Чтобы изучить гайд в видео формате, пожалуйста обратитесь к этому видео с руководством для начала работы.

source: Prerequisites
ru: Пререквизиты

source: Installing Rust
ru: Установка Rust

source: Install the `Rust programming language <https://www.rust-lang.org>`_ if you don’t already have it on your computer.
ru: Если на вашем компьютере еще нет языка программирования Rust, установите `Rust programming language <https://www.rust-lang.org>`_ .

source: The `official Rust guide <https://www.rust-lang.org/tools/install>`_ recommends installing Rust by using ``curl``:
ru: Официальный гайд Rust `official Rust guide <https://www.rust-lang.org/tools/install>`_ рекомендует установку Rust с помощью ``curl``:

source: You can also use ``brew`` on MacOS or ``apt`` on Linux to install Rust.
ru: Также на MacOS вы можете использовать ``brew``, а на Linux - ``apt`` для установки языка Rust.

source: You will need to customize the build so that you are installing the nightly build as your default toolchain. Once you finish installing Rust, check your version:
ru: Вам нужно будет кастомизировать сборку таким образом, чтобы ночная сборка была вашим набором программ по умолчанию. Как только вы закончите установку Rust, проверьте вашу версию:

source: Your terminal output should resemble something like the following (note: at the time of the writing of this tutorial, the latest version of Rust was 1.23.1 and may differ for you):
ru: Ваш терминальный выход должен выглядеть подобным образом (внимание: на момент написания туториала последняя версия Rust была 1.23.1 и ваша версия может отличаться):

source: **Casper Rust Packages**
ru: **Пакеты Casper Rust**

source: We publish three crates on `crates.io <https://crates.io/>`_ to support smart contract development with Rust:
ru: Для поддержки разработки смарт-контрактов на Rust мы разместили три крейта на `crates.io <https://crates.io/>`_ :

source: `Casper Contract <https://crates.io/crates/casper-contract>`_ - a library supporting communication with the blockchain. This is the main library you will need to write smart contracts.
ru: Здесь расположена библиотека, которая поддерживает коммуникацию с блокчейн `Casper Contract <https://crates.io/crates/casper-contract>`_ . Это основная библиотека, которая понадобится вам для написания смарт-контрактов.

source: `Casper Test Support <https://crates.io/crates/casper-engine-test-support>`_ - an in-memory virtual machine against which you can test your smart contracts.
ru: Виртуальная машина во внутренней памяти, на которой вы можете тестировать свои смарт-контракты - `Casper Test Support <https://crates.io/crates/casper-engine-test-support>`_ .

source: `Casper Types <https://crates.io/crates/casper-types>`_ - a library with types we use across the Rust ecosystem.
ru: Библиотека, содержащая типы, которые мы используем в экосистеме Rust - `Casper Types <https://crates.io/crates/casper-types>`_ .

source: A crate is a compilation unit, which can be compiled into a binary or a library.
ru: Крейт - это один юнит компиляции, который может быть компилирован в бинарный формат или формат библиотеки.

source: **API Documentation for Smart Contracts**
ru: **API документация для смарт-контрактов**

source: Each of the Casper crates comes with API documentation and examples for each function, located at `https://docs.rs <https://docs.rs/releases/search?query=casper>`_. The contract API documentation is specific for a given version. For example, you can find documentation for version **0.7.6** at `<https://docs.rs/casper-contract/0.7.6>`_.
ru: К каждому крейту в Casper идет API документация и примеры для каждой функции, расположенные тут: `https://docs.rs <https://docs.rs/releases/search?query=casper>`_. Контрактная API документация будет различной для каждой конкретной версии. Например, документацию для версии **0.7.6** можно найти здесь `<https://docs.rs/casper-contract/0.7.6>`_.

source: Installing Dependencies
ru: Установка зависимостей

source: CMake is a popular build tool that we will utilize, and you may very well have it already installed. If you do, make sure that you have the latest version (currently 3.19.4). If you need to install or upgrade it, follow the steps located here: https://cmake.org/install/. Once installed, check your version as shown below. It should resemble this output:
ru: CMake - это популярный инструмент разработки, который мы будем применять, и скорее всего у вас он уже установлен. Если это так, убедитесь, что у вас самая последняя версия (на данный момент 3.19.4). Если вам нужно установить или обновить версию, следуйте инструкциям, расположенным здесь: https://cmake.org/install/. После установки проверьте вашу версию, как показано ниже. Должно выглядеть примерно как этот выход:

source: Development Environment Setup
ru: Настройка среды разработки

source: Installing the Casper Crates
ru: Установка крейтов Casper

source: The best and fastest way to set up a Casper Rust Smart Contract project is to use :code:`cargo-casper`. When you use this, it will set the project up with a simple contract, a runtime environment and a testing framework with a simple test. *Cargo* is a build system and package manager for Rust (much like *pip* if you are familiar with Python). It is possible to use this configuration in your CI/CD pipeline as well.
ru: Самый простой и быстрый способ настроить Casper проект смарт-контрактов на Rust - использовать :code:`cargo-casper`. Когда вы это примените, произойдет настройка проекта с простым контрактом, рабочей среды и тестового фреймворка с простым тестом. *Cargo* - это система сборки и менеджер-упаковщик для Rust (очень похоже на *pip*, если вы работаете с Python). Можно использовать эту конфигурацию также в ваших каналах CI/CD.

source: Creating a Project
ru: Создание проекта

source: You can create a new sample project very easily with the Casper crate. For example, let’s say that I want to create a project named **my-project** for this tutorial (you can choose a different name if you wish), then I can simply run the command:
ru: С крейтом Casper можно очень легко создать новый семпл проекта. Например, представим, что я хочу создать проект под названием **my-project** для данного туториала (можете выбрать другое имя, если хотите), и для этого мне нужно всего лишь запустить команду:

source: If you look inside the newly-created *my-project* folder, you will find two crates: ``contract`` and ``tests``. This is a complete basic smart contract that saves a value, passed as an argument, on the blockchain. The ``tests`` crate provides a runtime environment of the Casper virtual machine, and a basic smart contract test.
ru: Если мы посмотрим на содержимое только что созданной папки *my-project*, то увидим два крейта: для контрактов ``contract`` и ``tests`` для тестов.

source: Compiling to WASM
ru: Компиляция в WASM

source: The Casper blockchain uses WebAssembly (WASM) in its runtime environment. Compilation targets for WASM are available for Rust, giving developers access to all the Rust ecosystem tools when developing smart contracts.
ru: В рабочей среде блокчейна Casper используется WebAssembly (WASM). Цели компиляции для WASM доступны в Rust, что дает разработчикам доступ ко всем инструментам экосистемы Rust во время разработки смарт-контрактов.

source: Casper contracts support Rust tooling such as :code:`clippy` for linting contracts. Feel free to use them!
ru: Контракты Casper поддерживают инструментарий Rust, например :code:`clippy` для анализа оформления кода в контрактах. Не стесняйтесь пользоваться этими функциями!

source: The project requires a specific nightly version of Rust and requires a WASM target to be added to that Rust version. You can see more information by running:
ru: Проект запрашивает специфическую ночную версию Rust и также требует, чтобы цель для WASM была добавлена в текущую версию Rust. Чтобы увидеть больше информации, запустите:

source: To build the project, go into the ``contract`` folder, install the Rust toolchain and specify the target build as WebAssembly (wasm32):
ru: Для сборки проекта зайдите в папку ``contract`` , установите комплекс инструментальных средств Rust и задайте целевую сборку в качестве WebAssembly (wasm32):

source: Build the Contract
ru: Сборка контракта

source: The next step is to compile the smart contract into WASM. Inside the contract folder, run the following command:
ru: Следующим шагом будет компиляция смарт-контракта в WASM. Внутри папки контракта запустите следующую команду:

source: **NOTE: It's important to build the contract using ``--release`` as a debug build will produce a contract which is much larger and more expensive to execute.**
ru: **ВНИМАНИЕ: Важно при сборке контракта использовать ``--release``, так как отладочная сборка создаст контракт куда больший и более дорогой для исполнения.**

source: Inside of the folder, you will now see a *target* folder that will contain the compiled smart contract named *contract.wasm* at :code:`my-project/contract/target/wasm32-unknown-unknown/release/contract.wasm`.
ru: Теперь внутри папки вы увидите папку цели *target*, в которой будет размещен скомпилированный смарт-контракт под названием *contract.wasm* и расположен :code:`my-project/contract/target/wasm32-unknown-unknown/release/contract.wasm`.

source: Test the Contract
ru: Тестирование контракта

source: In addition to creating the contract, the Casper crate also automatically created sample tests in the *my-project/tests* folder.
ru: Помимо создания контракта крейт Casper также автоматически создал семпл тесты в папке *my-project/tests*.

source: The Casper local environment provides an in-memory virtual machine against which you can run your contract for testing. When you run the test crate, it will automatically build the smart contract in release mode and then run a series of tests against it in the Casper runtime environment. The custom build script is named ``build.rs`` if you are interested in looking more into it.
ru: Локальная среда Casper предоставляет виртуальную машину во внутренней памяти, на которой вы можете запустить контракт для тестирования. Когда вы запустите тестовый крейт, он автоматически соберет смарт-контракт в режиме выпуска и затем запустит серию тестов на него внутри рабочей среды Casper. Кастомизированный скрипт сборки назван ``build.rs`` , если вам интересно побольше о нем узнать.

source: **Note**: Since the test script automatically builds the contract, during development you only need to run the command ``cargo test`` without the need for ``cargo build``.
ru: **Внимание**: Так как тестовый скрипт автоматически собирает контракт, во время разработки вам нужно только запустить команду ``cargo test`` и не требуется запускать ``cargo build``.

source: A successful test run indicates that your smart contract environment is set up correctly.
ru: Успешный запуск теста является индикатором того, что среда вашего смарт-контракта настроена корректно.

source: After the compilation finishes, the test should run and you should see output similar to this message in your terminal:
ru: Когда компиляция завершится, должен запуститься тест и вы должны увидеть выход, аналогичный этому сообщению в вашем терминале:

source: As a brief example, open up *my-project/contract/src/main.rs* in your editor, modify the *KEY* value in the contract, and then rerun the ``cargo test`` command. You should observe that the smart contract recompiles and the test fails now.
ru: В качестве краткого примера откройте в своем редакторе *my-project/contract/src/main.rs* , модифицируйте значение *KEY* в контракте и затем перезапустите команду ``cargo test``. Вы должны увидеть, что в данном случае смарт-контракт перекомпилируется и теперь тест провален.

source: Rust Resources
ru: Ресурсы Rust

source: These Rust resources are excellent and we highly recommend them:
ru: Эти ресурсы Rust превосходны и мы их очень рекомендуем:
