Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/changelog.po
Languages: ru, vi

source: Changelog
ru: Журнал изменений Changelog
vi: Nhật ký thay đổi

source: This page is a reference library for all the past technical releases and changelogs for the Casper Network. Click on the links below to see details about the released versions such as release dates, key changes and milestones completed, known issues, and calls to action for validators, dApp developers, contract authors, and exchanges.
ru: Эта страница представляет собой справочную библиотеку для всех прошлых технических выпусков и списков изменений для сети Casper. Перейдите по ссылкам ниже, чтобы просмотреть подробную информацию о выпущенных версиях, такую как даты выпуска, ключевые изменения и завершенные этапы, известные проблемы и призывы к действию для валидаторов, разработчиков dApp, авторов контрактов и бирж.
vi: Trang này là thư viện tham khảo cho tất cả các bản phát hành kỹ thuật trước đây và ghi nhận thay đổi cho Mạng Casper. Nhấp vào các liên kết bên dưới để xem chi tiết về các phiên bản đã phát hành, chẳng hạn như ngày phát hành, các thay đổi quan trọng và các mốc đã hoàn thành, các sự cố đã biết và lời kêu gọi hành động cho người xác thực, nhà phát triển dApp, tác giả hợp đồng và sàn giao dịch.

source: Visit the `technical roadmap <https://github.com/casper-network/roadmap/projects/2>`_ and the `engineering status <https://github.com/casper-network/roadmap/wiki/Current-Status>`_ pages to review the work currently in progress.
ru: Посетите техническую карту `technical roadmap <https://github.com/casper-network/roadmap/projects/2>`_ и инженерный статус `engineering status <https://github.com/casper-network/roadmap/wiki/Current-Status>`_ , чтобы просмотреть текущий прогресс работы.
vi: Truy cập vào ``lộ trình công nghệ <https://github.com/casper-network/roadmap/projects/2>`_ và `trạng thái công việc <https://github.com/casper-network/roadmap/wiki/Current-Status>`_ để xem công việc đang được thực hiện.

source: Casper Network Release Notes
ru: Заметки выпусков сети Casper
vi: Ghi chú các bản phát hành của mạng Casper

source: `Version 1.2.0 <https://medium.com/casper-association/technical-release-notes-and-changelog-for-1-2-0-26bbe921ab51>`_
vi: `Phiên bản 1.2.0 <https://medium.com/casper-association/technical-release-notes-and-changelog-for-1-2-0-26bbe921ab51>`_

source: Additional Logging
ru: Дополнительный логгинг
vi: Ghi nhật ký bổ sung

source: Block Validator distinguishes Deploys and Transfers
ru: Валидатор блока распознает Развертывания и Трансферы
vi: Khối trình xác thực phân biệt các lần Triển khai và Chuyển tiền

source: Quantstamp Audit Remediation
ru: Восстановление аудита Quantstamp
vi: Biện pháp khác phục kiểm tra Quantstamp

source: `Version 1.3.0 <https://medium.com/casper-association/announcing-version-1-3-of-casper-node-ff7fa57e6d75>`_
vi: `Phiên bản 1.3.0 <https://medium.com/casper-association/announcing-version-1-3-of-casper-node-ff7fa57e6d75>`_

source: Node RPC Enhancements
ru: Усовершенствования RPC ноды
vi: Cải tiến Nút RPC

source: Smart Contracting and Application Development Updates
ru: Обновления смарт-контрактов и разработки приложений
vi: Cập nhật Hợp đồng Thông minh và Phát triển Ứng dụng

source: Networking Optimizations
ru: Оптимизация работы сети
vi: Tối ưu hóa mạng

source: Transaction (Deploy) Processing Improvements
ru: Усовершенствования процессинга трансферов (развертываний)
vi: Cải tiến xử lý giao dịch (triển khai)
