Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/disclaimer.po
Languages: ru

source: **Risks associated with abandonment / lack of success**: the Recipient understands and accepts that the creation of the CSPR and the development of the Casper blockchain as well as the CasperLabs Networks AG project may be abandoned for a number of reasons, including lack of interest from the public, lack of funding, lack of prospects (e.g. caused by competing projects) and legal, tax or regulatory considerations. The Recipient therefore understands that there is no assurance that, even if the CSPR/CasperLabs blockchain project is partially or fully developed and launched, the Recipient will receive any benefits through the CSPR held by it (if and when created and/or issued).
ru: **Риски, связанные с отказом / отсутствием успеха**: Получатель понимает и соглашается с тем, что создание CSPR и разработка блокчейна Casper, а также проект CasperLabs Networks AG могут быть прекращены по ряду причин, включая отсутствие интереса со стороны общественности, отсутствие финансирования, отсутствие перспектив (например, вызванных конкурирующими проектами) и юридические, налоговые или нормативные соображения. Таким образом, Получатель понимает, что нет никакой гарантии того, что, даже если блокчейн-проект CSPR/CasperLabs будет частично или полностью разработан и запущен, Получатель получит какие-либо выгоды через находящийся у него CSPR (если и когда он будет создан и/или выпущен).

source: **Risks associated with a loss of private key**: the Recipient understands and accepts that CSPR, if and when created and/or issued, will only be accessed by using a wallet technically compatible with CSPR and with a combination of the Recipient’s account information (address) and private key, seed or password. The Recipient understands and accepts that if its private key or password gets lost or stolen, the CSPR associated with the Recipient's account (address) will be unrecoverable and will be permanently lost.
ru: **Риски, связанные с потерей закрытого ключа**: Получатель понимает и принимает, что CSPR, если и когда он будет создан и/или выпущен, будет доступен только с помощью кошелька, технически совместимого с CSPR, и с комбинацией информации об учетной записи Получателя (адрес) и закрытого ключа, исходного кода или пароля. Получатель понимает и соглашается с тем, что в случае утери или кражи его закрытого ключа или пароля, CSPR, связанный с учетной записью (адресом) Получателя, будет невозможно восстановить и будет навсегда потерян.

source: **Risks associated with wallets:** the Recipient understands and accepts that CasperLabs Networks AG or any of its affiliates, employees, partners or advisors are in no way responsible for the wallet to which any CSPR are transferred. The Recipient understands and agrees that it is solely responsible for the access and security of its wallet, for any security breach of its wallet and/or with any loss of CSPR resulting from its wallet service provider, including any termination of the service by the wallet provider and/or bankruptcy of the wallet provider.
ru: **Риски, связанные с кошельками:** Получатель понимает и принимает, что CasperLabs Networks AG или любые ее филиалы, сотрудники, партнеры или консультанты никоим образом не несут ответственности за кошелек, на который передаются любые CSPR. Получатель понимает и соглашается с тем, что он несет полную ответственность за доступ и безопасность своего кошелька, за любое нарушение безопасности своего кошелька и/или за любую потерю CSPR, вызванную поставщиком услуг кошелька, включая любое прекращение предоставления услуг поставщиком кошелька и/или банкротство поставщика кошелька.

source: **Risks associated with theft/hacks**: the Recipient understands and accepts that the smart contract, the website, the underlying software application and software platform (i.e. the Casper blockchain), during its development and after its launch, may be exposed to attacks by hackers or other individuals that could result in an inability to launch the Casper blockchain or the theft or loss of CSPR. Any such event could also result in the loss of financial and other support of the CasperLabs Networks AG project impacting the ability to develop the CasperLabs Networks AG project and Casper blockchain.
ru: **Риски, связанные с кражей/взломами**: Получатель понимает и принимает, что смарт-контракт, веб-сайт, базовое программное приложение и программная платформа (т. е. блокчейн Casper) во время его разработки и после его запуска могут подвергнуться атакам хакеров или других лиц, которые могут привести к невозможности запуска блокчейна Casper или краже или потере CSPR. Любое такое событие также может привести к потере финансовой и другой поддержки проекта CasperLabs Networks AG, что повлияет на возможность разработки проекта CasperLabs Networks AG и блокчейна Casper.

source: **Risks associated with mining attacks**: the Recipient understands and accepts that, as with other cryptocurrencies and tokens, if and when launched, the Casper blockchain is susceptible to attacks relating to validators. Any successful attack presents a risk to the smart contract, expected proper execution and sequencing of transactions, and expected proper execution and sequencing of contract computations.
ru: **Риски, связанные с майнинговыми атаками**: Получатель понимает и принимает, что, как и в случае с другими криптовалютами и токенами, когда и если произойдет запуск блокчейн, Casper может быть подвержен атакам, связанным с валидаторами. Любая успешная атака представляет риск для смарт-контракта, ожидаемого надлежащего выполнения и последовательности транзакций, а также ожидаемого надлежащего выполнения и последовательности вычислений по контракту.

source: **Risks associated with a lack of consensus**: the Recipient understands and accepts that the network of validators will be ultimately in control of the genesis block and future blocks and that there is no warranty or assurance that the network of validators will perform their functions and reach proper consensus and allocate the CSPR to the Recipient as proposed by any terms. The Recipient further understands that a majority of the validators could agree at any point to make changes to the software and/or smart contracts and to run the new version of the software and/or smart contracts. Such a scenario could lead to the CSPR losing intrinsic value.
ru: **Риски, связанные с отсутствием консенсуса**: Получатель понимает и соглашается с тем, что сеть валидаторов в конечном итоге будет контролировать блок генезиса и будущие блоки и что нет никаких гарантий или гарантий того, что сеть валидаторов выполнит свои функции и достигнет надлежащего консенсуса и передаст CSPR Получателю, как это предлагается любыми условиями. Получатель также понимает, что большинство валидаторов могут в любой момент согласиться внести изменения в программное обеспечение и/или смарт-контракты и запустить новую версию программного обеспечения и/или смарт-контрактов. Такой сценарий может привести к тому, что CSPR потеряет внутреннюю ценность.

source: **Risks associated with liquidity of CSPR**: the Recipient understands and accepts that with regard to the CSPR, if and when created and/or issued, no market liquidity may be guaranteed and that the value of CSPR relative to other assets, including fiat currency and/or any other cryptocurrency (including any cryptocurrency used to acquire CSPR) over time may experience extreme volatility or depreciate in full (including to zero) resulting in loss that will be borne exclusively by the Recipient.
ru: **Риски, связанные с ликвидностью CSPR**: Получатель понимает и принимает, что в отношении CSPR, если и когда он был создан и/или выпущен, рыночная ликвидность не может быть гарантирована и что стоимость CSPR по отношению к другим активам, включая фиатную валюту и/или любую другую криптовалюту (включая любую криптовалюту, используемую для приобретения CSPR), со временем может испытывать чрезвычайную волатильность или обесцениваться полностью (в том числе до нуля), что приведет к убыткам, которые понесет исключительно Получатель.

source: **Risks associated with forking**: the Recipient understands and accepts that hard and soft forks as well as similar events may, inter alia, lead to the creation of new or competing tokens to the CSPR, adversely affect the functionality, convertibility or transferability or result in a full or partial loss of units or reduction (including reduction to zero) of value of the Recipient's CSPR (if and when created and/or issued).
ru: **Риски, связанные с форкингом**: Получатель понимает и соглашается с тем, что жесткие и мягкие форки, а также аналогичные события могут, в частности, привести к созданию новых или конкурирующих токенов CSPR, отрицательно повлиять на функциональность, конвертируемость или возможность передачи или привести к полной или частичной потере единиц или уменьшению (включая уменьшение до нуля) стоимости CSPR Получателя (если и когда он был создан и/или выпущен).
