Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/disclaimer.po
Languages: ru

source: **Disclaimer**
ru: **Дисклеймер**

source: By accepting this CasperLabs Tech Spec (this "**Whitepaper**"), each recipient hereof acknowledges and agrees that is not authorised to, and may not, forward or deliver this Whitepaper, electronically or otherwise, to any other person or reproduce this Whitepaper in any manner whatsoever. Any forwarding, distribution or reproduction of this Whitepaper in whole or in part is unauthorised. Failure to comply with this directive may result in a violation of applicable laws of any affected or involved jurisdiction.
ru: Принимая эту Техническую спецификацию CasperLabs (этот "**Технический документ**"), каждый получатель настоящего Документа признает и соглашается с тем, что он не уполномочен и не может пересылать или доставлять этот Технический документ, в электронном или ином виде, любому другому лицу или воспроизводить этот Технический документ любым способом. Любая пересылка, распространение или воспроизведение этого Документа полностью или частично являются несанкционированными. Несоблюдение этой директивы может привести к нарушению применимых законов любой затрагиваемой или затрагиваемой юрисдикции.

source: Nothing in this Whitepaper constitutes an offer to sell, or a solicitation to purchase, the tokens native to the Casper blockchain (“**CSPR**”). In any event, were this Whitepaper to be deemed to be such an offer or solicitation, no such offer or solicitation is intended or conveyed by this Whitepaper in any jurisdiction where it is unlawful to do so, where such an offer or solicitation would require a license or registration, or where such an offer or solicitation is subject to restrictions. In particular, any CSPR to be issued have not been, and, as of the date of issuance of this Whitepaper, are not intended to be, registered under the securities or similar laws of any jurisdiction, whether or not such jurisdiction considers the CSPR to be a security or similar instrument, and specifically, have not been, and, as of the date of issuance of this Whitepaper are not intended to be, registered under the U.S. Securities Act of 1933, as amended, or the securities laws of any state of the United States of America or any other jurisdiction and may not be offered or sold in any jurisdiction where to do so would constitute a violation of the relevant laws of such jurisdiction.
ru: Ничто в этом Техническом документе не представляет собой предложение о продаже или предложение о покупке токенов, принадлежащих блокчейну Casper (“**CSPR**”). В любом случае, если бы этот Технический документ считался таким предложением или просьбой, никакое такое предложение или просьба не предназначены или не передаются этим Техническим документом в любой юрисдикции, где это незаконно, где такое предложение или просьба потребовали бы лицензии или регистрации, или где такое предложение или просьба подлежат ограничениям. В частности, любые CSPR, подлежащие выпуску, не были и, по состоянию на дату выпуска этого Документа, не предназначены для регистрации в соответствии с законами о ценных бумагах или аналогичными законами любой юрисдикции, независимо от того, считает ли такая юрисдикция CSPR ценной бумагой или аналогичным инструментом, и, в частности, не были и, по состоянию на дату выпуска этого Документа, не предназначены для регистрации в соответствии с законодательством США. Закон о ценных бумагах 1933 года с внесенными в него поправками или законы о ценных бумагах любого штата Соединенных Штатов Америки или любой другой юрисдикции и не могут предлагаться или продаваться в любой юрисдикции, где это будет представлять собой нарушение соответствующих законов такой юрисдикции.

source: This Whitepaper constitutes neither a prospectus according to Art. 652a of the Swiss Code of Obligations (the "**CO**") or Art. 1156 CO nor a prospectus or basic information sheet according to the Swiss Financial Services Act (the "**FinSA**") nor a listing prospectus nor a simplified prospectus according to Art. 5 of the Swiss Collective Investment Schemes Act (the "**CISA**") nor any other prospectus according to CISA nor a prospectus under any other applicable laws.
ru: Настоящий Технический документ не является ни проспектом в соответствии со статьей 652a Кодекса обязательств Швейцарии ("**CO**"), ни статьей 1156, ни проспектом или основным информационным листом в соответствии с Законом Швейцарии о финансовых услугах ("**FinSA**"), ни проспектом листинга, ни упрощенным проспектом в соответствии со статьей 5 Закона Швейцарии о схемах коллективных инвестиций ("**CISA**"), ни любым другим проспектом в соответствии с CISA, ни проспектом в соответствии с любыми другими применимыми законами.

source: The CSPR are not expected to be instruments in an offer and sale which are subject to the jurisdiction or oversight of the U.S. Securities Exchange Commission (the “**SEC**”). In any event, however, CSPR have not been approved or disapproved by, and are not expected to be approved or disapproved by, the SEC nor by the securities regulatory authority of any state of the United States of America or of any other jurisdiction, and neither the SEC nor any such securities regulatory authority has passed, or is expected to pass, upon the accuracy or adequacy of this Whitepaper.
ru: Ожидается, что CSPR не будут инструментами в предложении и продаже, которые подпадают под юрисдикцию или надзор Комиссии по ценным бумагам и биржам США (“**SEC**"). В любом случае, однако, CSPR не был одобрен или не одобрен и, как ожидается, не будет одобрен или не одобрен SEC или органом по регулированию ценных бумаг любого штата Соединенных Штатов Америки или любой другой юрисдикции, и ни SEC, ни какой-либо другой орган по регулированию ценных бумаг не приняли или, как ожидается, примут решение о точности или адекватности этого Технического документа.

source: The distribution of this Whitepaper and the purchase, holding, and/or disposal of CSPR may be restricted by law in certain jurisdictions. Persons reading this Whitepaper should inform themselves as to (i) the possible tax consequences, (ii) the legal and regulatory requirements, and (iii) any foreign exchange restrictions or exchange control requirements, which they might encounter under the laws of the countries of their citizenship, residence or domi-cile and which might be relevant to the purchase, holding or disposal of CSPR. No action has been taken to authorise the distribution of this Whitepaper in any jurisdiction in which such authorisation might be required.
ru: Распространение этого Документа и покупка, хранение и/или распоряжение CSPR могут быть ограничены законом в некоторых юрисдикциях. Лица, читающие этот Информационный документ, должны ознакомиться с (i) возможными налоговыми последствиями, (ii) правовыми и нормативными требованиями и (iii) любыми валютными ограничениями или требованиями валютного контроля, с которыми они могут столкнуться в соответствии с законодательством стран их гражданства, проживания или проживания и которые могут иметь отношение к покупке, владению или распоряжению CSPR. Не было предпринято никаких действий для разрешения распространения этого Документа в любой юрисдикции, в которой может потребоваться такое разрешение.

source: No action has been or is intended to be taken by CasperLabs Networks AG and/or any of its affiliates in any jurisdiction that would or is intended to, permit a public sale or offering of any CSPR, or possession or distribution of this Whitepaper (in preliminary, proof or final form) or any other sale, offering or publicity material relating to the CSPR, in any country or jurisdiction where action for that purpose is required. Each recipient of this Whitepaper is reminded that it has received this Whitepaper on the basis that it is a person into whose possession this Whitepaper may be lawfully delivered in accordance with the laws of the jurisdiction in which it is located and/or bound and it may not nor is it authorised to deliver this document, electronically or otherwise, to any other person. If the recipient receives this document by e-mail, then its use of this e-mail is at its own risk and it is the recipient’s responsibility to take precautions to ensure that such e-mail is free from viruses and other items of a destructive nature.
ru: Компания CasperLabs Networks AG и/или любые ее филиалы не предпринимали и не намерены предпринимать никаких действий в любой юрисдикции, которые позволили бы или предназначены для публичной продажи или предложения любого CSPR, или владения или распространения этого Технического документа (в предварительной, подтверждающей или окончательной форме) или любых других продаж, предложений или рекламных материалов, относящихся к CSPR, в любой стране или юрисдикции, где требуются действия для этой цели. Каждому получателю этого Документа напоминается, что он получил этот Документ на том основании, что он является лицом, в чье владение этот Документ может быть законно передан в соответствии с законодательством юрисдикции, в которой он находится и/или связан, и он не может и не уполномочен передавать этот документ, в электронном или ином виде, любому другому лицу. Если получатель получает этот документ по электронной почте, то он использует это электронное письмо на свой страх и риск, и получатель несет ответственность за принятие мер предосторожности для обеспечения того, чтобы такое электронное письмо не содержало вирусов и других элементов разрушительного характера.

source: **Preliminary Nature of this Whitepaper**
ru: **Предварительный характер этого Документа**

source: This Whitepaper is a draft and the information set out herein is of a preliminary nature. Consequently, neither CasperLabs Networks AG nor any of its affiliates assumes any responsibility that the information set out herein is final or correct and each of the foregoing disclaims, to the fullest extent permitted by applicable law, any and all liability whether arising in tort, contract or otherwise in respect of this Whitepaper. Neither this Whitepaper nor anything contained herein shall form the basis of or be relied on in connection with or act as an inducement to enter into any contract or commitment whatsoever. Recipients should note that the final structuring of CSPR and the Casper blockchain is subject to ongoing technical, legal, regulatory and tax considerations and each is, therefore, subject to material changes. In particular, neither the applicability nor the non-applicability of Swiss financial market regulations on the CSPR sale has not been confirmed by the Swiss Financial Market Supervisory Authority ("**FINMA**"). CasperLabs Networks AG and all its affiliates reserve the right to not assist in the completion of the software underlying CSPR and the CasperLabs blockchain, to not participate in the issuance or creation of CSPR or to change the structure of CSPR and/or the Casper blockchain for any reason, each at its sole discretion.
ru: Настоящий Технический документ является черновиком, и информация, изложенная в нем, носит предварительный характер. Следовательно, ни CasperLabs Networks AG, ни кто-либо из ее аффилированных лиц не несет никакой ответственности за то, что информация, изложенная в настоящем документе, является окончательной или правильной, и каждый из вышеперечисленных отказывается в максимально возможной степени, разрешенной применимым законодательством, от любой ответственности, возникающей в связи с правонарушением, контрактом или иным образом в отношении данного Технического документа. Ни настоящий Технический документ, ни что-либо, содержащееся в нем, не должны служить основой, на которые можно полагаться в связи с каким-либо контрактом или обязательством или служить стимулом для заключения какого-либо контракта или обязательства. Получатели должны отметить, что окончательное структурирование CSPR и блокчейна Casper зависит от текущих технических, правовых, нормативных и налоговых соображений, и, следовательно, каждое из них подвержено существенным изменениям. В частности, ни применимость, ни неприменимость положений швейцарского финансового рынка о продаже CSPR не были подтверждены Швейцарским органом по надзору за финансовым рынком ("**FINMA**"). CasperLabs Networks AG и все ее дочерние компании оставляют за собой право не помогать в доработке программного обеспечения, лежащего в основе CSPR и блокчейна CasperLabs, не участвовать в выпуске или создании CSPR или изменять структуру CSPR и/или блокчейна Casper по любой причине, каждый по своему собственному усмотрению.

source: **Forward-Looking Statements**
ru: **Заявления прогностического характера**

source: This Whitepaper includes "forward-looking statements", which are all statements other than statements of historical facts included in this Whitepaper. Words like "believe", "anticipate", "expect", "project", "estimate", "predict", "intend", "target", "assume", "may", "might", "could", "should", "will" and similar expressions are intended to identify such forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors, which may cause the actual functionality, performance or features of the Casper blockchain and/or CSPR to be materially different from any future functionality, performance or features expressed or implied by such forward-looking statements. Such forward-looking statements are based on numerous assumptions regarding the CasperLabs Networks AG’s and/or any of its affiliates’ present and future expectations regarding the development of the Casper blockchain and the associated software.
ru: Этот Технический документ включает "заявления прогностического характера", которые являются всеми заявлениями, отличными от заявлений об исторических фактах, включенных в этот Технический документ. Такие слова, как "верить", "ожидать", "предполагать", "проект", "оценка", "прогнозировать", "намереваться", "цель", "допускать", "может", "возможно", "может быть", "должен", "будет" и аналогичные выражения предназначены для идентификации таких прогностических заявлений. Такие заявления прогностического характера включают известные и неизвестные риски, неопределенности и другие факторы, которые могут привести к тому, что фактическая функциональность, производительность или функции блокчейна Casper и/или CSPR будут существенно отличаться от любой будущей функциональности, производительности или функций, выраженных или подразумеваемых такими заявлениями прогностического характера. Такие заявления прогностического характера основаны на многочисленных предположениях относительно нынешних и будущих ожиданий CasperLabs Networks AG и/или любого из ее аффилированных лиц в отношении разработки блокчейна Casper и связанного с ним программного обеспечения.

source: These forward-looking statements speak only as of the date of this Whitepaper. CasperLabs Networks AG and its affiliates expressly disclaim any obligation or undertaking to release any updates of or revisions to any forward-looking statement contained herein to reflect any change in CasperLabs Networks AG’s and/or any of its affiliates’ expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.
ru: Эти заявления прогностического характера относятся только к дате настоящего Технического документа. CasperLabs Networks AG и ее филиалы прямо отказываются от каких-либо обязательств или обязательств публиковать любые обновления или изменения в любом прогностическом заявлении, содержащемся в настоящем документе, для отражения любых изменений в ожиданиях CasperLabs Networks AG и/или любых ее филиалов в отношении этого или любых изменений в событиях, условиях или обстоятельствах, на которых основано любое такое заявление.

source: **Risk Factors**
ru: **Факторы риска**

source: Furthermore, by accepting this Whitepaper, the recipient of hereof (the “**Recipient**”) acknowledges and agrees that it understands the inherent risks associated with blockchain and distributed ledger technology, tokens and cryptocurrencies in general and the CSPR in particular, including, but not limited to, those outlined hereinafter.
ru: Кроме того, принимая этот Технический документ, получатель настоящего Документа (“**Получатель**”) признает и соглашается с тем, что он понимает неотъемлемые риски, связанные с технологией блокчейна и распределенной бухгалтерской книги, токенами и криптовалютами в целом и CSPR в частности, включая, но не ограничиваясь, теми, которые описаны ниже.

source: **Risks associated with CasperLabs Networks AG’s experience**: the Recipient is aware that CasperLabs Networks AG and its affiliates constitute a start-up group of companies. Inability of such companies to manage their affairs, including any failure to attract and retain appropriate personnel, could affect the completion and functionality of the Casper blockchain.
ru: **Риски, связанные с опытом CasperLabs Networks AG**: Получатель знает, что CasperLabs Networks AG и ее дочерние компании составляют начинающую группу компаний. Неспособность таких компаний управлять своими делами, включая любую неспособность привлечь и удержать соответствующий персонал, может повлиять на завершение и функциональность блокчейна Casper.

source: **Risks associated with CSPR relative value**: the Recipient understands and accepts that a purchaser of CSPR may experience financial losses relative to other assets, including fiat currency and/or any other cryptocurrency (including any cryptocurrency used to acquire CSPR). Potential purchasers and holders of CSPR are urged to carefully review this Whitepaper and assess and understand the risk factors relating to the CSPR and the Casper blockchain before acquiring CSPR (when and if CSPR become available).
ru: **Риски, связанные с относительной стоимостью CSPR**: Получатель понимает и принимает, что покупатель CSPR может понести финансовые потери по отношению к другим активам, включая фиатную валюту и/или любую другую криптовалюту (включая любую криптовалюту, используемую для приобретения CSPR). Потенциальным покупателям и держателям CSPR настоятельно рекомендуется внимательно изучить этот Технический документ и оценить и понять факторы риска, связанные с CSPR и блокчейном Casper, прежде чем приобретать CSPR (когда и если CSPR станет доступным).

source: **Risks associated with (intellectual) property rights**: the Recipient understands and accepts that, due to a lack of originality of the software and to the immaterial character of the CSPR, there may be no title of ownership in and to the intellectual property rights relating to CSPR.
ru: **Риски, связанные с правами (интеллектуальной) собственности**: Получатель понимает и соглашается с тем, что из-за отсутствия оригинальности программного обеспечения и нематериального характера CSPR может отсутствовать право собственности на права интеллектуальной собственности, относящиеся к CSPR.

source: **Risks associated with blockchain**: the Recipient understands and accepts that the smart contract, the underlying software application and software platform (i.e. the Casper blockchain) is still in an early development stage and unproven. The Recipient understands and accepts that there is no warranty that the process for creating the CSPR and/or the Casper blockchain will be uninterrupted or error-free and acknowledges that there is an inherent risk that the software could contain weaknesses, vulnerabilities or bugs causing, inter alia, the complete loss of CSPR. The Recipient understands and accepts that, after launch of the Casper blockchain, the smart contract and/or underlying protocols and/or the Casper blockchain and/or any other software involved may either delay and/or not execute a contribution due to the overall contribution volume, mining attacks and/or similar events.
ru: **Риски, связанные с блокчейном**: Получатель понимает и принимает, что смарт-контракт, базовое программное приложение и программная платформа (т. е. блокчейн Casper) все еще находятся на ранней стадии разработки и не проверены. Получатель понимает и принимает, что нет никаких гарантий того, что процесс создания CSPR и/или блокчейна Casper будет непрерывным или безошибочным, и признает, что существует неотъемлемый риск того, что программное обеспечение может содержать слабые места, уязвимости или ошибки, приводящие, в частности, к полной потере CSPR. Получатель понимает и соглашается с тем, что после запуска блокчейна Casper смарт-контракт и/или базовые протоколы и/или блокчейн Casper и/или любое другое задействованное программное обеспечение могут либо задержать и/или не выполнить вклад из-за общего объема вклада, атак майнинга и/или аналогичных событий.

source: **Risk of weaknesses in the field of cryptography**: the Recipient understands and accepts that cryptography is a technology that evolves relatively fast over time. At the same time, methods and tools to decrypt, access and/or manipulate data stored on a distributed ledger or blockchain are highly likely to progress in parallel and in addition, new technological developments such as quantum computers may pose as of now unpredictable risks to the CSPR and the Casper blockchain that could increase the risk of theft or loss of CSPR (if and when CSPR are created and/or issued).
ru: **Риск слабых мест в области криптографии**: получатель понимает и принимает, что криптография - это технология, которая развивается относительно быстро с течением времени. В то же время методы и инструменты для расшифровки, доступа и/или манипулирования данными, хранящимися в распределенной бухгалтерской книге или блокчейне, с высокой вероятностью будут развиваться параллельно, и, кроме того, новые технологические разработки, такие как квантовые компьютеры, могут на данный момент представлять непредсказуемые риски для CSPR и блокчейна Casper, которые могут увеличить риск кражи или потери CSPR (если и когда CSPR будут созданы и/или выпущены).

source: **Regulatory risks**: the Recipient understands and accepts that it is possible that certain jurisdictions will apply existing regulations on, or introduce new regulations addressing, distributed ledger technology and/or blockchain technology based applications, which may be contrary to the current setup of the smart contract or the CasperLabs Networks AG project and which may, inter alia, result in substantial modifications of the smart contract and/or the CasperLabs Networks AG project, including its termination and the loss of the CSPR, if and when created and/or issued, or entitlements to receive CSPR, for the Recipient.
ru: **Регуляторные риски**: Получатель понимает и соглашается с тем, что некоторые юрисдикции могут применять существующие правила или вводить новые правила, касающиеся технологий распределенной бухгалтерской книги и/или приложений, основанных на технологии блокчейн, которые могут противоречить текущей настройке смарт-контракта или проекта CasperLabs Networks AG и которые могут, в частности, привести к существенным изменениям смарт-контракта и/или проекта CasperLabs Networks AG, включая его прекращение и потерю CSPR, если и когда он был создан и/или выпущен, или права на получение CSPR для Получателя.
