Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/kv-storage-tutorial.po
Languages: fr, ru, vi

source: Key-Value Storage Tutorial
fr: Tutoriel sur le stockage des valeurs clés
ru: Туториал по хранилищу ключей-значений
vi: Hướng dẫn lưu trữ Khoá-Giá trị

source: This tutorial covers a simple contract, which creates a key that stores a ``CLType`` value. This example will show you how to store a *U64*, *string*, *account hash*, or *U512* value.
fr: Ce tutoriel couvre un contrat simple, qui crée une clé qui stocke une valeur ``CLType``. Cet exemple vous montrera comment stocker une valeur *U64*, *string*, *account hash* ou *U512*.
ru: В этом руководстве рассматривается простой контракт, который создает ключ, в котором хранится значение "CLType". В этом примере показано, как сохранить значение *U64*, *string*, *account hash* или *U512*.
vi: Hướng dẫn này bao gồm một hợp đồng đơn giản, tạo ra một khóa lưu trữ giá trị ``CLType``. Ví dụ này sẽ chỉ cho bạn cách lưu trữ giá trị *U64*, *string*, *account hash* hoặc *U512*.

source: The code is available in the `Casper Ecosystem GitHub <https://github.com/casper-ecosystem/kv-storage-contract>`_. Or, you can get started in `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_.
fr: Le code est disponible dans le `Casper Ecosystem GitHub <https://github.com/casper-ecosystem/kv-storage-contract>`_. Ou, vous pouvez commencer dans `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_.
ru: Код доступен в `Casper Ecosystem GitHub <https://github.com/casper-ecosystem/kv-storage-contract>`_. Или вы можете начать с `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_.
vi: Mã có sẵn trong `GitHub hệ sinh thái Casper <https://github.com/casper-ecosystem/kv-storage-contract>`_. Hoặc, bạn có thể bắt đầu trong `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_.

source: The Contract
fr: Le Contrat
ru: Контракт
vi: Hợp đồng

source: Let's start by understanding the structure of the contract itself. Here we create a contract and name it ``kvstorage_contract``. The contract package will be stored under this name on the blockchain. Since the key-value contract is slightly stateless, initialization is not required.
fr: Commençons par comprendre la structure du contrat lui-même. Ici, nous créons un contrat et le nommons ``kvstorage_contract``. Le package du contrat sera stocké sous ce nom sur la blockchain. Comme le contrat clé-valeur (key-value) est légèrement stateless (sans état), l'initialisation n'est pas nécessaire.
ru: Давайте начнем с понимания структуры самого контракта. Здесь мы создаем контракт и называем его ``kvstorage_contract``. Пакет контракта будет храниться под этим именем в блокчейне. Поскольку контракт ключа-значения немного не имеет состояния, инициализация не требуется.
vi: Hãy bắt đầu bằng cách hiểu cấu trúc của chính hợp đồng. Ở đây chúng tôi tạo một hợp đồng và đặt tên là ``kvstorage_contract``. Gói hợp đồng sẽ được lưu trữ dưới tên này trên chuỗi khối. Vì hợp đồng khóa-giá trị không có trạng thái nên không bắt buộc phải khởi tạo.

source: Testing the Contract
fr: Test du Contrat
ru: Тестирование контракта
vi: Kiểm thử hợp đồng

source: The Casper Contracts SDK supports local testing of smart contracts. This tutorial will cover how to test the U64 key-value function, which you can adapt for other types.
fr: Le kit SDK Casper Contracts prend en charge les tests locaux des contrats intelligents. Ce tutoriel explique comment tester la fonction clé-valeur U64, que vous pouvez adapter à d'autres types.
ru: Пакет SDK Casper Contracts поддерживает локальное тестирование смарт-контрактов. В этом руководстве будет рассказано, как протестировать функцию ключа-значения U64, которую вы можете адаптировать для других типов.
vi: Casper Contracts SDK hỗ trợ thử nghiệm cục bộ các hợp đồng thông minh. Hướng dẫn này sẽ trình bày cách kiểm tra hàm key-value U64 mà bạn có thể điều chỉnh cho các loại khác.

source: To test the contract, you need to deploy the contract and store the value on chain. Here is some sample code to accomplish these steps:
fr: Pour tester le contrat, vous devez déployer le contrat et stocker la valeur sur la chaîne. Voici un exemple de code pour accomplir ces étapes :
ru: Чтобы протестировать контракт, вам необходимо развернуть контракт и сохранить значение в цепочке. Вот пример кода для выполнения этих шагов:
vi: Để kiểm thử hợp đồng, bạn cần triển khai hợp đồng và lưu trữ giá trị trên chuỗi. Dưới đây là một số mã mẫu để thực hiện các bước sau:

source: Write Unit Tests
fr: Ecriture de tests unitaires
ru: Написание Модульных Тестов
vi: Viết kiểm thử đơn vị

source: With these functions in place, it's possible to start writing tests for the contract.
fr: Une fois ces fonctions en place, il est possible de commencer à écrire des tests pour le contrat.
ru: С помощью этих функций можно приступить к написанию тестов для контракта.
vi: Với các hàm này, bạn có thể bắt đầu viết các bài kiểm thử cho hợp đồng.

source: Running Locally
fr: Execution en local
ru: Запуск локально
vi: Chạy cục bộ

source: You can run unit tests locally if you have set up the contract using `cargo-casper` as shown in the `Getting started <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ guide.
fr: vous pouvez exécuter des tests unitaires localement si vous avez configuré le contrat à l'aide de `cargo-casper` comme indiqué dans le guide `Démarrage <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_.
ru: Вы можете запускать модульные тесты локально, если вы настроили контракт с помощью `cargo-casper`, как показано в гайде `Getting started <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ .
vi: Bạn có thể chạy cục bộ kiểm thử đơn vị nếu bạn đã thiết lập hợp đồng bằng cách sử dụng `cargo-casper` như trong phần hướng dẫn `Bắt đầu <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_.

source: Deploying to the Testnet and Interacting with the Contract
fr: Déploiement sur le Testnet et interaction avec le contrat
ru: Развертывание в Тестовой сети и взаимодействие с Контрактом
vi: Triển khai với Testnet và Tương tác với Hợp đồng

source: When working with the testnet, create an account on `Testnet CSPR Live <https://testnet.cspr.live>`_ and fund it using the faucet. Download the private key and use the key to sign the deployment. It's possible to create keys using the rust client as well.
fr: Lorsque vous travaillez avec le testnet, créez un compte sur `Testnet CSPR Live <https://testnet.cspr.live>`_ et alimentez-le en utilisant l'outil 'faucet'. Téléchargez la clé privée et utilisez la clé pour signer le déploiement. Il est possible de créer des clés en utilisant le client rust également.
ru: При работе с тестовой сетью создайте аккаунт в `Testnet CSPR Live <https://testnet.cspr.live>`_ и финансируйте его с помощью крана. Загрузите закрытый ключ и используйте его для подписи развертывания. Также можно создавать ключи с помощью клиента rust.
vi: Khi làm việc với mạng thử nghiệm, hãy tạo một tài khoản trên `Testnet CSPR Live <https://testnet.cspr.live>`_ và nạp tiền bằng cách sử dụng chốt. Tải xuống khóa cá nhân và sử dụng khóa để ký triển khai. Cũng có thể tạo khóa bằng ứng dụng client rust.

source: Deploy the Contract
fr: Déployer le contrat
ru: Развертывание контракта
vi: Triển khai hợp đồng

source: After compiling the contract, you need to deploy the compiled WASM to the network. This action installs the contract in the blockchain.
fr: Après avoir compilé le contrat, vous devez déployer le WASM compilé sur le réseau. Cette action installe le contrat dans la blockchain.
ru: После компиляции контракта вам необходимо развернуть скомпилированный WASM в сети. Это действие устанавливает контракт в блокчейн.
vi: Sau khi biên dịch hợp đồng, bạn cần triển khai WASM đã biên dịch vào mạng. Hành động này cài đặt hợp đồng trong chuỗi khối.

source: The following example shows you how to use the Casper client to retrieve the contract session hash and the block hash where the contract is deployed. The paths for the *secret-key* and *session-path* are relative to your system. You need to specify the paths on your machine to run the command.
fr: L'exemple suivant vous montre comment utiliser le client Casper pour récupérer le hash de session du contrat et le hash de bloc où le contrat est déployé. Les chemins pour *secret-key* et *session-path* sont relatifs à votre système. Vous devez spécifier les chemins sur votre machine pour exécuter la commande.
ru: В следующем примере показано, как использовать клиент Casper для получения хеша сеанса контракта и хеша блока, в котором развернут контракт. Пути для *секретного ключа* и *пути сеанса* относятся к вашей системе. Вам необходимо указать пути на вашем компьютере для выполнения команды.
vi: Ví dụ sau đây cho bạn thấy cách sử dụng client Casper để truy xuất mã băm phiên hợp đồng và băm khối nơi hợp đồng được triển khai. Các đường dẫn cho *secret-key* và *session-path* có liên quan đến hệ thống của bạn. Bạn cần chỉ định các đường dẫn trên máy của mình để chạy lệnh.

source: **Query the Account & Get the Contract Hash**
fr: **Interroger le Compte et obtenir le Hash du Contrat**
ru: **Запрос аккаунта и получение хеша контракта**
vi: **Truy vấn tài khoản & lấy hợp đồng băm**

source: The internal state of the blockchain is updated via a series of steps (blocks). All blockchain queries must include a `global state hash` which corresponds to the block hash or height of the blockchain. Visit `Querying the address of a contract <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_.
fr: L'état interne de la blockchain est mis à jour via une série d'étapes (blocs). Toutes les requêtes de blockchain doivent inclure un `hache d'état global` (global state hash) qui correspond au hash de bloc ou à la hauteur de la blockchain. Visiter le site `Interroger l'address d'un contrat <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_.
ru: Внутреннее состояние блокчейна обновляется с помощью серии шагов (блоков). Все запросы блокчейна должны включать "хэш глобального состояния", который соответствует хэшу блока или высоте блокчейна. Посетите `Запрос адреса контракта <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_.
vi: Trạng thái bên trong của chuỗi khối được cập nhật thông qua một loạt các bước (khối). Tất cả các truy vấn chuỗi khối phải bao gồm một `băm trạng thái toàn cục` tương ứng với băm khối hoặc chiều cao của chuỗi khối. Truy cập `Truy vấn địa chỉ của hợp đồng <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_.

source: **Invoke an Entry Point & Set a value**
fr: **Invoquer un point d'entrée et définir une valeur**
ru: **Вызов точки входа и установка значения**
vi: **Gọi một Điểm vào & Đặt giá trị**

source: Once the contract is deployed, you can create another deploy, which calls one of the entry points within the contract. You must know the entry point's name or the session hash retrieved in the previous step to call an entry point. The command below shows you how to do this. The *session-path* is relative to your system. Specify the path on your machine and then run the command.
fr: Une fois le contrat déployé, vous pouvez créer un autre deploy, qui appelle l'un des points d'entrée du contrat. Vous devez connaître le nom du point d'entrée ou le hash de session récupéré à l'étape précédente pour appeler un point d'entrée. La commande ci-dessous vous montre comment procéder. Le *session-path* est relatif à votre système. Spécifiez le chemin sur votre machine, puis exécutez la commande.
ru: После развертывания контракта вы можете создать другое развертывание, которое вызывает одну из точек входа в рамках контракта. Для вызова точки входа необходимо знать имя точки входа или хеш сеанса, полученный на предыдущем шаге. Команда ниже показывает, как это сделать. *Путь к сеансу* относится к вашей системе. Укажите путь на своем компьютере, а затем выполните команду.
vi: Sau khi hợp đồng được triển khai, bạn có thể tạo một triển khai khác, gọi một trong các điểm đầu vào trong hợp đồng. Bạn phải biết tên của điểm vào hoặc băm phiên được truy xuất ở bước trước để gọi điểm vào. Lệnh dưới đây hướng dẫn bạn cách thực hiện việc này. *session-path* có liên quan đến hệ thống của bạn. Chỉ định đường dẫn trên máy của bạn và sau đó chạy lệnh.

source: The kv-client has four distinct commands to set key-values for U64, string, U512, and account hash. In this example, we will use a String.
fr: Le kv-client dispose de quatre commandes distinctes pour définir les valeurs de clé pour U64, string, U512 et hash de compte. Dans cet exemple, nous allons utiliser une chaîne de caractère.
ru: У kv-клиента есть четыре отдельные команды для установки значений ключей для U64, строки, U512 и хеша аккаунта. В этом примере мы будем использовать строку.
vi: kv-client có bốn lệnh riêng biệt để đặt key-values cho U64, chuỗi, U512 và băm tài khoản. Trong ví dụ này, chúng tôi sẽ sử dụng một chuỗi.

source: If the deploy works, a you will see a similar response:
fr: Si le déploiement fonctionne, vous verrez une réponse similaire :
ru: Если развертывание сработает, вы увидите аналогичный ответ:
vi: Nếu triển khai hoạt động, bạn sẽ thấy một phản hồi tương tự:

source: Query the Contract On Chain
fr: Interroger le contrat sur la chaîne (On Chain)
ru: Запрос контракта в цепочке
vi: Truy vấn Hợp đồng trên chuỗi

source: Contracts can be executed under different contexts. In this example, when the contract is deployed, it runs in the context of a ``Contract`` and not a ``Session``. This means that all stored keys are not stored under the account hash, but within the context of the contract. Therefore, when we query to retrieve the value under a key, we are querying ``AccountHash/kvstorage_contract/<key-name>`` and not just ``AccountHash/<key-name>``.
fr: Les contrats peuvent être exécutés dans différents contextes. Dans cet exemple, lorsque le contrat est déployé, il s'exécute dans le contexte d'un ``Contrat`` et non d'une ``Session``. Cela signifie que toutes les clés stockées ne sont pas stockées sous le hash du compte, mais dans le contexte du contrat. Par conséquent, lorsque nous interrogeons pour récupérer la valeur d'une clé, nous interrogeons ``AccountHash/kvstorage_contract/<key-name>`` et pas seulement ``AccountHash/<key-name>``.
ru: Контракты могут быть исполнены в разных контекстах. В этом примере, когда контракт разворачивается, он запускает контекст "Контракта", а не "Сеанса". Это означает, что все хранимые ключи хранятся не в хеше аккаунта, а внутри контекста контракта. И когда мы запрашиваем получение значения под ключом, мы запрашиваем ``AccountHash/kvstorage_contract/<key-name>``, а не просто ``AccountHash/<key-name>``.
vi: Hợp đồng có thể được thực hiện trong các bối cảnh khác nhau. Trong ví dụ này, khi hợp đồng được triển khai, nó chạy trong ngữ cảnh của ``Contract`` chứ không phải là ``Session``. Điều này có nghĩa là tất cả các khóa được lưu trữ không được lưu trữ dưới băm tài khoản, mà trong ngữ cảnh của hợp đồng. Do đó, khi chúng tôi truy vấn để truy xuất giá trị trong một khóa, chúng tôi truy vấn ``AccountHash/kvstorage_contract/<key-name>`` chứ không chỉ ``AccountHash/<key-name>``.

source: It would be best if you first found the block hash for the block that contains your deploy. Once you have the requisite block hash, you can use the Casper client to retrieve the session hash.
fr: Il serait préférable que vous trouviez d'abord le hash du bloc pour le bloc qui contient votre déploiement. Une fois que vous avez le hash du bloc requis, vous pouvez utiliser le client Casper pour récupérer le hash de session.
ru: Было бы лучше, если бы вы сначала нашли хеш блока для блока, содержащего ваше развертывание. Как только у вас будет необходимый хеш блока, вы можете использовать клиент Casper для получения хеша сеанса.
vi: Sẽ là tốt nhất nếu trước tiên bạn tìm thấy mã băm khối cho khối chứa triển khai của bạn. Khi bạn có băm khối cần thiết, bạn có thể sử dụng ứng dụng client Casper để truy xuất băm phiên.

source: Reading a value is simple; we obtain the block hash under which the value is stored, and then using that block hash, we use the ``query-state`` command to retrieve the value stored under a named key.
fr: La lecture d'une valeur est simple : nous obtenons le hash du bloc sous lequel la valeur est stockée, puis à l'aide de ce hash de bloc, nous utilisons la commande ``query-state`` pour récupérer la valeur stockée sous une clé nommée.
ru: Считывание значения просто; мы получаем хеш блока, в котором хранится значение, а затем, используя этот хеш блока, мы используем команду состояния запроса ``query-state`` для извлечения значения, хранящегося под именованным ключом.
vi: Đọc một giá trị rất đơn giản; chúng tôi nhận được băm khối mà giá trị được lưu trữ, sau đó sử dụng băm khối đó, chúng tôi sử dụng lệnh ``query-state`` để truy xuất giá trị được lưu trữ dưới một khóa được đặt tên.

source: An example global state query looks like this:
fr: Un exemple de requête d'état global ressemble à ceci :
ru: Пример запроса глобального состояния выглядит следующим образом:
vi: Một truy vấn trạng thái toàn cục mẫu trông giống như sau:

source: Please reference the `Querying Section <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_ for more details.
fr: Se référer à la `Section Requêtes <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_ pour plus de détails.
ru: Пожалуйста обратитесь к разделу о запросах `Querying Section <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_ за подробностями.
vi: Vui lòng tham khảo `Phần truy vấn <https://docs.casperlabs.io/en/latest/dapp-dev-guide/calling-contracts.html#querying-global-state-for-the-address-of-a-contract>`_ để biết thêm chi tiết.
