Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/node-operator/setup.po
Languages: ru

source: Basic Node Setup
ru: Базовая настройка ноды

source: Casper Node Launcher
ru: Лаунчер ноды Casper

source: The node software is run from the ``casper-node-launcher`` package. This can be installed with a Debian package which also creates the Casper user, creates directory structures and sets up a *systemd* unit and *logrotate*.
ru: Софт ноды запускается из пакета лаунчера ``casper-node-launcher``. Это можно установить с пакетом Debian, который также создает пользователя Casper, структуры каталога и настраивает юнит *systemd* и *logrotate*.

source: The casper-node-launcher Debian package can be obtained from https://repo.casperlabs.io/. You only need to run these steps once.
ru: Пакет Debian для запуска ноды Casper можно получить тут https://repo.casperlabs.io/. Вам нужно лишь однажды запустить эти шаги.

source: Then, proceed to install the casper-node-launcher by running these commands:
ru: Затем начните процесс установки лаунчера ноды casper c помощью следующих команд:

source: You can also build from source: https://github.com/casper-network/casper-node-launcher. However, all of the setup and pull of casper-node releases will be manual.
ru: Также можно собрать из источника: https://github.com/casper-network/casper-node-launcher. В любом случае, все настройки и извлечения выпусков ноды будут ручными.

source: File Locations
ru: Расположение файлов

source: This section describes the directories and files the ``casper-node-launcher`` Debian install creates, needed for running ``casper-node`` versions and performing upgrades.
ru: Эта секция описывает каталоги и файлы, которые создает Debian установщик ``casper-node-launcher``, они необходимы для запуска версий ``casper-node`` и осуществления обновлений.

source: A *casper* user and *casper* group is created during install and used to run the software.
ru: Пользователь *casper* и группа *casper* создаются во время установки и используются для запуска софта.

source: Each version of the ``casper-node`` install is located based on the semantic version with underscores. For example, version *1.0.3* would be represented by a directory named ``1_0_3``. This convention applies to both binary and configuration file locations. We will represent versioning with ``[m_n_p]`` below, representing the major, minor, patch of a semantic version.
ru: Каждая версия установки "casper-node" расположена на основе семантической версии с подчеркиванием. Например, версия *1.0.3* будет представлена каталогом с именем "1_0_3". Это соглашение применяется как к двоичным, так и к расположениям файлов конфигурации. Ниже мы представим управление версиями с помощью "[m_n_p]", представляющего основной, второстепенный патч семантической версии.

source: **Note**: multiple versioned folders will exist on a system when upgrades are setup.
ru: **Примечание**: при установке обновлений в системе будет существовать несколько папок с версиями.

source: The installation of ``casper-node-launcher``, ``casper-node``, and ``casper-client`` software is relatively simple, but the process accomplishes many things behind the scenes. This section describes the installation process and where the files are stored.
ru: Установка программного обеспечения "casper-node-launcher", "casper-node" и "casper-client" относительно проста, но процесс выполняет множество задач за кулисами. В этом разделе описывается процесс установки и место хранения файлов.

source: Two main folders are relevant for our software: ``/etc/casper`` and ``/var/lib/casper``.
ru: Две основные папки, связанные с нашим ПО: ``/etc/casper`` и ``/var/lib/casper``.

source: The following is the state of the filesystem after installing the ``casper-client`` and ``casper-node-launcher`` Debian packages, and also after running the script */etc/casper/pull_casper_node_version.sh*.
ru: Ниже приведено состояние файловой системы после установки пакетов Debian "casper-client" и "casper-node-launcher", а также после запуска сценария */etc/casper/pull_casper_node_version.sh*.

source: The default location for executables from the Debian package install is ``/usr/bin``.
ru: Расположение по умолчанию для исполняемых файлов из установки пакета Debian - "/usr/bin".

source: ``casper-client`` - A client for interacting with the Casper network
ru: ``casper-client`` - клиент для работы с сетью Casper

source: ``casper-node-launcher`` - The launcher application which starts the ``casper-node`` as a child process
ru: ``casper-node-launcher`` - приложение лаунчер, которое начинает ноду ``casper-node`` как дочерний процесс

source: This is the default location for configuration files. It can be overwritten with the ``CASPER_CONFIG_DIR`` environment variable. The paths in this document assume the default configuration file location of ``/etc/casper``. The data is organized as follows:
ru: Это расположение по умолчанию для файлов конфигурации. Его можно перезаписать переменной среды "CASPER_CONFIG_DIR". Пути в этом документе предполагают расположение файла конфигурации по умолчанию "/etc/casper". Данные организованы следующим образом:

source: **delete_local_db.sh** - Removes `*.lmdb*` from ``/var/lib/casper/casper-node``
ru: **delete_local_db.sh** - удаляет`*.lmdb*` из``/var/lib/casper/casper-node``

source: **pull_casper_node_version.sh** <protocol_version> <network_name> - Pulls ``bin.tar.gz`` and ``config.tar.gz`` from `genesis.casperlabs.io <http://genesis.casperlabs.io/>`_ for a protocol package; decompresses them into ``/var/lib/bin/<protocol_version>`` and ``/etc/casper/<protocol_version>``, and removes the *\*.tar.gz* files
ru: **pull_casper_node_version.sh** <protocol_version> <network_name> - извлекает ``bin.tar.gz`` и ``config.tar.gz`` из `genesis.casperlabs.io <http://genesis.casperlabs.io/>`_ для пакета протокола; декомпрессирует их в ``/var/lib/bin/<protocol_version>`` и ``/etc/casper/<protocol_version>``, и удаляет файлы *\*.tar.gz*

source: **config_from_example.sh** <protocol_version> - Gets external an IP to replace and create the *config.toml* from *config-example.toml*
ru: **config_from_example.sh** <protocol_version> - получает внешний IP для замены и создания *config.toml* из *config-example.toml*

source: **casper-node-launcher-state.toml** - This is the local state for the ``casper-node-launcher`` and it is created during the first run
ru: **casper-node-launcher-state.toml** - локальное состояние лаунчера ``casper-node-launcher`` и оно создается во время первого запуска

source: ``validator_keys`` - The default location for node keys.
ru: ``validator_keys`` - локация по умолчанию для ключей ноды.

source: **README.md** - Instructions on how to create validator keys using the ``casper-client``
ru: **README.md** - инструкции о том, как создать ключи валидатора с использованием клиента ``casper-client``

source: **secret_key.pem** - ``casper-client keygen`` creates this file or it is manually copied here
ru: **secret_key.pem** - `генератор ключей `casper-client keygen`` создает этот файл или он копируется сюда вручную

source: **public_key.pem** - ``casper-client keygen`` creates this file or it is manually copied here
ru: **secret_key.pem** - `генератор ключей `casper-client keygen`` создает этот файл или он копируется сюда вручную

source: **public_key_hex** - ``casper-client keygen`` creates this file or it is manually copied here
ru: **public_key_hex** - генератор ключей ``casper-client keygen`` создает этот файл или он копируется сюда вручную

source: ``1_0_0`` - created with *pull_casper_node_version.sh 1_0_0 <network_name>* for genesis files
ru: ``1_0_0`` - созданный с *pull_casper_node_version.sh 1_0_0 <network_name>* для файлов генезиса

source: **accounts.toml** - Contains the genesis validators and delegators
ru: **accounts.toml** - содержит валидаторов и делегатов генезиса

source: **chainspec.toml** - Contains the genesis state with the *activation_point* as a timestamp
ru: **chainspec.toml** - содержит состояние генезиса с точкой активации *activation_point* как временной отпечаток

source: **config-example.toml** - Example for creating a *config.toml* file
ru: **config-example.toml** - пример для создания файла *config.toml*

source: **config.toml** - Created by a node operator manually or by running *config_from_example.sh 1_0_0*
ru: **config.toml** - созданный оператором ноды вручную или через запуск *config_from_example.sh 1_0_0*

source: ``m_n_p`` - *0* to *N* upgrade packages
ru: ``m_n_p`` - пакеты обновлений от *0* до *N*

source: **chainspec.toml** - Contains the *activation_point* as the Era ID int
ru: **chainspec.toml** - содержит точку активации *activation_point* как целое ID эры

source: **config.toml** - Created by a node operator manually or by running *config_from_example.sh <protocol_version>*
ru: **config.toml** - создано оператором ноды вручную или через запуск *config_from_example.sh <protocol_version>*

source: This is the location for larger and variable data for the ``casper-node``, organized in the following directories and files:
ru: Это расположение для более объемной и разнообразной информации для ``casper-node``, организованная в соответствующие каталоги и файлы:

source: ``bin`` - The location for storing the versions of ``casper-node`` executables. This location can be overwritten with the ``CASPER_BIN_DIR`` environment variable. The paths in this document assume the default of ``/var/lib/casper/bin``.
ru: ``bin`` - расположение для хранения версий исполняемых кодов ноды ``casper-node``. Эту локацию можно переписать с переменной среды ``CASPER_BIN_DIR``. Пути в этом документе предполагают ``/var/lib/casper/bin`` по умолчанию.

source: ``1_0_0`` - Created with *pull_casper_node_version.sh 1_0_0 <network_name>* for binaries
ru: ``1_0_0`` - Создано с *pull_casper_node_version.sh 1_0_0 <network_name>* для двоичных

source: ``casper-node`` - Defaults to the Ubuntu 18.04 compatible binary
ru: ``casper-node`` - по умолчанию используется с Ubuntu 18.04 совместимыми двоичными

source: **README.md** - Information about the repository location and the Git hash used for compilation to allow a rebuild on other platforms
ru: **README.md** - информация о расположении директория и хеш Git, используемый для разрешения на пересборку на других платформах

source: ``m_n_p`` - *0* to *N* upgrade packages for binaries using *pull_casper_node_version.sh 1_0_0 <network_name>*
ru: ``m_n_p`` - пакеты обновления от *0* до *N* upgrade для двоичных, использующие версию *pull_casper_node_version.sh 1_0_0 <network_name>*

source: ``casper-node`` - This is where the given version of the ``casper-node`` executable lives and is run from the ``casper-node-launcher``.
ru: ``casper-node`` - место, где расположена данная версия исполняемых кодов ноды ``casper-node`` и запускается из лаунчера ``casper-node-launcher``.

source: ``casper-node`` - Local data store and the largest user of disc space
ru: ``casper-node`` - локальное хранилище информации и самый большой объект в дисковом пространстве

source: **data.lmdb** - Global state of the chain
ru: **data.lmdb** - глобальное состояние цепочки

source: **storage.lmdb** - Blocks, deploys, and everything else
ru: **storage.lmdb** - блоки, развертывания и все остальное

source: **unit_\*** - The node creates one of these files per era
ru: **unit_\*** - нода создает один из таких файлов за эру

source: Upgrade Operation
ru: Операция апгрейда

source: The ``chainspec.toml`` contains a section to indicate what era the given ``casper-node`` version should start running.
ru: Файл ``chainspec.toml`` содержит раздел, который показывает, какую эру должна запустить текущая версия ноды ``chainspec.toml``.

source: At every block finalization, the ``casper-node`` looks for newly configured versions. When a new version is configured, the running node will look at future era_id in the ``chainspec.toml`` file. This will be the era before where the current casper-node will cleanly shut down.
ru: При завершении каждого блока, ``casper-node`` ищет новые сконфигурированные версии. Когда новая версия сконфигурирована, работающая нода посмотрит на идентификатор era_id будущей эры в файле ``chainspec.toml``. Это будет эра до того, как текущая надо Casper будет полностью закрыта.

source: The ``casper-node-launcher`` will detect a clean exit 0 condition and start the next version ``casper-node``.
ru: Лаунчер ``casper-node-launcher`` обнаружит чистые условия выхода 0 и начнет следующую версию ноды ``casper-node``.

source: You can choose to build from source. If you opt to do this, please ensure that the correct software version (tag) is used.
ru: Вы можете выбрать сборку из исходного кода. Если вы решите сделать это, пожалуйста, убедитесь, что используется правильная версия программного обеспечения (тег).

source: Node Version Installation
ru: Установка версии ноды

source: Included with ``casper-node-launcher`` debian package are two scripts to help with installing ``casper-node`` versions.
ru: В пакет debian "casper-node-launcher" входят два скрипта, помогающие устанавливать версии "casper-node".

source: ``/etc/casper/pull_casper_node_version.sh`` will pull ``bin.tar.gz`` and ``config.tar.gz`` from genesis.casperlabs.io.
ru: ``/etc/casper/pull_casper_node_version.sh`` извлечет ``bin.tar.gz`` и ``config.tar.gz`` из genesis.casperlabs.io.

source: This is invoked with the release version in underscore format such as:
ru: Это вызывается с версией выпуска в формате подчеркивания, например:

source: This will create ``/var/lib/casper/bin/1_0_2/`` and expand the ``bin.tar.gz`` containing at a minimun ``casper-node``.
ru: Это создаст ``/var/lib/casper/bin/1_0_2/`` и расширит ``bin.tar.gz`` содержащий как минимум ``casper-node``.

source: This will create ``/etc/casper/1_0_2/`` and expand the ``config.tar.gz`` containing ``chainspec.toml``, ``config-example.toml``, and possibly ``accounts.csv`` and other files.
ru: Это создаст ``/etc/casper/1_0_2/`` и расширит ``config.tar.gz`` содержащий ``chainspec.toml``, ``config-example.toml``, и возможно ``accounts.csv`` и другие файлы.

source: This will remove the arcive files and run ``/etc/casper/config_from_example.sh 1_0_2`` to create a ``config.toml`` from the ``config-example.toml``.
ru: Это удалит архивные файлы и запустит ``/etc/casper/config_from_example.sh 1_0_2``, чтобы создать файл ``config.toml`` из ``config-example.toml``.

source: Client Installation
ru: Установка клиента

source: The ``casper-client`` can be installed from https://crates.io/crates/casper-client.
ru: Клиент ``casper-client`` может быть установлен из https://crates.io/crates/casper-client.

source: Run the commands below to install the Casper client on most flavors of Linux and macOS. You will need the nightly version of the compiler.
ru: Запустите команды ниже, чтобы установить клиент Casper на большинстве Linux и macOS. Вам потребуется ночная версия компилятора.

source: Doing this, you'll see a warning, which you can ignore for now.
ru: Вы увидите предупреждение которое вы можете сейчас проигнорировать.

source: The Casper client can print out `help` information, which provides an up-to-date list of supported commands.
ru: Клиент Casper может распечатать вспомогательную информацию `help`, которая дает список самых последних поддерживаемых команд.

source: For each command, you can use `help` to get the up-to-date arguments and descriptions:
ru: Для каждой команды вы можете использовать `help` для получения свежих параметров и описаний:

source: Create Keys
ru: Создание ключей

source: The Rust client generates keys via the ``keygen`` command. The process generates 2 *pem* files and 1 *text* file. To learn about options for generating keys, include ``--help`` when running the ``keygen`` command.
ru: Клиент Rust генерирует ключи с помощью команды "keygen". Процесс генерирует 2 *pem* файла и 1 *текстовый* файл. Чтобы узнать о параметрах генерации ключей, включите "--help" при выполнении команды "keygen".

source: More about keys and key generation can be found in ``/etc/casper/validator_keys/README.md`` if ``casper-node-lancher`` was installed from the Debian package.
ru: Больше о ключах и генерировании можно найти в ``/etc/casper/validator_keys/README.md`` если лаунчер ``casper-node-lancher`` был установлен из пакета Debian.

source: Config File
ru: Файл Config

source: One ``config.toml`` file will need to exist for each ``casper-node`` version installed. It should be located in the ``/etc/casper/[m_n_p]/`` directory where ``m_n_p`` is the current semantic version. This can be created from ``config-example.toml`` by using ``/etc/casper/config_from_example.sh [m_n_p]`` where ``[m_n_p]`` is replaced current version with underscores.
ru: Один файл ``config.toml`` должен существовать для каждой установленной версии ``casper-node``. Он должен быть расположен в каталоге ``/etc/casper/[m_n_p]/``, где ``m_n_p`` является текущей семантической версией. Это можно сделать из файла ``config-example.toml`` с помощью ``/etc/casper/config_from_example.sh [m_n_p]`` где ``[m_n_p]`` заменено текущей версией с нижним подчеркиваниями.

source: Below are some fields you may find in the ``config.toml`` that you may want or need to adjust.
ru: Ниже приведены некоторые поля, которые вы можете найти в файле ``config.toml``, который вам возможно захочется или понадобится отрегулировать.

source: Trusted Hash for Synchronizing
ru: Доверенный хеш для синхронизации

source: The Casper network is a permissionless, proof of stake network - which implies that validators can come and go from the network. The implication is that, after a point in time, historical data could have less security if it is retrieved from ‘any node’ on the network. Therefore, joining the network has to be from a trusted source, a bonded validator. The system will start from the hash from a recent block and then work backward from that block to obtain the deploys and finalized blocks from the linear block store. Here is the process to get the trusted hash:
ru: Сеть Casper - это инклюзивная сеть Proof-of-Stake, что подразумевает, что валидаторы могут приходить и уходить из сети. Подразумевается, что через определенный момент времени исторические данные могут иметь меньшую безопасность, если они будут получены с "любой ноды" в сети. Поэтому подключение к сети должно осуществляться из надежного источника, связанного валидатора. Система начнет с хеша из недавнего блока, а затем будет работать в обратном направлении от этого блока, чтобы получить развернутые и завершенные блоки из хранилища линейных блоков. Вот процесс получения надежного хеша:

source: Find a list of trusted validators.
ru: Найти список надежных валидаторов.

source: Query the status endpoint of a trusted validator ( http://[validator_id]:8888/status )
ru: Запросите статус конечной точки надежного валидатора ( http://[validator_id]:8888/status )

source: Obtain the hash of a block from the status endpoint.
ru: Получите хеш блока из конечной точки статуса.

source: Update the ``config.toml`` for the node to include the trusted hash. There is a field dedicated to this near the top of the file.
ru: Обновите файл ``config.toml``, чтобы включить надежный хеш в ноду. Имеется поле, посвященное этому, рядом с верхушкой файла.

source: Secret Keys
ru: Секретные ключи

source: Provide the path to the secret keys for the node. This is set to ``etc/casper/validator_keys/`` by default.
ru: Обеспечьте секретным ключам путь к ноде. Это настроено в ``etc/casper/validator_keys/`` по умолчанию.

source: Networking & Gossiping
ru: Нетворкинг & Госсипинг

source: The node requires a publicly accessible IP address. We do not recommend NAT at this time. Specify the public IP address of the node. If you use the ``config_from_example.sh`` external services are called to find your IP and this is inserted into the created ``config.toml``.
ru: Для ноды требуется общедоступный IP-адрес. В настоящее время мы не рекомендуем использовать NAT. Укажите общедоступный IP-адрес узла. Если вы используете "config_from_example.sh" внешние службы вызываются для поиска вашего IP-адреса, и он вставляется в созданный "config.toml".

source: Default values are specified in the file if you want to change them:
ru: Значения по умолчанию определяются в файле, если вы хотите их изменить:

source: Specify the port that will be used for status & deploys
ru: Определите порт, который будут использоваться для статуса и развертываний

source: Specify the port used for networking
ru: Определите порт для нетворкинга

source: Known_addresses - these are the bootstrap nodes. No need to change these.
ru: Known_addresses - это ноды начальной загрузки. Нет необходимости их менять.
