Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/delegate.po
Languages: ru

source: Delegating with the Command-line
ru: Делегирование из командной строки

source: This document details a workflow where an account holder on the Casper Network can delegate their tokens to a validator on a Casper Network.
ru: В этом документе подробно описывается рабочий процесс, в котором владелец учетной записи в сети Casper может делегировать свои токены валидатору в сети Casper.

source: This workflow assumes:
ru: Этот рабочий процесс предполагает:

source: You meet the `prerequisites <setup.html>`_
ru: Вы соответствуете 'предварительным условиям <setup.html>`_

source: You are using the Casper command-line client
ru: Вы используете клиент командной строки Casper

source: You have the public key of a validator on a Casper Network
ru: У вас есть открытый ключ валидатора в сети Casper

source: You have the delegation contract or WASM to execute on the network
ru: У вас есть контракт на делегирование или WASM для выполнения в сети

source: You have a valid ``node-address``
ru: У вас есть действительный "адрес ноды"

source: You have previously `deployed a smart contract <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ to a Casper Network
ru: Вы уже ранее 'развертывали смарт-контракт <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ в сети Casper.

source: Building The Delegation WASM
ru: Сборка WASM делегирования

source: Obtain the ``delegate.wasm`` by cloning the `casper-node <https://github.com/casper-network/casper-node>`_ repository and building the contracts.
ru: Получите ``delegate.wasm`` с помощью клонирования каталога `casper-node <https://github.com/casper-network/casper-node>`_ и сборки контрактов.

source: To build contracts, set up Rust, and install all dependencies. Visit `Setting up Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ in the Developer Guide for step-by-step instructions.
ru: Для сборки контракта, настройте Rust и установите все зависимости. Посетите раздел о настройке в гайде разработчика `Setting up Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ для получения пошаговых инструкций.

source: Once you build the contracts, you can use the ``delegate.wasm`` to create a deploy that will initiate the delegation process. The WASM can be found in:
ru: После создания контрактов вы можете использовать ``delegate.wasm`` для создания развертывания, которое инициирует процесс делегирования. WASM можно найти в:

source: Acquiring a Validator's Public Key
ru: Получение открытого ключа Валидатора

source: The official Testnet and Mainnet provide a browser-based block explorer to look up the list of validators within their respective networks:
ru: Официальные Testnet и Mainnet предоставляют обозреватель блоков на основе браузера для просмотра списка валидаторов в своих соответствующих сетях:

source: `Validators on Mainnet <https://cspr.live/validators>`_
ru: `Валидаторы в основной сети <https://cspr.live/validators>`_

source: `Validators on Testnet <https://testnet.cspr.live/validators>`_
ru: `Валидаторы в тестовой сети <https://testnet.cspr.live/validators>`_

source: You will see a list of validators present on the network and their total stake (including tokens from other delegators).
ru: Вы увидите список валидаторов, присутствующих в сети, и их общий стейк (включая токены от других делегаторов).

source: You can click on any validator listed to see more information about the validator, including the validator's personal stake.
ru: Вы можете нажать на любой из перечисленных валидаторов, чтобы просмотреть дополнительную информацию о валидаторе, включая личный стейк валидатора.

source: Each validator will show the delegation rate (commission); this represents the percentage of **your** reward share that the validator will retain. Thus, a 10% rate implies that the validator will retain 10% of your reward share. As a prospective delegator, selecting a validating node that you can trust and offers a favorable delegation rate is essential. Please do your due diligence before you stake your tokens with a validator.
ru: Каждый валидатор покажет коэффициент делегирования (комиссию); это представляет собой процент от **вашей** доли вознаграждения, которую сохранит валидатор. Таким образом, курс 10% подразумевает, что валидатор сохранит 10% вашей доли вознаграждения. В качестве потенциального делегатора важно выбрать проверяющую ноду, которой вы можете доверять и которая предлагает выгодную скорость делегирования. Пожалуйста, проявите должную осмотрительность, прежде чем ставить свои токены на карту с помощью валидатора.

source: Note the ``PublicKey`` of the validator you have selected to delegate your tokens.
ru: Обратите внимание на "публичный ключ" валидатора, который вы выбрали для делегирования своих токенов.

source: If you observe your delegation request in the bid structure but do not see the associated validator key in the ``era_validators`` structure, the validator you selected is not part of the current validator set. In this event, your tokens will not be earning rewards unless you un-delegate, wait through the unbonding period, and re-delegate to another validator.
ru: Если вы видите свой запрос на делегирование в структуре предложения, но не видите связанного ключа валидатора в структуре "era_validators", выбранный вами валидатор не входит в текущий набор валидаторов. В этом случае ваши токены не будут получать вознаграждения, если вы не отмените делегирование, не дождетесь периода отмены привязки - анбондинга - и не передадите их другому валидатору.

source: Additionally, any rewards earned are re-delegated by default to the validator from the initial delegation request. Therefore at the time of un-delegation, you may want to un-delegate the initial amount plus any additional rewards earned through the delegation process.
ru: Кроме того, все полученные вознаграждения по умолчанию повторно делегируются валидатору из первоначального запроса на делегирование. Поэтому во время отмены делегирования вы можете отменить делегирование первоначальной суммы плюс любые дополнительные вознаграждения, полученные в процессе делегирования

source: The active validator set is constantly rotating; therefore, when delegating to a validator, remember that the validator you selected may have been rotated out of the set.
ru: Активный набор валидаторов постоянно меняется; поэтому при делегировании валидатору помните, что выбранный вами валидатор, возможно, был удален из набора.

source: Executing the Delegation Request
ru: Выполнение запроса на делегирование

source: We recommend first testing the following steps on our official Testnet before performing these steps in a live environment like the Casper Mainnet.
ru: Мы рекомендуем сначала протестировать следующие шаги в нашей официальной тестовой сети, прежде чем выполнять эти шаги в реальной среде, такой как сеть Casper Mainnet.

source: Sending the Delegation Deploy
ru: Отправка развертывания делегирования

source: Send a deploy containing the ``delegate.wasm`` to the network to initiate the delegation process. Here is an example deployment of the delegation request:
ru: Отправьте развертывание, содержащее ``delegate.wasm`` в сеть для инициации процесса делегирования. Вот пример развертывания запроса на делегирование:

source: **Note** The delegator's public key and the secret key that signs the deploy must be part of the same key pair.
ru: **Примечание** Открытый ключ делегатора и секретный ключ, подписывающий развертывание, должны быть частью одной и той же пары ключей.

source: **Request fields:**
ru: **Поля запросов:**

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт узла, на котором запущена служба HTTP [по умолчанию:http://localhost:7777]

source: ``secret-key`` - Path to secret key file
ru: ``secret-key`` - путь к файлу с секретным ключом

source: ``chain-name`` - Name of the chain, to avoid the deploy from being accidentally or maliciously included in a different chain
ru: ``chain-name`` - Имя цепочки, чтобы избежать случайного или злонамеренного включения развертывания в другую цепочку

source: The *chain-name* for testnet is **casper-test**
ru: *Имя цепочки* для тестнет - **casper-test**

source: The *chain-name* for mainnet is **casper**
ru: *Имя цепочки* для майннет - **casper**

source: ``session-path`` - The path to where the ``delegate.wasm`` is located
ru: ``session-path`` - путь к расположению ``delegate.wasm``

source: ``session-arg`` - The arguments to the ``delegate`` execution
ru: ``session-arg`` - аргументы для выполнения "делегирования"

source: The argument ``validator`` is the public key of the validator to whom the tokens will be delegated
ru: Аргумент "валидатор" является открытым ключом валидатора, кому будут делегированы токены

source: The argument ``amount`` is the number of tokens to be delegated
ru: Аргумент "сумма" - это количество токенов, которые должны быть делегированы

source: The argument ``delegator`` is the public key of the account delegating tokens to a validator
ru: Аргумент "делегатор" - это открытый ключ учетной записи, делегирующий токены валидатору

source: **Important response fields:**
ru: **Важные области реагирования:**

source: ``"result"."deploy_hash"`` - the address of the executed delegation request.
ru: ``"result"."deploy_hash"`` - адрес выполненного запроса на делегирование.

source: Save the returned `deploy_hash` from the output to query information about the delegation deploy later.
ru: Сохраните возвращенный 'deploy_hash' из выходных данных, чтобы позже запросить информацию о развертывании делегирования.

source: Refer to the `Deploy Status <querying.html#deploy-status>`_ section to learn how to confirm that your deploy was executed successfully.
ru: Обратитесь к разделу 'Статус развертывания <querying.html#deploy-status>`_ , чтобы узнать, как подтвердить, что ваше развертывание было выполнено успешно.

source: Confirming the Delegation
ru: Подтверждение делегирования

source: A Casper Network maintains an `auction` where validators `bid` on slots to become part of the active validator set. Delegation rewards are only earned for a validator who has won the auction and is part of the active set. Thus to ensure the delegated tokens can earn rewards, we must first check that:
ru: Сеть Casper поддерживает `аукцион`, на котором валидаторы "делают ставки" - биды на слоты, чтобы стать частью активного набора валидаторов. Награды за делегирование начисляются только для валидатора, который выиграл аукцион и является частью активного набора. Таким образом, чтобы гарантировать, что делегированные токены могут приносить вознаграждение, мы должны сначала проверить, что:

source: Our delegation is part of the `bid` to the `auction`
ru: Наше делегирование является частью "бида" "аукциона"

source: The validator is part of the `active` validator set
ru: Валидатор является частью "активного" набора валидаторов

source: Once the deploy has been executed, we can query the auction for information to confirm our delegation. We can use the Casper command-line client to create an RPC request with the following query:
ru: Как только развертывание будет выполнено, мы можем запросить у аукциона информацию для подтверждения нашего делегирования. Мы можем использовать клиент командной строки Casper для создания запроса RPC со следующим запросом:

source: **Request fields**:
ru: **Поля запросов:**

source: The ``get-auction-info`` call will return all the bids currently in the auction contract and the list of active validators for ``4`` future eras from the present era.
ru: Вызов получения информации об аукционе ``get-auction-info`` вернет все биды, указанные в настоящее время в аукционном контракте, и список активных валидаторов для "4" будущих эр от нынешней эры.

source: Below is a sample output:
ru: Ниже приведен пример вывода:

source: If your public key and associated amount appear in the ``bid`` data structure, this means that the delegation request has been processed successfully. However, this does not mean the associated validator is part of the validator set, so you need to check the validator status.
ru: Если ваш открытый ключ и связанная с ним сумма отображаются в структуре данных "bid", это означает, что запрос на делегирование был успешно обработан. Однако это не означает, что связанный валидатор является частью набора валидаторов, поэтому вам необходимо проверить статус валидатора.

source: Checking Validator Status
ru: Проверка статуса валидатора

source: The auction maintains a field called ``era_validators``, which contains the validator information for 4 future eras from the current era. An entry for a specific era lists the ``PublicKeys`` of the active validators for that era along with their stake in the network.
ru: Аукцион поддерживает поле под названием "era_validators", которое содержит информацию о валидаторе для 4 будущих эр от текущей эры. В записи для определенной эпохи перечислены "публичные ключи" активных валидаторов для этой эры, а также их доля - стейк - в сети.

source: If a validator is part of the set, its public key will be present in the ``era_validators`` field as part of the ``Auction`` data structure. We can use the Casper command-line client to create an RPC request to obtain auction information and assert that the selected validator is part of the active validator set.
ru: Если валидатор является частью набора, его открытый ключ будет присутствовать в поле "era_validators" как часть структуры данных "Аукцион". Мы можем использовать клиент командной строки Casper для создания запроса RPC для получения информации об аукционе и утверждения, что выбранный валидатор является частью активного набора валидаторов.

source: **Important Response fields**:
ru: **Важные области реагирования:**

source: In the response, check the ``"auction_state"."era_validators"`` structure, which should contain the public key of the selected validator for the era in which the validator will be active.
ru: В ответе проверьте структуру `"auction_state"."era_validators"`, которая должна содержать открытый ключ выбранного валидатора для эры, в которой валидатор будет активен.

source: Below is an example of the ``era_validators`` structure:
ru: Ниже приведен пример структуры "era_validators" :

source: In the above example, we see the public keys of the active validators in Era ``9``.
ru: В приведенном выше примере мы видим открытые ключи активных валидаторов в эре "9".

source: **Note**: Validators earn delegation rewards only when they are part of the active set. This information is time-sensitive; therefore, a validator selected today may not be part of the set tomorrow. Keep this in mind when creating a delegation request.
ru: **Примечание**: Валидаторы получают вознаграждение за делегирование только в том случае, если они являются частью активного набора. Эта информация зависит от времени; поэтому валидатор, выбранный сегодня, может не быть частью набора завтра. Имейте это в виду при создании запроса на делегирование.
