Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/ledger-setup.po
Languages: fr, ru, vi

source: Ledger Setup
fr: Configuration Ledger
ru: Установка Ledger
vi: Cài đặt Ledger

source: A Ledger Device is a hardware wallet that is considered one of the most secure ways to store your digital assets. Ledger uses an offline, or cold storage, method of generating private keys, making it a preferred method for many crypto users. This guide will help you to connect your Ledger device to the Casper Web wallet (https://cspr.live). The Casper Web wallet enables you to send and receive CSPR tokens.
fr: Un appareil Ledger est un portefeuille matériel qui est considéré comme l'un des moyens les plus sûrs de stocker vos actifs numériques. Ledger utilise une méthode hors ligne, ou stockage à froid, pour générer des clés privées, ce qui en fait la méthode préférée de nombreux utilisateurs de crypto-monnaies. Ce guide vous aidera à connecter votre appareil Ledger au porte-monnaie Web Casper (https://cspr.live). Le porte-monnaie Web Casper vous permet d'envoyer et de recevoir des jetons CSPR.
ru: Устройство Ledger - это аппаратный кошелек, который считается одним из наиболее безопасных способов хранения ваших цифровых активов. Ledger использует автономный или холодный метод хранения для генерации закрытых ключей, что делает его предпочтительным методом для многих криптопользователей. Это руководство поможет вам подключить устройство Ledger к веб-кошельку Casper (https://cspr.live). Веб-кошелек Casper позволяет отправлять и получать токены CSPR.
vi: Thiết bị Ledger là một ví cứng được coi là một trong những cách an toàn nhất để lưu trữ tài sản kỹ thuật số của bạn. Ledger sử dụng phương pháp tạo khóa cá nhân ngoại tuyến hoặc lưu trữ lạnh, khiến nó trở thành phương pháp được nhiều người dùng tiền điện tử ưa thích. Hướng dẫn này sẽ giúp bạn kết nối thiết bị Ledger của mình với ví Web Casper (https://cspr.live). Ví Web Casper cho phép bạn gửi và nhận token CSPR.

source: If you need help, contact us on the following services:
fr: Si vous avez besoin d'aide, contactez-nous sur les liens suivants :
ru: Если вам нужна помощь, свяжитесь с нами через эти сервисы:
vi: Nếu bạn cần trợ giúp, hãy liên hệ với chúng tôi theo các kênh sau:

source: Requirements
fr: Exigences
ru: Требования
vi: Yêu cầu

source: Before you begin
fr: Avant de commencer
ru: Перед началом работы
vi: Trước khi bắt đầu

source: You have initialized your Ledger Nano S/X.
fr: Vous avez initialisé votre Ledger Nano S/X.
ru: Вы инициализировали свой Ledger Nano S/X.
vi: Bạn đã khởi tạo Ledger Nano S/X của mình.

source: You have installed the latest firmware on your Ledger Nano S/X.
fr: Vous avez installé le dernier firmware sur votre Ledger Nano S/X.
ru: Вы установили последнюю версию прошивки на свой Ledger Nano S/X.
vi: Bạn đã cài đặt firmware mới nhất trên Ledger Nano S/X của mình.

source: Ledger Live is ready to use.
fr: Ledger Live est prêt à être utilisé.
ru: Ledger Live готов к использованию.
vi: Ledger Live sẵn sàng để sử dụng.

source: You have installed a Chromium-based browser such as Chrome or Brave.
fr: Vous avez installé un navigateur basé sur Chromium, tel que Chrome ou Brave.
ru: Вы установили браузер на основе Chromium, такой как Chrome или Brave.
vi: Bạn đã cài đặt một trình duyệt dựa trên Chromium, chẳng hạn như Chrome hoặc Brave.

source: Install the Casper app on the Ledger device
fr: Installez l'application Casper sur l'appareil Ledger.
ru: Установите приложение Casper на устройство Ledger
vi: Cài đặt ứng dụng Casper trên thiết bị Ledger

source: Open the Manager in Ledger Live.
fr: Ouvrez le gestionnaire (Manager) dans Ledger Live.
ru: Откройте Manager в Ledger Live
vi: Mở Trình quản lý trong Ledger Live.

source: Connect and unlock your Ledger device.
fr: Connectez et déverrouillez votre appareil Ledger.
ru: Подключите и разблокируйте свое устройство Ledger.
vi: Kết nối và mở khóa thiết bị Ledger của bạn.

source: If asked, allow the manager on your device by pressing the right button.
fr: Si on vous le demande, autorisez le gestionnaire sur votre appareil en appuyant sur le bouton droit.
ru: Если требуется, разрешите менеджеру на вашем устройстве, нажав правую кнопку.
vi: Nếu được yêu cầu, hãy cho phép trình quản lý trên thiết bị của bạn bằng cách nhấn nút bên phải.

source: Find Casper in the app catalog.
fr: Trouvez Casper dans le catalogue d'applications.
ru: Найдите Casper в каталоге приложений.
vi: Tìm Casper trong danh mục ứng dụng.

source: Click the Install button of the app.
fr: Cliquez sur le bouton Installer de l'application.
ru: Нажмите кнопку Установить в приложении.
vi: Nhấp vào nút Cài đặt của ứng dụng.

source: An installation window appears.
fr: Une fenêtre d'installation apparaît.
ru: Появится окно установки.
vi: Một cửa sổ cài đặt xuất hiện.

source: Your device will display **"Processing…"**
fr: Votre appareil affichera **"Processing... "**.
ru: На вашем устройстве отобразится **"Обработка..."**
vi: Thiết bị của bạn sẽ hiển thị **"Processing…"**

source: The app installation is confirmed.
fr: L'installation de l'application est confirmée.
ru: Установка приложения подтверждена.
vi: Cài đặt ứng dụng được xác nhận.

source: Use Ledger device with your Web wallet
fr: Utilisez le dispositif Ledger avec votre portefeuille Web
ru: Используйте устройство Ledger с вашим веб-кошельком
vi: Sử dụng thiết bị Ledger với ví Web của bạn

source: Sign in
fr: Connectez-vous
ru: Регистрация
vi: Đăng nhập

source: You can now use the Ledger device with Web wallet. Follow these steps:
fr: Vous pouvez maintenant utiliser le l'appareil Ledger avec Web wallet. Suivez ces étapes :
ru: Теперь вы можете использовать устройство Ledger с веб-кошельком. Выполните следующие действия:
vi: Bây giờ bạn có thể sử dụng thiết bị Ledger với ví Web. Làm theo các bước sau:

source: Open the Casper app on your Ledger device.
fr: Ouvrez l'application Casper sur votre appareil Ledger.
ru: Откройте приложение Casper на устройстве Ledger.
vi: Mở ứng dụng Casper trên thiết bị Ledger của bạn.

source: Go to `cspr.live/sign-in <https://cspr.live/sign-in>`_.
fr: Allez sur `cspr.live/sign-in <https://cspr.live/sign-in>`_.
ru: Зайдите в `cspr.live/sign-in <https://cspr.live/sign-in>`_.
vi: Chuyển tới `cspr.live/sign-in <https://cspr.live/sign-in>`_.

source: Click on the **Connect** button in the Ledger section.
fr: Cliquez sur le bouton **Connect** dans la section Ledger.
ru: Нажмите на кнопку **Connect** в разделе Ledger
vi: Nhấp vào nút **Connect** trong phần Ledger.

source: Click on the **Connect to Ledger wallet** button.
fr: Cliquez sur le bouton **Connexion au portefeuille Ledger**.
ru: Нажмите **Connect to Ledger wallet**
vi: Nhấp vào nút **Connect to Ledger wallet**.

source: Select an account you want to use.
fr: Sélectionnez un compte que vous voulez utiliser.
ru: Выберите учетную запись, которую вы хотите использовать.
vi: Chọn một tài khoản bạn muốn sử dụng.

source: Now, your Ledger device is connected to the Web wallet.
fr: Maintenant, votre appareil Ledger est connecté au portefeuille Web.
ru: Теперь ваше устройство Ledger подключено к веб-кошельку.
vi: Bây giờ, thiết bị Ledger của bạn đã được kết nối với ví Web.

source: View account details
fr: Afficher les détails du compte
ru: Просмотр сведений об учетной записи
vi: Xem chi tiết tài khoản

source: Go to `cspr.live <https://cspr.live>`_.
fr: Allez sur `cspr.live <https://cspr.live>`_.
ru: Зайдите в `cspr.live <https://cspr.live>`_.
vi: Chuyển tới `cspr.live <https://cspr.live>`_.

source: Click on the account address in the upper-right corner of the page.
fr: Cliquez sur l'adresse du compte dans le coin supérieur droit de la page.
ru: Нажмите на адрес учетной записи в правом верхнем углу страницы.
vi: Nhấp vào địa chỉ tài khoản ở góc trên bên phải của trang.

source: Click on the **View account** button.
fr: Cliquez sur le bouton **Voir le compte**.
ru: Нажмите на кнопку **Просмотреть учетную запись**.
vi: Bấm vào nút **Xem tài khoản**.

source: Image showing the account details.
fr: Image montrant les détails du compte.
ru: Изображение, показывающее данные учетной записи.
vi: Hình ảnh hiển thị chi tiết tài khoản.

source: You are presented with a page displaying details about your account.
fr: Une page affichant les détails de votre compte s'ouvre.
ru: Вам будет представлена страница с подробной информацией о вашей учетной записи.
vi: Bạn sẽ thấy một trang hiển thị thông tin chi tiết về tài khoản của bạn.

source: View account balance
fr: Afficher le solde du compte
ru: Просмотр баланса счета
vi: Xem số dư tài khoản

source: You can check your account balance from the Web wallet:
fr: Vous pouvez vérifier le solde de votre compte à partir du portefeuille Web :
ru: Вы можете проверить баланс своего счета с помощью веб-кошелька:
vi: Bạn có thể kiểm tra số dư tài khoản của mình từ ví Web:

source: Follow the steps described in the "View account details" section above.
fr: Suivez les étapes décrites dans la section "Afficher les détails du compte" ci-dessus.
ru: Выполните действия, описанные в разделе "Просмотр сведений об учетной записи" выше.
vi: Thực hiện theo các bước được mô tả trong phần "Xem chi tiết tài khoản" ở trên.

source: On the **Liquid Account Balance** row, you will see your latest known account balance.
fr: Sur la ligne **Solde du compte liquide**, vous verrez le dernier solde connu de votre compte.
ru: В строке **Ликвидный баланс счета** вы увидите свой последний известный баланс счета.
vi: Trên hàng **Số dư tài khoản thanh khoản**, bạn sẽ thấy số dư tài khoản mới nhất của mình.

source: Receive tokens
fr: Recevoir des jetons
ru: Получение токенов
vi: Nhận token

source: To receive tokens, you need to provide the sender with the public key of your account. To find it:
fr: Pour recevoir des jetons, vous devez fournir à l'expéditeur la clé publique de votre compte. Pour la trouver :
ru: Чтобы получить токены, вам необходимо предоставить отправителю открытый ключ вашей учетной записи. Чтобы найти его:
vi: Để nhận token, bạn cần cung cấp cho người gửi khóa công khai của tài khoản của bạn. Để tìm nó:

source: Open the account details page (see the "View account details" section).
fr: Ouvrez la page des détails du compte (voir la section "Afficher les détails du compte").
ru: Откройте страницу сведений об учетной записи (см. раздел "Просмотр сведений об учетной записи").
vi: Mở trang chi tiết tài khoản (xem phần "Xem chi tiết tài khoản").

source: Copy the public key found on the **Public Key** row.
fr: Copiez la clé publique qui se trouve sur la ligne **Clé publique**.
ru: Скопируйте открытый ключ, найденный в строке **Открытый ключ**.
vi: Sao chép khóa công khai được tìm thấy trên hàng **Khóa công khai**.

source: Alternatively, click on the drop-down menu on your account address.
fr: Vous pouvez également cliquer sur le menu déroulant de l'adresse de votre compte.
ru: Или нажмите в раскрывающемся меню на адрес вашей учетной записи.
vi: Ngoài ra, hãy nhấp vào menu thả xuống trên địa chỉ tài khoản của bạn.

source: Click on the **Copy public key** button.
fr: Cliquez sur le bouton **Copier la clé publique**.
ru: Нажмите на кнопку **Копировать открытый ключ**.
vi: Nhấp vào nút **Sao chép khóa công khai**.

source: Share the public key with the sender.
fr: Partagez la clé publique avec l'expéditeur.
ru: Поделитесь открытым ключом с отправителем.
vi: Chia sẻ khóa công khai với người gửi.

source: Send tokens
fr: Envoyer les jetons
ru: Отправка токенов
vi: Gửi token

source: Sign in with your Ledger device.
fr: Connectez-vous avec votre appareil Ledger.
ru: Войдите в систему с помощью своего устройства Ledger.
vi: Đăng nhập bằng thiết bị Ledger của bạn.

source: Click on **Wallet** and then **Transfer CSPR**.
fr: Cliquez sur **Portefeuille** et ensuite sur **Transfert CSPR**.
ru: Нажмите на **Кошелек**, а затем **Перевод CSPR**.
vi: Nhấp vào **Ví** và sau đó nhấp vào **Chuyển CSPR**.

source: Fill in the details for the transfer.
fr: Remplissez les détails du transfert.
ru: Заполните реквизиты для перевода.
vi: Điền thông tin chi tiết để chuyển khoản.

source: Image showing the transfer details.
fr: Image montrant les détails du transfert.
ru: Изображение, показывающее детали передачи.
vi: Hình ảnh hiển thị chi tiết chuyển khoản.

source: Click on the **Next** button.
fr: Cliquez sur le bouton **Suivant**.
ru: Нажмите на кнопку **Далее**.
vi: Nhấp vào nút **Tiếp theo**.

source: On the next page, click **Confirm and transfer**.
fr: Sur la page suivante, cliquez sur **Confirmer et transférer**.
ru: На следующей странице нажмите **Подтвердить и перевести**.
vi: Trên trang tiếp theo, nhấp vào **Xác nhận và chuyển**.

source: Image showing the confirmation page.
fr: Image montrant la page de confirmation.
ru: Изображение, показывающее страницу подтверждения.
vi: Hình ảnh hiển thị trang xác nhận.

source: On the **Sign transaction** page, click on the **Sign with Ledger** button.
fr: Sur la page **Signer la transaction**, cliquez sur le bouton **Signer avec Ledger**.
ru: На странице **Подписать транзакцию** нажмите кнопку **Подписать с помощью Ledger**.
vi: Trên trang **Ký giao dịch**, nhấp vào nút **Ký bằng Ledger**.

source: Image showing the transfer signing page.
fr: Image montrant la page de signature du transfert.
ru: Изображение, показывающее страницу подписания передачи.
vi: Hình ảnh hiển thị trang ký chuyển khoản.

source: Your Ledger hardware wallet will present you with transfer details. Verify the transfer details (txn hash, chain ID, source **account**, fee, target, and amount).
fr: Votre porte-monnaie matériel Ledger vous présentera les détails du transfert. Vérifiez les détails du transfert (hash txn, ID de la chaîne, **compte** source, frais, cible et montant).
ru: Ваш аппаратный кошелек Ledger предоставит вам информацию о переводе. Проверьте данные перевода (хэш txn, идентификатор цепочки, исходный **аккаунт**, комиссия, цель и сумма).
vi: Ví cứng Ledger của bạn sẽ cung cấp cho bạn chi tiết chuyển khoản. Xác thực chi tiết chuyển khoản (băm txn, ID chuỗi, tài khoản **nguồn**, phí, đích và số tiền).

source: **Verify the transaction on your Ledger device**
fr: **Vérifiez la transaction sur votre appareil Ledger**.
ru: **Верифицируйте транзакцию на своем устройстве Ledger**
vi: **Xác thực giao dịch trên thiết bị Ledger của bạn**

source: Press the right button on your Ledger Device to review the transaction details (Amount and Address) until you see **“Approve”**.
fr: Appuyez sur le bouton de droite de votre appareil Ledger pour vérifier les détails de la transaction (montant et adresse) jusqu'à ce que vous voyiez **"Approuver "**.
ru: Нажмите правую кнопку на устройстве Ledger, чтобы просмотреть детали транзакции (сумму и адрес), пока не увидите **“Утвердить”**.
vi: Nhấn nút bên phải trên Thiết bị Ledger của bạn để xem lại chi tiết giao dịch (Số tiền và Địa chỉ) cho đến khi bạn thấy **“Approve”**.

source: Verify the **txn hash** - make sure it matches the value displayed in the Web wallet on `cspr.live <https://cspr.live>`_.
fr: Vérifiez le **txn hash** - assurez-vous qu'il correspond à la valeur affichée dans le portefeuille Web sur `cspr.live <https://cspr.live>`_.
ru: Проверьте **хеш txn** - убедитесь, что он соответствует значению, отображаемому в веб-кошельке на `cspr.live <https://cspr.live>`_.
vi: Xác thực **txn hash** - đảm bảo rằng nó khớp với giá trị được hiển thị trong ví Web trên `cspr.live <https://cspr.live>`_.

source: The *txn hash* value continues on a second screen.
fr: La valeur du *txn hash* se poursuit sur un deuxième écran.
ru: Значение хэша *txn* продолжается на втором экране.
vi: Giá trị *txn hash* tiếp tục trên màn hình thứ hai.

source: The next page displays transaction **type** - for CSPR transfers, that will be **Token transfer**.
fr: La page suivante affiche le **type de transaction** - pour les transferts CSPR, ce sera **Token transfer**.
ru: На следующей странице отображается транзакция **тип** - для переводов CSPR это будет **Передача токенов**.
vi: Trang tiếp theo hiển thị giao dịch **type** - đối với chuyển khoản CSPR, đó sẽ là **Token transfer**.

source: Verify the **chain ID**, which identifies the network on which you want to send the transaction.
fr: Vérifiez le **chain ID**, qui identifie le réseau sur lequel vous voulez envoyer la transaction.
ru: Проверьте **идентификатор цепочки**, который идентифицирует сеть, по которой вы хотите отправить транзакцию.
vi: Xác thực **chain ID** để xác định mạng mà bạn muốn gửi giao dịch.

source: Verify the **account**, which is the public key of the account that initiated the transaction.
fr: Vérifiez le **compte**, qui est la clé publique du compte qui a initié la transaction.
ru: Проверьте **учетную запись**, которая является открытым ключом учетной записи, инициировавшей транзакцию.
vi: Xác thực **account**, là khóa công khai của tài khoản đã khởi xướng giao dịch.

source: The *account* value continues on a second screen.
fr: La valeur du **compte** se poursuit sur un deuxième écran.
ru: Значение *учетная запись* сохраняется на втором экране.
vi: Giá trị *account* tiếp tục hiển thị trên màn hình thứ hai.

source: Verify the **fee**. For CSPR token transfers, that value should be constant and equal to 10 000 motes = 0.00001 CSPR.
fr: Vérifiez le **frais**. Pour les transferts de jetons CSPR, cette valeur doit être constante et égale à 10 000 motes = 0,00001 CSPR.
ru: Проверьте **плату**. Для передачи токенов CSPR это значение должно быть постоянным и равным 10 000 motes = 0,00001 CSPR.
vi: Xác thực **fee**. Đối với chuyển token CSPR, giá trị đó phải không đổi và bằng 10 000 motes = 0,00001 CSPR.

source: Verify **target** - **NOTE** this **IS NOT** a public key of the recipient but the hash of that key. Compare the public key with the value in the Web wallet which shows you two fields for the recipient public key and target.".
fr: Vérifiez la **cible** - **NOTE** ce n'est **PAS** une clé publique du destinataire mais le hash de cette clé. Comparez la clé publique avec la valeur dans le portefeuille Web qui vous montre deux champs pour la clé publique du destinataire et la cible.".
ru: Проверьте **цель** - **ПРИМЕЧАНИЕ** это **НЕ** открытый ключ получателя, а хеш этого ключа. Сравните открытый ключ со значением в веб-кошельке, которое показывает вам два поля для открытого ключа получателя и цели"..
vi: Xác thực **target** - **LƯU Ý** đây **KHÔNG PHẢI** là khóa công khai của người nhận mà là mã băm của khóa đó. So sánh khóa công khai với giá trị trong ví Web hiển thị cho bạn hai trường dành cho khóa công khai và đích của người nhận.".

source: The *target* value continues on a second screen.
fr: La valeur *cible* continue sur un deuxième écran.
ru: Значение *target* сохраняется на втором экране.
vi: Giá trị *target* tiếp tục trên màn hình thứ hai.

source: Verify the **amount** you want to transfer.
fr: Vérifiez le **montant** que vous voulez transférer.
ru: Подтвердите **сумму**, которую вы хотите перевести.
vi: Xác thực **amount** mà bạn muốn chuyển.

source: If you approve the transaction, click both buttons on the Ledger device.
fr: Si vous approuvez la transaction, cliquez sur les deux boutons de l'appareil Ledger.
ru: Если вы утвердили транзакцию, нажмите обе кнопки на устройстве Ledger.
vi: Nếu bạn chấp thuận giao dịch, hãy nhấp vào cả hai nút trên thiết bị Ledger.

source: After approving the transaction with your Ledger hardware wallet, the `cspr.live <https://cspr.live>`_ Web wallet will display a "Transfer completed" page.
fr: Après avoir approuvé la transaction avec votre porte-monnaie matériel Ledger, le porte-monnaie Web `cspr.live <https://cspr.live>`_ affichera une page "Transfert terminé".
ru: После утверждения транзакции с помощью аппаратного кошелька Ledger, 'cspr.live <https://cspr.live>`_ Веб-кошелек отобразит страницу "Перевод завершен".
vi: Sau khi chấp thuận giao dịch bằng ví cứng Ledger của bạn, ví Web `cspr.live <https://cspr.live>`_ sẽ hiển thị trang "Đã hoàn thành chuyển".

source: Image showing the transfer completed.
fr: Image montrant le transfert terminé.
ru: Изображение, показывающее, что передача завершена.
vi: Hình ảnh hiển thị quá trình chuyển đã hoàn thành.

source: You can now check your account to see a list of all the completed transfers.
fr: Vous pouvez maintenant consulter votre compte pour voir la liste de tous les transferts terminés.
ru: Теперь вы можете проверить свой аккаунт, чтобы увидеть список всех завершенных переводов.
vi: Bây giờ bạn có thể kiểm tra tài khoản của mình để xem danh sách tất cả các lần chuyển tiền đã hoàn thành.
