Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/querying.po
Languages: ru

source: Querying the Network
ru: Запрос сети

source: The Casper node supports queries for users and developers to obtain information stored on the blockchain.
ru: Нода Casper поддерживает запросы пользователей и разработчиков для получения информации, хранящейся в блокчейн.

source: This document assumes:
ru: Этот документ предполагает:

source: You have met the `prerequisites <setup.html>`_
ru: Вы соответствуете 'предварительным условиям <setup.html>`_

source: You are familiar with the structure of the `Global State and the Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/index.html>`_ to query data from the network
ru: Вы знакомы со структурой 'Глобального состояния и дизайном блокчейна <https://docs.casperlabs.io/en/latest/implementation/index.html>`_ для запроса данных из сети

source: When sending a query, it is important to note that the request will be routed to a single node in the network. You can request several types of data from a node:
ru: При отправке запроса важно отметить, что запрос будет направлен на одну ноду в сети. Вы можете запросить несколько типов данных с ноды:

source: Account details
ru: Реквизиты учетной записи

source: Block information
ru: Информация о блоке

source: Deploy information
ru: Информация о развертывании

source: Obtaining the Global State Root Hash
ru: Получение корневого хеша глобального состояния

source: Since the system state changes with each block created, obtaining the latest global state hash is essential before querying information from a node.
ru: Поскольку состояние системы меняется с каждым созданным блоком, получение последнего глобального хеша состояния имеет важное значение перед запросом информации с ноды.

source: All queries made to global state require the ``state-root-hash``, which you can obtain with this command:
ru: Для всех запросов к глобальному состоянию требуется "корневой хеш состояния", который вы можете получить с помощью этой команды:

source: **Request fields:**
ru: **Поля запросов:**

source: ``id`` - <STRING OR INTEGER> Optional JSON-RPC identifier applied to the request and returned in the response. If not provided, a random integer will be assigned
ru: ``id`` - <STRING OR INTEGER> Необязательный идентификатор JSON-RPC, применяемый к запросу и возвращаемый в ответе. Если не указано, будет присвоено случайное целое число

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт узла, на котором запущена служба HTTP [по умолчанию:http://localhost:7777]

source: **JSON-RPC Request**:
ru: запрос **JSON-RPC Request**:

source: **JSON-RPC Response**:
ru: ответ **JSON-RPC Response**:

source: Querying an Account
ru: Запрос аккаунта

source: `Accounts <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ are stored in the global state and can be queried using the ``query-state`` command:
ru: Аккаунты <https://docs.casperlabs.io/en/latest/implementation/accounts.html> хранятся в глобальном состоянии и могут быть запрошены с помощью команды ``query-state``:

source: ``state-root-hash`` - <HEX STRING> Hex-encoded hash of the state root
ru: "корневой хеш состояния" - <HEX STRING> 16-разрядный закодированный хеш корневого состояния

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted public key, account hash, contract address hash, URef, transfer hash or deploy-info hash.
ru: "ключ" - <FORMATTED STRING or PATH> основной ключ для запроса. Это должен быть правильно сформатированный публичный ключ, хеш аккаунта, хеш адреса контракта, URef, хеш трансфера и хеш информации о развертывании.

source: **Important response fields:**
ru: **Важные области реагирования:**

source: ``"result"."stored_value"."Account"."main_purse"`` - the address of the main purse containing the sender’s tokens. This purse is the source of the tokens transferred in this example
ru: ``"result"."stored_value"."Account"."main_purse"`` - адрес основного кошелька, содержащего токены отправителя. Этот кошелек является источником токенов, передаваемых в этом примере

source: You can use the URef of the ``main_purse`` to query the account balance. The balance returned is in motes (the unit that makes up the Casper token).
ru: Вы можете использовать URef "основного кошелька" для запроса баланса аккаунта. Баланс, возвращенный в motes (единица, из которой состоит токен Casper).

source: ``purse-uref`` - <FORMATTED STRING> The URef under which the purse is stored. This must be a properly formatted URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>"
ru: ``purse-uref`` - <FORMATTED STRING> URef под которой хранится кошелек. Это должна быть правильно форматированная URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>"

source: Querying Blocks
ru: Запрос блоков

source: It is possible to obtain detailed block information from the system. To do this, obtain the hash of the block of interest and send this query to a node in the network. Here is an example:
ru: Из системы можно получить подробную информацию о блоке. Для этого получите хэш интересующего блока и отправьте этот запрос на ноду в сети. Вот пример:

source: ``node-address`` <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт узла, на котором запущена служба HTTP [по умолчанию:http://localhost:7777]

source: ``block-identifier`` - <HEX STRING OR INTEGER> Hex-encoded block hash or height of the block. If not given, the last block added to the chain as known at the given node will be used
ru: ``block-identifier`` - <HEX STRING OR INTEGER> 16-разрадный закодированный хеш высоты блока. Если не задан, последний блок добавленный в цепочку, как известно данной ноде, которая будет использоваться.

source: ``"result"."block"."header"."state_root_hash"`` - contains the ``state-root-hash`` for this block
ru: ``"result"."block"."header"."state_root_hash"`` - содержит корневой хеш состояния ``state-root-hash`` для этого блока

source: Querying Deploys
ru: Запрос развертываний

source: Once you submit a deploy to the network, you can check its execution status using ``get-deploy``. If the ``execution_results`` in the output are null, the transaction has not run yet. Note that transactions are finalized upon execution.
ru: Как только вы отправите развертывание в сеть, вы можете проверить состояние его выполнения с помощью ``get-deploy". Если "execution_results" в выходных данных равно нулю, транзакция еще не запущена. Обратите внимание, что транзакции завершаются после выполнения.

source: ``id`` - <STRING OR INTEGER> JSON-RPC identifier, applied to the request and returned in the response. If not provided, a random integer will be assigned
ru: ``id`` - <STRING OR INTEGER> Необязательный идентификатор JSON-RPC, применяемый к запросу и возвращаемый в ответе. Если не указано, будет присвоено случайное целое число

source: ``node-address`` - <HOST:PORT>Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт узла, на котором запущена служба HTTP [по умолчанию:http://localhost:7777]

source: ``deploy-hash`` - <HEX STRING OR INTEGER> Hex-encoded hash of the deploy
ru: ``deploy-hash`` - <HEX STRING OR INTEGER> 16-разрядный закодированный хеш состояния
