Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/setup.po
Languages: ru

source: Prerequisites
ru: Пререквизиты

source: This section explains how to fulfill the prerequisites needed to interact with a Casper Network.
ru: Этот раздел объясняет, как заполнить все пререквизиты, необходимые для взаимодействия в сетью Casper.

source: This section covers:
ru: Раздел описывает:

source: Installing the official Casper command-line client
ru: Установку официального клиента командной строки Casper

source: Setting up an account on a Casper Network
ru: Настройка аккаунта в сети Casper

source: Acquiring the IP address of a peer on the official Testnet or Mainnet
ru: Получение IP-адреса в пире официальной тестовой сети или майннет

source: The Casper command-line client
ru: Клиент командной строки Casper

source: You can find the client on `crates.io <https://crates.io/crates/casper-client>`_.
ru: Вы можете найти клиент тут `crates.io <https://crates.io/crates/casper-client>`_.

source: Run the commands below to install the Casper client on most flavors of Linux and macOS. You will need the nightly version of the compiler.
ru: Запустите команды ниже для установки клиента на большинстве Linux и macOS. Вам потребуется ночная версия компилятора.

source: Doing this, you'll see a warning, which you can ignore for now.
ru: Вы увидите предупреждение которое вы можете сейчас проигнорировать.

source: The Casper client can print out `help` information, which provides an up-to-date list of supported commands.
ru: Клиент Casper может распечатать вспомогательную информацию `help`, которая дает список самых последних поддерживаемых команд.

source: **Important**: For each command, you can use `help` to get the up-to-date arguments and descriptions:
ru: Для каждой команды вы можете использовать `help` для получения свежих параметров и описаний:

source: Setting up an Account
ru: Настройка аккаунта

source: The process of creating an `Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ can be divided into two steps:
ru: Процесс создания аккаунта Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ может быть разделен на два шага:

source: Cryptographic key generation for the account
ru: Генерация криптографического ключа для учетной записи

source: Funding the account
ru: Пополнение счета

source: The Casper blockchain uses an on-chain account-based model, uniquely identified by an ``AccountHash`` derived from a specific ``PublicKey``.
ru: Блокчейн Casper использует модель на основе учетной записи в цепочке, однозначно идентифицируемую хешем аккаунта ``AccountHash``, полученным из определенного "публичного ключа".

source: By default, a transactional interaction with the blockchain takes the form of a ``Deploy`` cryptographically signed by the key-pair corresponding to the ``PublicKey`` used to create the account.
ru: По умолчанию транзакционное взаимодействие с блокчейном принимает форму "Развертывания", криптографически подписанного парой ключей, соответствующей "публичному ключу", используемому для создания учетной записи.

source: Accounts can be created using the Casper command-line client. Alternatively, some Casper networks such as the official Testnet and Mainnet provide a browser-based block explorer that allows account creation.
ru: Учетные записи могут быть созданы с помощью клиента командной строки Casper. В качестве альтернативы, некоторые сети Casper, такие как официальная тестовая сеть и Mainnet, предоставляют обозреватель блоков на основе браузера, который позволяет создавать учетные записи.

source: A cryptographic key-pair will be created when using either the Casper command-line client or a block explorer to create an account on the blockchain. This process generates three files for each account:
ru: Пара криптографических ключей будет создана при использовании клиента командной строки Casper или проводника блоков для создания учетной записи в блокчейне. Этот процесс создает три файла для каждой учетной записи:

source: A PEM encoded secret key
ru: Секретный ключ в кодировке PEM

source: A PEM encoded public key
ru: Открытый ключ в кодировке PEM

source: A hexadecimal-encoded string representation of the public key
ru: Шестнадцатеричное строковое представление открытого ключа в кодировке

source: We recommend saving these files securely.
ru: Мы рекомендуем надежно сохранить эти файлы.

source: The command-line client provides a command that will give you the account hash for a given public key.
ru: Клиент командной строки предоставляет команду, которая предоставит вам хэш учетной записи для данного открытого ключа.

source: Option 1: Key generation using the Casper client
ru: Вариант 1: Генерация ключей с помощью клиента Casper

source: This option describes how you can use the Casper command-line client to set up your accounts.
ru: Этот параметр описывает, как вы можете использовать клиент командной строки Casper для настройки своих учетных записей.

source: Execute the following command to generate your keys:
ru: Выполните следующую команду, чтобы сгенерировать ваши ключи:

source: The above command will create three files in the current working directory:
ru: Приведенная выше команда создаст три файла в текущем рабочем каталоге:

source: ``secret_key.pem`` - PEM encoded secret key
ru: "secret_key.pem" - секретный ключ в кодировке PEM

source: ``public_key.pem`` - PEM encoded public key
ru: "public_key.pem" - открытый ключ в кодировке PEM

source: ``public_key_hex`` - Hexadecimal-encoded string of the public key
ru: "public_key_hex" - строка открытого ключа в шестнадцатеричной кодировке

source: **Note**: SAVE your keys to a safe place, preferably offline.
ru: **Примечание**: СОХРАНИТЕ ключи в безопасном месте, желательно в автономном режиме.

source: Once the keys for the account have been generated, the accounts can be funded to finish the process of creating an account.
ru: Как только ключи для учетной записи будут сгенерированы, счета можно будет пополнить, чтобы завершить процесс создания аккаунта.

source: **Note**: Responses from the node contain ``AccountHashes`` instead of the direct hexadecimal-encoded public key. For traceability, it is important to generate the account hash and store this value locally. The account hash is a ``Blake2B`` hash of the public hexadecimal-encoded string.
ru: **Примечание**: Ответы от узла содержат хеши аккаунтов ``AccountHashes`` вместо прямого открытого ключа в шестнадцатеричной кодировке. Для отслеживания важно сгенерировать хеш учетной записи и сохранить это значение локально. Хеш учетной записи представляет собой хеш " Blake2B" общедоступной строки в шестнадцатеричной кодировке.

source: Option 2: Key generation using a Block Explorer
ru: Вариант 2: Генерация ключей с помощью проводника блоков

source: This option is also available on networks that have a block explorer.
ru: Эта опция также доступна в сетях, в которых есть обозреватель блоков.

source: For instance, on the official Testnet network the `CSPR.live <https://testnet.cspr.live/>`_ block explorer is available, and the following instructions assume you are using it.
ru: Например, в официальной сети Testnet 'CSPR.live <https://testnet.cspr.live/>`_ доступен обозреватель блоков, и в следующих инструкциях предполагается, что вы его используете.

source: Start by creating an account using the `Create Account <https://testnet.cspr.live/create-account>`_ link. You will need to download the keys of your new account by clicking on the ``Download Keys`` button. Note that the account is not stored on chain.
ru: Начните с создания учетной записи с помощью ссылки 'Создать учетную запись <https://testnet.cspr.live/create-account>`_ . Вам нужно будет загрузить ключи от вашей новой учетной записи, нажав на кнопку "Загрузить ключи". Обратите внимание, что аккаунт не хранится в цепочке.

source: You will be prompted to save the following three files for your new account. These are your keys, so we recommend securely storing them:
ru: Вам будет предложено сохранить следующие три файла для вашей новой учетной записи. Это ваши ключи, поэтому мы рекомендуем надежно хранить их:

source: Fund your Account
ru: Пополнение аккаунта

source: Once the cryptographic key-pair for the account has been generated, the account must be funded so it can be created on chain.
ru: Как только пара криптографических ключей для учетной записи будет сгенерирована, учетная запись должна быть пополнена, чтобы ее можно было создать в цепочке.

source: In Testnet, you can fund the account by using the *Request tokens* button on the `Faucet Page <https://testnet.cspr.live/tools/faucet>`_ to receive tokens.
ru: В Testnet вы можете пополнить счет с помощью кнопки *Запросить токены* на странице 'Кран <https://testnet.cspr.live/tools/faucet>`_ для получения токенов.

source: In Mainnet, a pre-existing account will have to transfer CSPR tokens to finalize the process of setting up an account. The *Source* account needs to transfer CSPR tokens to the hexadecimal-encoded public key of the *Target* account. This transfer will automatically create the *Target* account if it does not exist. Currently, this is the only way an account can be created on Mainnet.
ru: В Mainnet уже существующая учетная запись должна будет передать токены CSPR, чтобы завершить процесс создания учетной записи. Аккаунту *Source* необходимо перенести токены CSPR в открытый ключ с шестнадцатеричной кодировкой аккаунта *Target*. Этот перевод автоматически создаст учетную запись *Target*, если она не существует. В настоящее время это единственный способ создать учетную запись в Mainnet.

source: Acquire Node Address from network peers
ru: Запрос адреса ноды из пиров сети

source: Clients can interact with a node on the blockchain via requests sent to that node's JSON-RPC endpoint, ``http://<node-ip-address>:7777`` by default.
ru: Клиенты могут взаимодействовать с нодой в блокчейне посредством запросов, отправляемых на конечную точку JSON-RPC этой ноды "http://<node-ip-address>:7777" по умолчанию.

source: The node address is the IP of a peer node.
ru: Адрес ноды - это IP-адрес одноранговой ноды.

source: Both the official testnet and Mainnet provide block explorers that provide a list of IP addresses of nodes on their respective networks.
ru: Как официальная тестовая сеть, так и Mainnet предоставляют блочные обозреватели, которые предоставляют список IP-адресов нод в своих соответствующих сетях.

source: You can get the ``node-ip-address`` of a node on the network by visiting the following block explorers:
ru: Вы можете получить "ip-адрес узла" ноды в сети, посетив следующие блочные обозреватели:

source: `Peers <https://testnet.cspr.live/tools/peers>`_ on Testnet
ru: `Peers <https://testnet.cspr.live/tools/peers>`_ на Testnet

source: `Peers <https://cspr.live/tools/peers>`_ on Mainnet
ru: `Peers <https://cspr.live/tools/peers>`_ на Mainnet

source: You will see a list of peers, and you can select the IP of any peer on the list.
ru: Вы увидите список одноранговых узлов, и вы можете выбрать IP-адрес любого однорангового узла в списке.

source: **Note**: If the selected peer is unresponsive, pick a different peer and try again.
ru: **Примечание**: Если выбранный одноранговый узел не отвечает, выберите другой одноранговый узел и повторите попытку.
