Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/staking.po
Languages: fr, ru, vi

source: Give your account a name. In this tutorial, we will use the name *My-CSPR*.
fr: Donnez un nom à votre compte. Dans ce tutoriel, nous utiliserons le nom *My-CSPR*.
ru: Укажите имя своей учетной записи. В этом уроке мы будем использовать имя *My-CSPR*.
vi: Đặt tên cho tài khoản của bạn. Trong hướng dẫn này, chúng tôi sẽ sử dụng tên *My-CSPR*.

source: Select an Algorithm using the dropdown menu. Select *SECP256K1* unless you have a good reason not to do so.
fr: Sélectionnez un Algorithme en utilisant le menu déroulant. Sélectionnez *SECP256K1*, sauf si vous avez une bonne raison de ne pas le faire.
ru: Выберите алгоритм с помощью выпадающего меню. Выберите *SECP256K1*, если у вас нет веской причины не делать этого.
vi: Chọn một Thuật toán bằng cách sử dụng menu thả xuống. Chọn *SECP256K1* trừ khi bạn có lý do chính đáng để không làm như vậy.

source: Click **Create** to save your account.
fr: Cliquez sur **Create** pour enregistrer votre compte.
ru: Нажмите **Создать**, чтобы сохранить свою учетную запись.
vi: Nhấp vào **Tạo mới** để lưu tài khoản của bạn.

source: **IMPORTANT: Download the key files for this account!** Click the hamburger icon and select the **Download Active Key** option.
fr: **IMPORTANT : Téléchargez les fichiers de clé pour ce compte** Cliquez sur l'icône hamburger et sélectionnez l'option **Download Active Key**.
ru: **ВАЖНО: Загрузите файлы ключей для этой учетной записи!** Щелкните значок гамбургера и выберите опцию **Загрузить активный ключ**.
vi: ** QUAN TRỌNG: Tải xuống các tệp khóa cho tài khoản này!** Nhấp vào biểu tượng menu và chọn tùy chọn **Tải xuống Khóa hiện hoạt**.

source: Check that your browser downloaded the following three files:
fr: Vérifiez que votre navigateur a téléchargé les trois fichiers suivants :
ru: Убедитесь, что ваш браузер загрузил следующие три файла:
vi: Kiểm tra để đảm bảo rằng trình duyệt của bạn đã tải xuống ba tệp sau:

source: Your secret key: **...\_secret\_key.pem**
fr: Votre clé secrète : **...\_secret\_key.pem**
ru: Ваш секретный ключ: **...\_secret\_key.pem**
vi: Khoá bí mật của bạn: **...\_secret\_key.pem**

source: Your public key: **...\_public\_key.pem**
fr: Votre clé publique : **...\_public\_key.pem**
ru: Ваш открытый ключ: **...\_public\_key.pem**
vi: Khoá công khai của bạn: **...\_public\_key.pem**

source: A text file: **...\_public\_key\_hex.txt**
fr: Un fichier texte : **...\_public\_key\_hex.txt**
ru: Текстовый файл: **...\_public\_key\_hex.txt**
vi: Một tệp văn bản: **...\_public\_key\_hex.txt**

source: If you do not have these three files, you need to enable multiple downloads in your browser. It is crucial to proceed to the next step only if you have all of these files. This screenshot shows the files downloaded for an account called *My-CSPR*:
fr: Si vous ne disposez pas de ces trois fichiers, vous devez activer les téléchargements multiples dans votre navigateur. Il est essentiel de passer à l'étape suivante uniquement si vous disposez de tous ces fichiers. Cette capture d'écran montre les fichiers téléchargés pour un compte appelé *My-CSPR* :
ru: Если у вас нет этих трех файлов, вам необходимо включить несколько загрузок в вашем браузере. Крайне важно переходить к следующему шагу только в том случае, если у вас есть все эти файлы. На этом снимке экрана показаны файлы, загруженные для учетной записи с именем *My-CSPR*:
vi: Nếu bạn không có ba tệp này, bạn cần bật tính năng tải xuống nhiều tệp trong trình duyệt của mình. Điều quan trọng là chỉ tiến hành bước tiếp theo nếu bạn có tất cả các tệp này. Ảnh chụp màn hình này hiển thị các tệp được tải xuống cho tài khoản có tên *My-CSPR*:

source: **IMPORTANT: Move these files to a secure OFFLINE location!** Do not store them on any device with a wifi connection. We recommend an offline USB or hard drive. Consider backing up these files in multiple locations in case one location becomes compromised.
fr: **IMPORTANT : Déplacez ces fichiers vers un emplacement hors ligne sécurisé!** Ne les stockez pas sur un appareil avec une connexion wifi. Nous vous recommandons une clé USB ou un disque dur hors ligne. Envisagez de sauvegarder ces fichiers à plusieurs endroits au cas où un emplacement serait compromis.
ru: **ВАЖНО: Переместите эти файлы в безопасное автономное место!** Не храните их ни на одном устройстве с подключением Wi-Fi. Мы рекомендуем использовать автономный USB-накопитель или жесткий диск. Рассмотрите возможность резервного копирования этих файлов в нескольких местах на случай, если одно из них окажется скомпрометированным.
vi: **QUAN TRỌNG: Di chuyển các tệp này đến vị trí NGOẠI TUYẾN an toàn!** Không lưu trữ chúng trên bất kỳ thiết bị nào có kết nối Wi-Fi. Chúng tôi khuyên bạn nên sử dụng USB hoặc ổ cứng ngoại tuyến. Cân nhắc sao lưu các tệp này ở nhiều vị trí trong trường hợp một vị trí bị xâm phạm.

source: If you lose the vault password you created, but still have the *secret_key.pem* file, you can import your account into a new vault, as shown in the next section.
fr: Si vous perdez le mot de passe du coffre-fort que vous avez créée, mais que vous avez toujours le fichier *secret_key.pem*, vous pouvez importer votre compte dans un nouveau coffre-fort, comme indiqué dans la section suivante.
ru: Если вы потеряли созданный вами пароль хранилища, но у вас все еще есть файл *secret_key.pem*, вы можете импортировать свою учетную запись в новое хранилище, как показано в следующем разделе.
vi: Nếu bạn mất mật khẩu ngăn tiền mà bạn đã tạo, nhưng vẫn có tệp *secret_key.pem*, bạn có thể nhập tài khoản của mình vào một ngăn tiền mới, như được hiển thị trong phần tiếp theo.

source: **IMPORTANT: If you lose the secret_key.pem file and your vault password, you will lose access to that account and to the tokens stored in the account.**
fr: **IMPORTANT : Si vous perdez le fichier secret_key.pem et votre mot de passe de coffre-fort, vous perdrez l'accès à ce compte et aux jetons qui y sont stockés.
ru: **ВАЖНО: Если вы потеряете файл secret_key.pem и пароль хранилища, вы потеряете доступ к этой учетной записи и к токенам, хранящимся в учетной записи.**
vi: **QUAN TRỌNG: Nếu bạn mất tệp secret_key.pem và mật khẩu ngăn tiền của mình, bạn sẽ mất quyền truy cập vào tài khoản đó và các token được lưu trữ trong tài khoản.**

source: 3.3 Importing an Existing Account
fr: 3.3 Importation d'un compte existant
ru: 3.3 Импорт Существующей учетной записи
vi: 3.3 Kết nhập tài khoản hiện có

source: If you already have your secret keys and would like to set up and use your wallet with your existing accounts, you can do so with the following steps. These steps also apply for users migrating from the outdated Clarity tool to `cspr.live <https://cspr.live/>`_.
fr: Si vous disposez déjà de vos clés secrètes et que vous souhaitez configurer et utiliser votre porte-monnaie avec vos comptes existants, vous pouvez le faire en suivant les étapes suivantes. Ces étapes s'appliquent également aux utilisateurs migrant de l'outil Clarity obsolète vers `cspr.live <https://cspr.live/>`_.
ru: Если у вас уже есть секретные ключи и вы хотите настроить и использовать свой кошелек с существующими учетными записями, вы можете сделать это, выполнив следующие действия. Эти шаги также применимы для пользователей, переходящих с устаревшего инструмента Clarity на 'cspr.live <https://cspr.live/>`_.
vi: Nếu bạn đã có khóa bí mật và muốn thiết lập và sử dụng ví với các tài khoản hiện có của mình, bạn có thể thực hiện theo các bước sau. Các bước này cũng áp dụng cho người dùng di chuyển từ công cụ cũ Clarity sang `cspr.live <https://cspr.live/>`_.

source: Import your existing account by clicking the **IMPORT ACCOUNT** button.
fr: Importez votre compte existant en cliquant sur le bouton **IIMPORT ACCOUNT**.
ru: Импортируйте существующую учетную запись, нажав кнопку **ИМПОРТИРОВАТЬ УЧЕТНУЮ ЗАПИСЬ**.
vi: Kết nhập tài khoản hiện có của bạn bằng cách nhấp vào nút **IMPORT ACCOUNT**.

source: Then, click on the **UPLOAD** button and select your secret key file (the file with the secret_key.pem extension).
fr: Ensuite, cliquez sur le bouton **UPLOAD** et sélectionnez votre fichier de clé secrète (le fichier avec l'extension secret_key.pem).
ru: Затем нажмите кнопку **ЗАГРУЗИТЬ** и выберите файл секретного ключа (файл с расширением secret_key.pem).
vi: Sau đó, nhấp vào nút **UPLOAD** và chọn tệp khóa bí mật của bạn (tệp có phần mở rộng secret_key.pem).

source: Give your account a name and click on the **IMPORT** button to complete the import operation.
fr: Donnez un nom à votre compte et cliquez sur le bouton **IMPORTER** pour terminer l'opération d'importation.
ru: Введите имя своей учетной записи и нажмите кнопку **ИМПОРТ**, чтобы завершить операцию импорта.
vi: Đặt tên cho tài khoản của bạn và nhấp vào nút **IMPORT** để hoàn tất thao tác nhập.

source: Repeat these steps for all the accounts you would like to import into your wallet.
fr: Répétez ces étapes pour tous les comptes que vous souhaitez importer dans votre portefeuille.
ru: Повторите эти действия для всех учетных записей, которые вы хотели бы импортировать в свой кошелек.
vi: Lặp lại các bước này cho tất cả các tài khoản bạn muốn nhập vào ví của mình.

source: Now that you have your CasperLabs Signer wallet, you can continue to connect to the mainnet blockchain.
fr: Maintenant que vous avez votre porte-monnaie CasperLabs Signer, vous pouvez continuer à vous connecter à la blockchain du réseau principal (mainnet).
ru: Теперь, когда у вас есть кошелек CasperLabs Signer, вы можете продолжать подключаться к блокчейну mainnet.
vi: Bây giờ bạn đã có ví CasperLabs Signer của mình, bạn có thể tiếp tục kết nối với chuỗi khối mainnet.

source: 4. Connecting to cspr.live
fr: 4. Connexion à cspr.live
ru: 4. Подключение к cspr.live
vi: 4. Kết nối với cspr.live

source: Using the active account in the Signer tool, connect to the Casper blockchain by clicking on the **DISCONNECTED** button to toggle the connection.
fr: En utilisant le compte actif dans l'outil Signer, connectez-vous à la blockchain Casper en cliquant sur le bouton **DISCONNECTED** pour basculer la connexion.
ru: Используя активную учетную запись в инструменте Signer, подключитесь к блокчейну Casper, нажав кнопку **ОТКЛЮЧЕНО**, чтобы переключить соединение.
vi: Sử dụng tài khoản đang hoạt động trong công cụ Signer, kết nối với chuỗi khối Casper bằng cách nhấp vào nút **DISCONNECTED** để chuyển đổi kết nối.

source: Approve the connection by clicking the **CONNECT** button.
fr: Approuvez la connexion en cliquant sur le bouton **CONNECT**.
ru: Подтвердите подключение, нажав кнопку **ПОДКЛЮЧИТЬСЯ**.
vi: Phê duyệt kết nối bằng cách nhấp vào nút **CONNECT**.

source: You are now in the block explorer and connected to the Casper blockchain using your active account!
fr: Vous êtes maintenant dans l'explorateur de blocs et connecté à la blockchain Casper en utilisant votre compte actif !
ru: Теперь вы находитесь в проводнике блоков и подключены к блокчейну Casper, используя свою активную учетную запись!
vi: Bạn hiện đang ở trong trình khám phá khối và được kết nối với chuỗi khối Casper bằng tài khoản đang hoạt động của mình!

source: Next, click on **View Account** in the top right corner.
fr: Ensuite, cliquez sur **Voir Compte** dans le coin supérieur droit.
ru: Затем нажмите **Просмотреть учетную запись** в правом верхнем углу.
vi: Tiếp theo, nhấp vào **Xem tài khoản** ở góc trên cùng bên phải.

source: You will see the following fields:
fr: Vous verrez les champs suivants :
ru: Вы увидите следующие поля:
vi: Bạn sẽ thấy các trường sau:

source: The **Public Key** is the address of your Casper Mainnet account.
fr: La **Clé publique** (Public Key) est l'adresse de votre compte Casper Mainnet.
ru: **Открытый ключ** - это адрес вашей учетной записи Casper в сети.
vi: **Khóa công khai** là địa chỉ của tài khoản Casper Mainnet của bạn.

source: The **Account Hash** is a 32-byte identifier derived from the public key. The platform uses it to verify transactions.
fr: Le **Hash du compte** est un identifiant de 32 octets dérivé de la clé publique. La plateforme l'utilise pour vérifier les transactions.
ru: **Хеш аккаунта** - это 32-байтовый идентификатор, полученный из открытого ключа. Платформа использует его для проверки транзакций.
vi: **Băm tài khoản** là một mã định danh 32 byte bắt nguồn từ khóa công khai. Nền tảng sử dụng nó để xác minh các giao dịch.

source: The **Liquid Account Balance** represents the tokens you have for immediate use.
fr: Le **Solde du compte liquide** représente les jetons dont vous disposez pour une utilisation immédiate.
ru: **Ликвидный баланс счета** представляет собой токены, которые у вас есть для немедленного использования.
vi: **Số dư tài khoản thanh khoản** đại diện cho các token bạn có để sử dụng ngay lập tức.

source: The **Delegated Account Balance** represents your delegated tokens staked with validators on the network.
fr: Le **Solde du compte délégué** représente vos jetons délégués, mis en gage auprès de validateurs sur le réseau.
ru: **Делегированный баланс аккаунта** представляет ваши делегированные токены, размещенные с помощью валидаторов в сети.
vi: **Số dư tài khoản được ủy quyền** đại diện cho các token được ủy quyền của bạn được gắn với trình xác thực trên mạng.

source: You will also see **Total Rewards Received** on the account page.
fr: Vous verrez également **Total des récompenses reçues** sur la page du compte.
ru: Вы также увидите **Общее количество полученных вознаграждений** на странице учетной записи.
vi: Bạn cũng sẽ thấy **Tổng phần thưởng đã nhận** trên trang tài khoản.

source: If you wish, you can also explore the *Transfers*, *Deploys*, *Delegations*, and *Staking Rewards* tabs.
fr: Si vous le souhaitez, vous pouvez également explorer les onglets *Transferts*, *Déploiements*, *Délégations*, et *Récompenses du Staking*.
ru: При желании вы также можете изучить вкладки *Переводы*, *Развертывание*, *Делегирование* и *Распределение вознаграждений*.
vi: Nếu muốn, bạn cũng có thể khám phá các thẻ *Chuyển khoản*, *Triển khai*, *Ủy quyền* và *Phần thưởng đặt cọc*.

source: In this tutorial, we are interested in the *Delegations* tab, where you can see a list of validators to which you have delegated tokens and the amount you have delegated.
fr: Dans ce tutoriel, nous nous intéressons à l'onglet *Délégations*, où vous pouvez voir une liste des validateurs auxquels vous avez délégué des jetons et le montant que vous avez délégué.
ru: В этом руководстве нас интересует вкладка *Делегирование*, где вы можете увидеть список валидаторов, которым вы делегировали токены, и сумму, которую вы делегировали.
vi: Trong hướng dẫn này, chúng tôi quan tâm đến thẻ *Ủy quyền*, nơi bạn có thể xem danh sách các trình xác thực mà bạn đã ủy quyền token và tổng số bạn đã ủy quyền.

source: You will see details about your rewards in the *Staking Rewards* tab, such as the validator you have staked with and the amount you have received for each era.
fr: Vous verrez les détails de vos récompenses dans l'onglet *Récompenses duStaking*, comme le validateur sur lequel vous avez staké et le montant que vous avez reçu pour chaque ère.
ru: Вы увидите подробную информацию о своих наградах на вкладке *Награды за ставки*, например, о валидаторе, с которым вы делали ставки, и сумме, которую вы получили за каждую эру.
vi: Bạn sẽ thấy thông tin chi tiết về phần thưởng của mình trong thẻ *Phần thưởng từ đặt cọc*, chẳng hạn như trình xác thực mà bạn đã đặt cọc và tổng số bạn nhận được cho mỗi kỷ nguyên.

source: **Delegation Fees**
fr: **Frais de délégation**
ru: **Курс делегирования**
vi: **Phí ủy quyền**

source: It is important to know that the cost of the delegation process is approximately 3 CSPR. Ensure you have extra CSPR on your account apart from the amount you are delegating; otherwise, the transaction will fail. For example, if you want to delegate 1000 CSPR, you need to have at least 1003 CSPR in your account.
fr: Il est important de savoir que le coût du processus de délégation est d'environ 3 CSPR. Assurez-vous d'avoir des CSPR supplémentaires sur votre compte en dehors du montant que vous déléguez ; sinon, la transaction échouera. Par exemple, si vous voulez déléguer 1000 CSPR, vous devez avoir au moins 1003 CSPR sur votre compte.
ru: Важно знать, что стоимость процесса делегирования составляет примерно 3 CSPR. Убедитесь, что у вас есть дополнительный CSPR на вашем счете, помимо суммы, которую вы делегируете; в противном случае транзакция завершится неудачей. Например, если вы хотите делегировать 1000 CSPR, в вашей учетной записи должно быть не менее 1003 CSPR.
vi: Điều quan trọng cần biết là chi phí của quá trình ủy quyền là khoảng 3 CSPR. Đảm bảo rằng bạn có thêm CSPR trong tài khoản của mình ngoài số tiền bạn đang ủy quyền; nếu không, giao dịch sẽ thất bại. Ví dụ: nếu bạn muốn ủy quyền 1000 CSPR, bạn cần có ít nhất 1003 CSPR trong tài khoản của mình.

source: 5. Funding your Account
fr: 5. Approvisionner votre compte
ru: 5. Пополнение счета аккаунта
vi: 5. Nạp tiền vào tài khoản của bạn

source: **IMPORTANT NOTE:** If you want to send your CSPR coins from an exchange to this account, you need to copy the **Public Key** value. Use the quick copy button to the right of the public key address to copy it. Then set up a withdrawal request from the exchange using the public key.
fr: **NOTE IMPORTANTE:** Si vous voulez envoyer vos jetons CSPR d'un marché échange (exchange) vers ce compte, vous devez copier la valeur de la **Clé publique**. Utilisez le bouton de copie rapide à droite de l'adresse de la clé publique pour la copier. Ensuite, configurez une demande de retrait depuis le marché d'échange en utilisant la clé publique.
ru: **ВАЖНОЕ ПРИМЕЧАНИЕ:** Если вы хотите отправить свои монеты CSPR с биржи на эту учетную запись, вам необходимо скопировать значение **Открытого ключа**. Используйте кнопку быстрого копирования справа от адреса открытого ключа, чтобы скопировать его. Затем настройте запрос на вывод средств с биржи с помощью открытого ключа.
vi: **LƯU Ý QUAN TRỌNG:** Nếu bạn muốn gửi CSPR của mình từ một sàn giao dịch đến tài khoản này, bạn cần sao chép giá trị **Khóa công khai**. Sử dụng nút sao chép nhanh ở bên phải của địa chỉ khóa công khai để sao chép nó. Sau đó, thiết lập yêu cầu rút tiền từ sàn giao dịch bằng khóa công khai.

source: The transfer from an exchange takes a few minutes. After your tokens arrive in your account, you can delegate them. This section demonstrates a withdrawal from the Coinlist exchange http://coinlist.co/ to the `Casper Mainnet on cspr.live <https://cspr.live/>`_.
fr: Le transfert depuis un marché d'échange prend quelques minutes. Une fois que vos jetons sont arrivés sur votre compte, vous pouvez les déléguer. Cette section démontre un retrait depuis l'échange Coinlist http://coinlist.co/ vers le `Casper Mainnet sur cspr.live <https://cspr.live/>`_.
ru: Перевод с обменника занимает несколько минут. После того, как ваши токены поступят в вашу учетную запись, вы сможете делегировать их. В этом разделе демонстрируется вывод средств с биржи Coinlist http://coinlist.co/ в главную сеть Casper на 'cspr.live <https://cspr.live/>`_.
vi: Việc chuyển từ một sàn giao dịch mất vài phút. Sau khi mã thông báo đến tài khoản của bạn, bạn có thể ủy quyền chúng. Phần này minh họa việc rút tiền từ sàn giao dịch Coinlist http://coinlist.co/ sang `Casper Mainnet trên cspr.live <https://cspr.live/>`_.

source: 5.1 Transfer CSPR from an Exchange
fr: Transférer des CSPR depuis un Exchange
ru: 5.1 Перевод CSPR с Биржи
vi: 5.1 Chuyển CSPR từ sàn giao dịch

source: If you need to transfer your CSPR tokens from an exchange, you will need your **public key** from the account page. You can also find this key in the **public_key_hex** file, which you can download from the CasperLabs Signer.
fr: Si vous avez besoin de transférer vos jetons CSPR depuis un Exchange, vous aurez besoin de votre **clé publique** depuis la page du compte. Vous pouvez également trouver cette clé dans le fichier **public_key_hex**, que vous pouvez télécharger depuis le CasperLabs Signer.
ru: Если вам нужно перевести свои токены CSPR с биржи, вам понадобится ваш **открытый ключ** со страницы учетной записи. Вы также можете найти этот ключ в файле **public_key_hex**, который вы можете скачать из CasperLabs Signer.
vi: Nếu bạn cần chuyển token CSPR của mình từ một sàn giao dịch, bạn sẽ cần **khóa công khai** của mình từ trang tài khoản. Bạn cũng có thể tìm thấy khóa này trong tệp **public_key_hex** mà bạn có thể tải xuống từ CasperLabs Signer.

source: If you already have funds in your Signer wallet, you can skip this section. If you are working with a different exchange, you need to contact that exchange directly.
fr: Si vous avez déjà des fonds dans votre portefeuille Signer, vous pouvez sauter cette section. Si vous travaillez avec un autre Exchange, vous devez contacter cet Exchange directement.
ru: Если у вас уже есть средства в кошельке Signer, вы можете пропустить этот раздел. Если вы работаете с другой биржей, вам необходимо связаться с этой биржей напрямую.
vi: Nếu bạn đã có tiền trong ví Signer của mình, bạn có thể bỏ qua phần này. Nếu bạn đang làm việc với một sàn giao dịch khác, bạn cần liên hệ trực tiếp với sàn giao dịch đó.

source: Log into your https://coinlist.co/ account.
fr: Connectez-vous à votre compte https://coinlist.co/.
ru: Войдите в свой аккаунт https://coinlist.co/ .
vi: Đăng nhập vào tài khoản https://coinlist.co/ của bạn.

source: Go to the **Wallet** tab.
fr: Allez dans l'onglet **Wallet**.
ru: Перейдите на вкладку **Кошелек**.
vi: Chuyển đến thẻ **Wallet**.

source: Click on the **CSPR** section.
fr: Cliquez sur la section **CSPR**.
ru: Нажмите на раздел **CSPR**.
vi: Nhấp vào phần **CSPR**.

source: Click on the **Withdraw** button.
fr: Cliquez sur le bouton **Withdraw** (Retrait).
ru: Нажмите на кнопку **Вывести**.
vi: Nhấp vào nút **Withdraw**.

source: Copy the **Public Key**. The screenshot below shows the account page on https://cspr.live/ and the field that you need to copy from that page.
fr: Copiez la **Clé publique**. La capture d'écran ci-dessous montre la page du compte sur https://cspr.live/ et le champ que vous devez copier à partir de cette page.
ru: Скопируйте **Открытый ключ**. На скриншоте ниже показана страница учетной записи на https://cspr.live/ и поле, которое вам нужно скопировать с этой страницы.
vi: Sao chép **Khóa công khai**. Ảnh chụp màn hình bên dưới hiển thị trang tài khoản trên https://cspr.live/ và trường mà bạn cần sao chép từ trang đó.

source: Enter the **Public Key** in the **Recipient Address** field in the withdrawal request.
fr: Saisissez la **Clé publique** dans le champ **Adresse du destinataire** (Recipient Address) de la demande de retrait.
ru: Введите **Открытый ключ** в поле **Адрес получателя** в запросе на вывод средств
vi: Nhập **Khóa công khai** vào trường **Recipient Address** trong yêu cầu rút tiền.

source: Enter 0 in the **Transfer ID** field or another value that is meaningful to you. **You MUST enter a value or the transfer will fail!**
fr: Entrez 0 dans le champ **Transfer ID** ou une autre valeur significative pour vous. **Vous DEVEZ entrer une valeur ou le transfert échouera!**.
ru: Введите 0 в поле **Идентификатор перевода** или другое значимое для вас значение. **Вы ДОЛЖНЫ ввести значение, иначе перевод не удастся!**
vi: Nhập 0 vào trường **ID chuyển** hoặc một giá trị khác có ý nghĩa đối với bạn. **Bạn PHẢI nhập một giá trị nếu không quá trình chuyển sẽ không thành công!**
