Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/staking.po
Languages: fr, ru, vi

source: How to Stake your CSPR
fr: Comment staker vos jetons CSPR
ru: Как стейкать ваши CSPR
vi: Cách đặt cọc CSPR của bạn

source: 1. Introduction
fr: Introduction
ru: 1. Введение
vi: 1. Giới thiệu

source: Casper and other Proof-of-Stake protocols allow token holders to earn rewards and participate in the protocol through a mechanism called **staking**. This tutorial shows you how to stake your Casper tokens with a validator on the network. This process is also called **delegation**. We will use these terms interchangeably in this guide, but we will explain the technical difference for clarity.
fr: Casper et d'autres protocoles Proof-of-Stake permettent aux détenteurs de jetons de gagner des récompenses et de participer au protocole grâce à un mécanisme appelé **staking**. Ce tutoriel vous montre comment staker vos jetons Casper avec un validateur sur le réseau. Ce processus est également appelé **délégation**. Nous utiliserons ces termes de manière interchangeable dans ce guide, mais nous allons expliquer la différence technique pour plus de clarté.
ru: Casper и другие протоколы Proof-of-Stake позволяют держателям токенов получать вознаграждения и участвовать в протоколе с помощью механизма, называемого **стейкинг**. В этом уроке показано, как стейкать токены Casper с помощью валидатора в сети. Этот процесс также называется **делегированием**. В этом руководстве мы будем использовать эти термины взаимозаменяемо, но для ясности объясним техническую разницу.
vi: Casper và các giao thức Proof-of-Stake khác cho phép chủ sở hữu token kiếm được phần thưởng và tham gia vào giao thức thông qua một cơ chế được gọi là **đặt cọc** (staking). Hướng dẫn này chỉ cho bạn cách đặt cọc mã thông báo Casper của bạn với trình xác thực trên mạng. Quá trình này còn được gọi là **ủy quyền** (delegation). Chúng tôi sẽ sử dụng các thuật ngữ này thay thế cho nhau trong hướng dẫn này, nhưng chúng tôi sẽ giải thích sự khác biệt về kỹ thuật cho rõ ràng.

source: This video guide covers the process at a high level, but we recommend following the written tutorial to go through the process step by step.
fr: Ce guide vidéo couvre le processus à un haut niveau, mais nous recommandons de suivre le tutoriel écrit pour parcourir le processus étape par étape.
ru: Это видео-руководство охватывает процесс на высоком уровне, но мы рекомендуем следовать письменному руководству, чтобы пройти процесс шаг за шагом.
vi: Hướng dẫn bằng video này bao gồm các bước ở mức độ cao, chúng tôi khuyên bạn nên làm theo hướng dẫn bằng văn bản dưới đây để thực hiện từng bước quy trình.

source: **Staking**
ru: **Стейкинг**
vi: **Đặt cọc**

source: Node operators stake their own tokens to earn the eligibility to propose and approve blocks on the network. For this reason, we also refer to them as validators. They also run and maintain servers connected to the Casper Network. With these actions, node operators enable the Proof-of-Stake aspect of the network. This process is different from mining tokens. Validators thus earn rewards for participating and for securing the network.
fr: Les opérateurs de nœuds mettent en jeu leurs propres jetons pour obtenir le droit de proposer et d'approuver des blocs sur le réseau. Pour cette raison, nous les appelons aussi les validateurs. Ils gèrent et entretiennent également les serveurs connectés au réseau Casper. Grâce à ces actions, les opérateurs de nœuds activent l'aspect "Preuve d'enjeu" ou "Proof Of Stake du réseau". Ce processus est différent du minage de jetons. Les validateurs sont ainsi récompensés pour leur participation et pour la sécurisation du réseau.
ru: Операторы нод стейкают свои собственные токены, чтобы получить право предлагать и утверждать блоки в сети. По этой причине мы также называем их валидаторами. Они также управляют и обслуживают серверы, подключенные к сети Casper. С помощью этих действий операторы нод включают аспект подтверждения ставки в сети. Этот процесс отличается от майнинга токенов. Таким образом, валидаторы получают вознаграждение за участие и за безопасность сети.
vi: Các nhà khai thác nút đặt cọc token của riêng họ nhằm có đủ điều kiện để đề xuất và phê duyệt các khối trên mạng. Vì lý do này, chúng tôi cũng gọi chúng là trình xác thực. Họ cũng chạy và duy trì các máy chủ được kết nối với Mạng Casper. Với những hành động này, các nhà khai thác nút kích hoạt khía cạnh Proof-of-Stake của mạng. Quá trình này khác với khai thác mã thông báo. Do đó, trình xác thực sẽ kiếm được phần thưởng khi tham gia và bảo mật mạng.

source: **Delegating**
fr: **Delegation**
ru: **Делегирование**
vi: **Uỷ quyền**

source: You can also participate in the protocol to earn rewards without maintaining a Casper node (a server that stores a copy of the blockchain). To accomplish this, you can delegate or allocate your CSPR tokens to a chosen node operator on the network. The node operator will retain a commission, which is a percentage of the rewards generated from your staked tokens. By participating in the protocol this way, you help improve the network's decentralization and security and earn rewards in return. The base annual reward rate is currently 8% of the total supply.
fr: Vous pouvez également participer au protocole pour gagner des récompenses sans avoir à gérer un nœud Casper (un serveur qui stocke une copie de la blockchain). Pour ce faire, vous pouvez déléguer ou allouer vos jetons CSPR à un opérateur de nœud choisi sur le réseau. L'opérateur de nœud conservera une commission, qui correspond à un pourcentage des récompenses générées par vos jetons mis en jeu. En participant au protocole de cette manière, vous contribuez à améliorer la décentralisation et la sécurité du réseau et gagnez des récompenses en retour. Le taux de récompense annuel de base est actuellement de 8% de l'offre totale.
ru: Вы также можете участвовать в протоколе, чтобы получать вознаграждения, не поддерживая ноду Casper (сервер, на котором хранится копия блокчейна). Для этого вы можете делегировать или распределить свои токены CSPR выбранному оператору ноды в сети. Оператор ноды сохранит комиссию, которая представляет собой процент от вознаграждений, полученных от ваших размещенных токенов. Участвуя таким образом в протоколе, вы помогаете улучшить децентрализацию и безопасность сети и получаете взамен вознаграждение. Базовая годовая ставка вознаграждения в настоящее время составляет 8% от общего объема предложения.
vi: Bạn cũng có thể tham gia vào giao thức để kiếm phần thưởng mà không cần duy trì nút Casper (máy chủ lưu trữ bản sao của chuỗi khối). Để thực hiện điều này, bạn có thể ủy quyền hoặc phân bổ token CSPR của mình cho một nhà khai thác nút đã chọn trên mạng. Nhà điều hành nút sẽ giữ lại một khoản hoa hồng, là tỷ lệ phần trăm của phần thưởng được tạo ra từ các mã thông báo đã đặt cọc của bạn. Bằng cách tham gia vào giao thức theo cách này, bạn giúp cải thiện sự phân cấp và bảo mật của mạng và đổi lại kiếm được phần thưởng. Tỷ lệ phần thưởng cơ bản hàng năm hiện là 8% trên tổng nguồn cung.

source: This tutorial will show you how to earn rewards by delegating your Casper tokens. We will also cover the steps to undelegate your tokens at the end of the tutorial.
fr: Ce tutoriel vous montrera comment gagner des récompenses en déléguant vos jetons Casper. Nous couvrirons également les étapes pour annuler la délégation de vos jetons à la fin du tutoriel.
ru: В этом уроке вы узнаете, как получать награды, делегируя свои токены Casper. Мы также рассмотрим шаги по отмене делегирования ваших токенов в конце урока.
vi: Hướng dẫn này sẽ chỉ cho bạn cách kiếm phần thưởng bằng cách ủy quyền token Casper của bạn. Chúng tôi cũng sẽ trình bày các bước huỷ uỷ quyền token của bạn ở cuối hướng dẫn.

source: 1. Staking Overview
fr: 1. Aperçu du Staking
ru: 1. Обзор стейкинга
vi: 1. Tổng quan về đặt cọc

source: Staking the process by which node operators participate in the blockchain network. It is important to understand the fundamentals of staking because when you delegate your tokens to a validator, they will be staking those tokens on your behalf. Here are a few common topics related to staking, but we encourage you to do your own research.
fr: Le Staking est le processus par lequel les opérateurs de nœuds participent au réseau blockchain. Il est important de comprendre les principes fondamentaux du Staking, car lorsque vous déléguez vos jetons à un validateur, celui-ci les stake en votre nom. Voici quelques sujets courants liés au Staking, mais nous vous encourageons à faire vos propres recherches.
ru: Определение процесса, посредством которого операторы узлов участвуют в сети блокчейна. Важно понимать основы размещения ставок, потому что, когда вы делегируете свои токены валидатору, они будут размещать эти токены от вашего имени. Вот несколько общих тем, связанных с размещением ставок - стейкингом, но мы рекомендуем вам провести собственное исследование.
vi: Đặt cọc theo quy trình mà các nhà khai thác nút tham gia vào mạng chuỗi khối. Điều quan trọng là phải hiểu các nguyên tắc cơ bản của việc đặt cọc vì khi bạn ủy quyền các token của mình cho trình xác thực, họ sẽ đặt cọc các token đó thay mặt bạn. Dưới đây là một vài chủ đề phổ biến liên quan đến việc đặt cọc, nhưng chúng tôi khuyến khích bạn tự nghiên cứu.

source: **Slashing**
ru: **Слэшинг**
vi: **Phạt trừ tài khoản**

source: Presently Casper does not slash if a node operator equivocates or misbehaves. If a node equivocates, other validators will ignore its messages, and the node will become inactive.
fr: Actuellement, Casper ne "slash" pas si un opérateur de nœud équivoque ou se comporte mal. Si un nœud est équivoque, les autres validateurs ignoreront ses messages, et le nœud deviendra inactif.
ru: В настоящее время Casper не сокращает, если оператор ноды создает двусмысленности или ведет себя неправильно. Если нода отклоняется, другие средства проверки будут игнорировать ее сообщения, и нода станет неактивной.
vi: Hiện tại Casper không phạt nếu một nhà điều hành nút không rõ ràng hoặc hoạt động sai. Nếu một nút không rõ ràng, các trình xác thực khác sẽ bỏ qua các thông báo của nó và nút đó sẽ trở nên không hoạt động.

source: **Commission**
ru: **Комиссия**
vi: **Hoa hồng**

source: Node operators (also known as validators) define a commission they take to provide staking services. This commission is a percentage of the rewards node operators take for their services.
fr: Les opérateurs de nœuds (également appelés validateurs) définissent une commission qu'ils prennent pour fournir des services de staking. Cette commission est un pourcentage des récompenses que les opérateurs de nœuds reçoivent pour leurs services.
ru: Операторы ноды (также известные как валидаторы) определяют комиссию, которую они берут за предоставление услуг по размещению ставок - стейкингу. Эта комиссия представляет собой процент от вознаграждения, которое операторы нод получают за свои услуги.
vi: Các nhà khai thác nút (còn được gọi là trình xác thực) xác định một khoản hoa hồng mà họ thực hiện để cung cấp dịch vụ đặt cọc. Hoa hồng này là một tỷ lệ phần trăm của phần thưởng mà các nhà khai thác nút nhận được cho các dịch vụ của họ.

source: **Rewards**
fr: **Récompenses**
ru: **Вознаграждения**
vi: **Phần thưởng**

source: Validators receive rewards, proportional to their stake, for participating in the network. Delegators receive a portion of the validator's rewards, proportional to what they staked, minus the validator's commission (or delegation rate).
fr: Les validateurs reçoivent des récompenses, proportionnelles à leur mise (stake), pour leur participation au réseau. Les délégués reçoivent une partie des récompenses du validateur, proportionnellement à leur mise, moins la commission du validateur (ou taux de délégation).
ru: Валидаторы получают вознаграждение, пропорциональное их ставке, за участие в сети. Делегаторы получают часть вознаграждения валидатора, пропорциональную тому, что они поставили, за вычетом комиссии валидатора (или курса делегирования).
vi: Trình xác thực sẽ nhận được phần thưởng, tỷ lệ thuận với số tiền đặt cọc của họ, khi tham gia vào mạng. Người ủy quyền nhận được một phần phần thưởng của trình xác thực, tỷ lệ với số tiền họ đặt cọc, trừ đi hoa hồng của trình xác thực (hoặc tỷ lệ ủy quyền).

source: **Validator Selection**
fr: **Sélection des validateurs**
ru: **Отбор валидаторов**
vi: **Chọn trình xác thực**

source: As a prospective delegator, you need to select a validating node that you can trust. Please do your due diligence before you stake your tokens with a validator.
fr: En tant que délégué potentiel, vous devez sélectionner un nœud de validation en qui vous pouvez avoir confiance. Veuillez faire preuve de diligence raisonnable avant de staker vos jetons avec un validateur.
ru: В качестве потенциального делегата важно выбрать проверяющую ноду, которой вы можете доверять. Пожалуйста, проявите должную осмотрительность, прежде чем ставить свои токены на стейк с помощью валидатора.
vi: Là một người ủy quyền tiềm năng, bạn cần chọn một nút xác thực mà bạn có thể tin tưởng. Vui lòng thực hiện thẩm định của bạn trước khi bạn đặt cọc token của mình với trình xác thực.

source: 3. Creating your Wallet with the CasperLabs Signer
fr: 3. Création de votre portefeuille avec CasperLabs Signer
ru: 3. Создание вашего Кошелька с CasperLabs Signer
vi: 3. Tạo Ví của bạn bằng CasperLabs Signer

source: To stake tokens, you need access to a wallet with CSPR tokens. At the moment, you can use the `CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_ tool. The Signer acts as your CSPR wallet, keeping your accounts secure and helping you perform actions like staking, un-staking, or sending tokens to another account. Please follow `the Signer Guide <https://docs.cspr.community/docs/user-guides/SignerGuide.html>`_ for additional details on how to set up this tool.
fr: Pour staker des jetons, vous devez avoir accès à un porte-monnaie contenant des jetons CSPR. Pour le moment, vous pouvez utiliser l'outil `CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_. Le Signer agit comme votre porte-monnaie CSPR, en gardant vos comptes sécurisés et en vous aidant à effectuer des actions comme le staking, l'annulation d'un staking ou l'envoi de jetons à un autre compte. Veuillez suivre `le Guide du Signer <https://docs.cspr.community/docs/user-guides/SignerGuide.html>`_ pour des détails supplémentaires sur la façon de configurer cet outil.
ru: Чтобы поставить токены, вам нужен доступ к кошельку с токенами CSPR. На данный момент вы можете воспользоваться инструментом подписи `CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_ . Подписывающий инструмент действует как ваш кошелек CSPR, обеспечивая безопасность ваших аккаунтов и помогая вам выполнять такие действия, как размещение ставок, снятие ставок или отправка токенов на другую учетную запись. Пожалуйста, следуйте `the Signer Guide <https://docs.cspr.community/docs/user-guides/SignerGuide.html>`_ для получения дополнительной информации о том, как настроить этот инструмент.
vi: Để đặt cọc token, bạn cần có quyền truy cập vào ví có token CSPR. Hiện tại, bạn có thể sử dụng công cụ `CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_. Signer hoạt động như một ví CSPR của bạn, giữ an toàn cho tài khoản của bạn và giúp bạn thực hiện các hành động như đặt cọc, hủy đặt cọc hoặc gửi token đến một tài khoản khác. Vui lòng làm theo `hướng dẫn Signer <https://docs.cspr.community/docs/user-guides/SignerGuide.html>`_ để biết thêm chi tiết về cách thiết lập công cụ này.

source: You can create, store, and use one or more CSPR accounts with your Signer wallet. A password protects all accounts in what we call a **vault**.
fr: Vous pouvez créer, stocker et utiliser un ou plusieurs comptes CSPR avec votre portefeuille Signer. Un mot de passe protège tous les comptes dans ce que nous appelons un **coffre-fort** (vault).
ru: Вы можете создавать, хранить и использовать одну или несколько учетных записей CSPR с помощью своего кошелька Signer. Пароль защищает все учетные записи в том, что мы называем **хранилищем** - vault.
vi: Bạn có thể tạo, lưu trữ và sử dụng một hoặc nhiều tài khoản CSPR bằng ví Signer của mình. Mật khẩu bảo vệ tất cả các tài khoản trong cái mà chúng tôi gọi là **ngăn tiền** (vault).

source: 3.1 Signing in to the CasperLabs Signer
fr: 3.1 Connexion au CasperLabs Signer
ru: 3.1 Регистрация в CasperLabs Signer
vi: 3.1 Đăng nhập vào CasperLabs Signer

source: If you are new or have logged out of the Signer, you can log in with these steps:
fr: Si vous êtes nouveau ou si vous vous êtes déconnecté du Signer, vous pouvez vous connecter en suivant ces étapes :
ru: Если вы новичок или вышли из Signer, вы можете войти в систему, выполнив следующие действия:
vi: Nếu bạn là người mới hoặc đã đăng xuất khỏi Signer, bạn có thể đăng nhập bằng các bước sau:

source: Using Chrome or a Chromium-based browser like Brave, navigate to the block explorer on the mainnet (https://cspr.live/), and click on the **Sign-in** menu.
fr: En utilisant Chrome ou un navigateur basé sur Chromium comme Brave, naviguez vers l'explorateur de bloc sur le réseau principal (https://cspr.live/), et cliquez sur le menu **Sign-in**.
ru: Используя Chrome или браузер на основе Хрома, такой как Brave, перейдите в обозреватель блоков в главной сети (https://cspr.live/), и нажмите на меню **Вход**.
vi: Sử dụng Chrome hoặc trình duyệt dựa trên Chromium như Brave, chuyển đến trình khám phá khối trên mainnet (https://cspr.live/) và nhấp vào menu **Đăng nhập**.

source: Download the `CasperLabs Signer extension <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_.
fr: Téléchargez l'extension `CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_.
ru: Загрузите расширение `CasperLabs Signer extension <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_.
vi: Tải về `phần mở rộng CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce>`_.

source: You will need to create a vault that will safeguard your accounts with a password. In this step, we assume that you have not used the Signer before, so click **Reset Vault**.
fr: Vous devrez créer un coffre-fort qui sauvegardera vos comptes avec un mot de passe. Dans cette étape, nous supposons que vous n'avez pas utilisé le Signer auparavant, alors cliquez sur **Reset Vault**.
ru: Вам нужно будет создать хранилище, которое защитит ваши учетные записи паролем. На этом шаге мы предполагаем, что вы раньше не использовали Signer, поэтому нажмите **Сбросить хранилище**.
vi: Bạn sẽ cần tạo một ngăn tiền để bảo vệ tài khoản của mình bằng mật khẩu. Trong bước này, chúng tôi giả định rằng bạn chưa sử dụng Signer trước đây, vì vậy hãy nhấp vào **Reset Vault**.

source: Create a password for your new vault. Confirm the password, and then click **Create Vault**.
fr: Créez un mot de passe pour votre nouveau coffre-fort. Confirmez le mot de passe, puis cliquez sur **Create Vault**.
ru: Создайте пароль для вашего нового хранилища. Подтвердите пароль, а затем нажмите **Создать хранилище**.
vi: Tạo mật khẩu cho ngăn tiền mới của bạn. Xác nhận mật khẩu, sau đó nhấp vào **Create Vault**.

source: Write down and store your password in a secure location. **If you lose it, you will lose access to this wallet!**
fr: Notez et conservez votre mot de passe dans un endroit sûr. **Si vous le perdez, vous perdrez l'accès à ce portefeuille**
ru: Запишите и сохраните свой пароль в безопасном месте. **Если вы потеряете его, вы потеряете доступ к этому кошельку!**
vi: Ghi lại và lưu trữ mật khẩu của bạn ở một vị trí an toàn. **Nếu bạn làm mất nó, bạn sẽ mất quyền truy cập vào ví này!**

source: Open the Signer extension and log into your vault.
fr: Ouvrez l'extension Signer et connectez-vous à votre coffre-fort.
ru: Откройте расширение Signer и зайдите в хранилище.
vi: Mở phần mở rộng Signer và đăng nhập vào ngăn tiền của bạn.

source: Click on the hamburger menu icon to select from a range of options. Notice that the checkmark indicates the active account.
fr: Cliquez sur l'icône du menu hamburger pour choisir parmi une série d'options. Remarquez que la coche indique le compte actif.
ru: Нажмите на значок меню в виде гамбургера, чтобы выбрать один из множества вариантов. Обратите внимание, что галочка указывает на активную учетную запись.
vi: Nhấp vào biểu tượng menu để chọn từ một loạt các tùy chọn. Lưu ý rằng dấu hộp kiểm cho biết tài khoản đang hiện hoạt.

source: From this menu, you can perform essential management functions, such as editing accounts, deleting accounts, or viewing and downloading your keys.
fr: À partir de ce menu, vous pouvez effectuer des fonctions de gestion essentielles, telles que la modification de comptes, la suppression de comptes, ou l'affichage et le téléchargement de vos clés.
ru: В этом меню вы можете выполнять основные функции управления, такие как редактирование учетных записей, удаление учетных записей или просмотр и загрузка ваших ключей.
vi: Từ menu này, bạn có thể thực hiện các chức năng quản lý cần thiết, chẳng hạn như chỉnh sửa tài khoản, xóa tài khoản hoặc xem và tải xuống khóa của bạn.

source: You can also view websites and dApps to which your accounts are connected.
fr: Vous pouvez également afficher les sites Web et les dApps auxquels vos comptes sont connectés.
ru: Вы также можете просматривать веб-сайты и приложения, к которым подключены ваши учетные записи.
vi: Bạn cũng có thể xem các trang web và dApp mà tài khoản của bạn được kết nối.

source: One essential function is the ability to download your keys and store them in a secure location. If you lose access to the vault, you can create a new vault with the downloaded files. Please do this as early as possible!
fr: Une fonction essentielle est la possibilité de télécharger vos clés et de les stocker dans un endroit sûr. Si vous perdez l'accès au coffre-fort, vous pouvez créer une nouveau coffre-fort avec les fichiers téléchargés. Faites-le le plus tôt possible !
ru: Одной из важных функций является возможность загружать ваши ключи и хранить их в безопасном месте. Если вы потеряете доступ к хранилищу, вы можете создать новое хранилище с загруженными файлами. Пожалуйста, сделайте это как можно раньше!
vi: Một chức năng cần thiết là khả năng tải xuống các khóa của bạn và lưu trữ chúng ở một vị trí an toàn. Nếu bạn mất quyền truy cập vào ngăn tiền, bạn có thể tạo một ngăn tiền mới với các tệp đã tải xuống. Hãy làm điều này càng sớm càng tốt!

source: 3.2 Creating a New Account
fr: 3.2 Créer un nouveau compte
ru: 3.2 Создание Новой учетной записи
vi: 3.2 Tạo tài khoản mới

source: If you are using the CasperLabs Signer for the first time, follow these steps to create an account and **download the account's keys**:
fr: Si vous utilisez le CasperLabs Signer pour la première fois, suivez ces étapes pour créer un compte et **télécharger les clés du compte** :
ru: Если вы используете CasperLabs Signer в первый раз, выполните следующие действия, чтобы создать учетную запись и **загрузить ключи учетной записи**:
vi: Nếu bạn đang sử dụng CasperLabs Signer lần đầu tiên, hãy làm theo các bước sau để tạo tài khoản và **tải xuống các khóa của tài khoản**:

source: Click **Create Account** in the Signer.
fr: Cliquez sur **Créer un compte** dans le Signer.
ru: Нажмите **Создать аккаунт** в Signer
vi: Nhấp vào **Tạo tài khoản** trong Signer.
