Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/staking.po
Languages: fr, ru, vi

source: You can find additional information on the `docs.cspr.community <https://docs.cspr.community/>`_ website.
fr: Vous pouvez trouver des informations supplémentaires sur le site `docs.cspr.community <https://docs.cspr.community/>`_.
ru: Дополнительную информацию вы можете найти тут `docs.cspr.community <https://docs.cspr.community/>`_ .
vi: Bạn có thể tìm thêm thông tin trên trang web `docs.cspr.community <https://docs.cspr.community/>`_.
