Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/staking.po
Languages: fr, ru, vi

source: Enter the CSPR amount you wish to transfer. **We recommend that you try these steps with a small amount of CSPR to verify you followed the steps correctly**. After one successful transfer, you will be more comfortable transferring larger amounts.
fr: Entrez le montant du CSPR que vous souhaitez transférer. **Nous vous recommandons d'essayer ces étapes avec un petit montant de CSPR pour vérifier que vous avez suivi les étapes correctement**. Après un transfert réussi, vous serez plus à l'aise pour transférer des montants plus importants.
ru: Введите сумму CSPR, которую вы хотите перевести. **Мы рекомендуем вам попробовать выполнить эти действия с небольшим количеством CSPR, чтобы убедиться, что вы правильно выполнили шаги**. После одного успешного перевода вам будет удобнее переводить большие суммы.
vi: Nhập số CSPR bạn muốn chuyển. **Chúng tôi khuyên bạn nên thử các bước này với một lượng nhỏ CSPR để xác minh rằng bạn đã thực hiện đúng các bước**. Sau một lần chuyển khoản thành công, bạn sẽ thoải mái hơn khi chuyển số tiền lớn hơn.

source: Click **Review**.
fr: Cliquez sur **Review**.
ru: Нажмите **Обзор**.
vi: Nhấn vào **Review**.

source: Submit your transfer request. Wait approximately 5 minutes, and then go to the https://cspr.live/ site to verify your transfer. On your account page, you should see that the **Liquid Account Balance** reflects the amount you have transferred.
fr: Soumettez votre demande de transfert. Attendez environ 5 minutes, puis allez sur le site https://cspr.live/ pour vérifier votre transfert. Sur la page de votre compte, vous devriez voir que le **Solde du compte liquide** reflète le montant que vous avez transféré.
ru: Отправьте запрос на перевод. Подождите примерно 5 минут, а затем перейдите в https://cspr.live/ сайт для подтверждения вашего перевода. На странице вашего аккаунта вы должны увидеть, что **Ликвидный баланс счета** отражает сумму, которую вы перевели.
vi: Gửi yêu cầu chuyển của bạn. Chờ khoảng 5 phút, sau đó truy cập trang https://cspr.live/ để xác minh chuyển khoản của bạn. Trên trang tài khoản của mình, bạn sẽ thấy rằng **Số dư tài khoản thanh khoản** phản ánh số tiền bạn đã chuyển.

source: Now you are ready to delegate your tokens.
fr: Vous êtes maintenant prêt à déléguer vos jetons.
ru: Теперь вы готовы делегировать свои токены.
vi: Bây giờ bạn đã sẵn sàng để ủy quyền các token của mình.

source: 6. Delegating Tokens
fr: 6.Déléguer des jetons
ru: 6. Делегирование токенов
vi: 6. Ủy quyền token

source: You can access the delegation functionality in two ways.
fr: Vous pouvez accéder à la fonctionnalité de délégation de deux manières.
ru: Вы можете получить доступ к функциям делегирования двумя способами.
vi: Bạn có thể truy cập chức năng ủy quyền theo hai cách.

source: **Option 1:** Click **Wallet** from the top navigation menu and then click **Delegate**.
fr: **Option 1:** Cliquez sur **Portefeuille** dans le menu de navigation supérieur, puis sur **Déléguer**.
ru: **Вариант 1:** Нажмите **Кошелек** в верхнем меню навигации, а затем нажмите **Делегировать**.
vi: **Tùy chọn 1:** Nhấp vào **Ví** từ menu điều hướng trên cùng, sau đó nhấp vào **Ủy quyền**.

source: **Option 2:** Click **Validators** from the top navigation menu. From the validators table, click on any validator to access their details. Once you find the validator to which you want to delegate tokens, click the **Delegate** button.
fr: **Option 2:** Cliquez sur **Validateurs** dans le menu de navigation supérieur. Dans le tableau des validateurs, cliquez sur n'importe quel validateur pour accéder à ses détails. Une fois que vous avez trouvé le validateur auquel vous voulez déléguer des jetons, cliquez sur le bouton **Déléguer**.
ru: **Вариант 2:** Нажмите **Валидаторы** в верхнем меню навигации. В таблице валидаторов щелкните на любого валидатора, чтобы получить доступ к его данным. Как только вы найдете валидатора, которому хотите делегировать токены, нажмите кнопку **Делегировать**.
vi: **Tùy chọn 2:** Nhấp vào **Trình xác thực** từ menu điều hướng trên cùng. Từ bảng trình xác thực, hãy nhấp vào bất kỳ trình xác thực nào để truy cập thông tin chi tiết của chúng. Khi bạn tìm thấy trình xác thực mà bạn muốn ủy quyền token, hãy nhấp vào nút **Ủy quyền**.

source: Then follow these instructions to delegate your tokens:
fr: Suivez ensuite ces instructions pour déléguer vos jetons :
ru: Затем следуйте этим инструкциям, чтобы делегировать свои токены:
vi: Sau đó, hãy làm theo các hướng dẫn sau để ủy quyền token của bạn:

source: **Step 1 - Delegation Details**
fr: **Etape 1 - Détails de la délégation**
ru: **Шаг 1 - Детали делегирования**
vi: **Bước 1 - Chi tiết ủy quyền**

source: Start by choosing the validator to which you want to delegate your tokens. You can search for one using the search box or paste their public key if you have a validator in mind.
fr: Commencez par choisir le validateur auquel vous voulez déléguer vos jetons. Vous pouvez en rechercher un à l'aide du champ de recherche ou coller sa clé publique si vous avez un validateur en tête.
ru: Начните с выбора валидатора, которому вы хотите делегировать свои токены. Вы можете выполнить поиск с помощью поля поиска или вставить открытый ключ валидатора, если у вас уже есть желаемый валидатор.
vi: Bắt đầu bằng cách chọn trình xác thực mà bạn muốn ủy quyền token của mình. Bạn có thể tìm kiếm một trình xác thực bằng cách sử dụng hộp tìm kiếm hoặc dán khóa công khai của chúng nếu bạn có thông tin về trình xác thực.

source: Enter the amount of CSPR you would like to delegate.
fr: Entrez le montant de CSPR que vous souhaitez déléguer.
ru: Введите сумму CSPR, которую вы хотели бы делегировать.
vi: Nhập số lượng CSPR bạn muốn ủy quyền.

source: Click **Next**.
fr: Cliquez sur **Suivant**.
ru: Нажмите **Далее**.
vi: Nhấn **Tiếp theo**.

source: **Step 2 - Confirm the Transaction**
fr: **Etape 2 - Confirmer la transaction**.
ru: **Шаг 2 - Подтвердите транзакцию**
vi: **Bước 2 - Xác nhận giao dịch**

source: Review the details of the transaction.
fr: Vérifiez les détails de la transaction.
ru: Ознакомьтесь с деталями транзакции.
vi: Xem lại các chi tiết của giao dịch.

source: Enter the amount you want to delegate.
fr: Saisissez le montant que vous souhaitez déléguer.
ru: Введите сумму, которую вы хотите делегировать.
vi: Nhập số bạn muốn ủy quyền.

source: If everything is correct, click **Next**. If you wish to change something, you can return to the previous step by clicking **Back to step 1**.
fr: Si tout est correct, cliquez sur **Suivant**. Si vous souhaitez modifier quelque chose, vous pouvez revenir à l'étape précédente en cliquant sur **Retour à l'étape 1**.
ru: Если все правильно, нажмите **Далее**. Если вы хотите что-то изменить, вы можете вернуться к предыдущему шагу, нажав **Вернуться к шагу 1**.
vi: Nếu mọi thứ đều chính xác, hãy nhấp vào **Tiếp theo**. Nếu bạn muốn thay đổi điều gì đó, bạn có thể quay lại bước trước đó bằng cách nhấp vào **Quay lại bước 1**.

source: **Step 3 - Sign the Transaction**
fr: **Etape 3 - Signature de la transaction**
ru: **Шаг 3 - Подпишите транзакцию**
vi: **Bước 3 - Ký giao dịch**

source: Click **Sign** with the CasperLabs Signer.
fr: Cliquez sur **Sign** avec le CasperLabs Signer.
ru: Нажмите **Подписать** с помощью CasperLabs Signer.
vi: Nhấp vào **Ký** bằng CasperLabs Signer.

source: Once the Signer app window opens, **make sure that the Deploy hash in the Signer window matches the Deploy hash in https://cspr.live/ before continuing!**
fr: Une fois que la fenêtre de l'application Signer s'ouvre, **vérifiez que le hash du déploiement dans la fenêtre Signer correspond au hachage du déploiement dans https://cspr.live/ avant de continuer!**.
ru: Как только откроется окно приложения Signer, **убедитесь, что хеш развертывания в окне Signer совпадает с хешем развертывания в https://cspr.live/ прежде чем продолжить!**
vi: Khi cửa sổ ứng dụng Signer mở ra, **hãy đảm bảo rằng Băm triển khai trong cửa sổ Signer khớp với Băm triển khai trong https://cspr.live/ trước khi tiếp tục!**

source: Click **Sign** in the Signer window to sign and finalize the transaction. You have completed the delegation.
fr: Cliquez sur **Sign** dans la fenêtre Signer pour signer et finaliser la transaction. Vous avez terminé la délégation.
ru: Нажмите **Подписать** в окне Signer, чтобы подписать и завершить транзакцию. Вы завершили делегирование.
vi: Nhấp vào **Ký** trong cửa sổ Signer để ký và hoàn tất giao dịch. Bạn đã hoàn thành việc ủy quyền.

source: The delegation transaction initiates as soon as the corresponding deploy is signed. You can review the details and status of the deploy by clicking **Deploy Details**. Now that you have everything set up, subsequent delegation operations will be much easier.
fr: La transaction de délégation s'initie dès que le déploiement correspondant est signé. Vous pouvez consulter les détails et l'état du déploiement en cliquant sur **Détails du déploiement**. Maintenant que vous avez tout configuré, les opérations de délégation ultérieures seront beaucoup plus faciles.
ru: Транзакция делегирования инициируется, как только подписано соответствующее развертывание. Вы можете просмотреть сведения и статус развертывания, нажав **Сведения о развертывании**. Теперь, когда у вас все настроено, последующие операции делегирования будут намного проще.
vi: Giao dịch ủy quyền bắt đầu ngay sau khi triển khai tương ứng được ký. Bạn có thể xem lại chi tiết và trạng thái của việc triển khai bằng cách nhấp vào **Chi tiết triển khai**. Bây giờ bạn đã thiết lập mọi thứ, các hoạt động ủy quyền tiếp theo sẽ dễ dàng hơn nhiều.

source: 7. Monitoring
fr: 7. Surveillance
ru: 7. Мониторинг
vi: 7. Giám sát

source: We recommend that you check in on how your stake is performing. The following points are important to understand and will be helpful in maximizing your rewards.
fr: Nous vous recommandons de contrôler les performances de votre stake. Les points suivants sont importants à comprendre et seront utiles pour maximiser vos récompenses.
ru: Мы рекомендуем вам проверить, как работает ваша ставка. Следующие моменты важны для понимания и будут полезны для максимизации ваших вознаграждений.
vi: Chúng tôi khuyên bạn nên kiểm tra xem phần đặt cọc của bạn đang hoạt động như thế nào. Những điểm sau đây rất quan trọng cần hiểu và sẽ hữu ích trong việc tối đa hóa phần thưởng của bạn.

source: If the validator you staked with decides to unbond, your stake will also be unbonded. Make sure that the validator you have selected is performing as per your expectations.
fr: Si le validateur sur lequel vous avez délégué vos jetons décide de se désengager, votre mise sera également désengagée. Assurez-vous que le validateur que vous avez choisi fonctionne conformément à vos attentes.
ru: Если валидатор, с которым вы сделали ставку, решит отменить привязку, ваш стейк также будет отменен. Убедитесь, что выбранный вами валидатор работает в соответствии с вашими ожиданиями.
vi: Nếu trình xác thực mà bạn đã đặt cọc quyết định hủy cổ phần, tiền đặt cược của bạn cũng sẽ bị hủy cổ phần. Đảm bảo rằng trình xác thực bạn đã chọn đang hoạt động như mong đợi của bạn.

source: Validators have to win a staking auction by competing for a validator slot with prospective and current validators. This process is permissionless, meaning validators can join and leave the auction without restrictions, except for the unbonding wait period, which lasts 14 hours.
fr: Les validateurs doivent gagner une enchère de staking en concourant pour une place de validateur avec des validateurs potentiels et actuels. Ce processus n'est pas soumis à autorisation, ce qui signifie que les validateurs peuvent rejoindre et quitter l'enchère sans restriction, à l'exception de la période d'attente pour le déblocage, qui dure 14 heures.
ru: Валидаторы должны выиграть аукцион ставок, соревнуясь за слот валидатора с потенциальными и текущими валидаторами. Этот процесс не имеет разрешений, что означает, что валидаторы могут присоединиться к аукциону и покинуть его без ограничений, за исключением периода ожидания анбондинга, который длится 14 часов.
vi: Trình xác thực phải giành chiến thắng trong một cuộc đấu giá đặt cọc bằng cách cạnh tranh để giành được vị trí xác thực với những người xác thực tiềm năng và hiện tại. Quá trình này không được phép, có nghĩa là trình xác thực có thể tham gia và rời khỏi phiên đấu giá mà không bị hạn chế, ngoại trừ khoảng thời gian chờ huỷ cổ phần, kéo dài 14 giờ.

source: Staking rewards are delivered to your account after each era, which is currently set to 2 hours. Note that it may take up to 2 eras (4 hours) for the first reward to appear after delegation. The rewards are automatically added to your current stake on the corresponding validator. You may view them under the *Rewards* tab on your account details page on https://cspr.live/.
fr: Les récompenses de staking sont livrées sur votre compte après chaque ère, qui est actuellement fixée à 2 heures. Notez qu'il peut falloir jusqu'à 2 ères (4 heures) pour que la première récompense apparaisse après la délégation. Les récompenses sont automatiquement ajoutées à votre mise actuelle sur le validateur correspondant. Vous pouvez les consulter sous l'onglet *Récompenses* sur la page des détails de votre compte sur https://cspr.live/.
ru: Награды за стейк поступают на ваш аккаунт после каждой эры, которая в настоящее время установлена на 2 часа. Обратите внимание, что для появления первой награды после делегирования может потребоваться до 2 эр (4 часа). Вознаграждения автоматически добавляются к вашей текущей ставке у соответствующего валидатора. Вы можете просмотреть их на вкладке *Награды* на странице сведений об учетной записи на https://cspr.live/.
vi: Phần thưởng đặt cọc sẽ được chuyển đến tài khoản của bạn sau mỗi kỷ nguyên, hiện được đặt thành 2 giờ. Lưu ý rằng có thể mất tối đa 2 kỷ nguyên (4 giờ) để phần thưởng đầu tiên xuất hiện sau khi ủy quyền. Phần thưởng sẽ tự động được thêm vào tiền đặt cọc hiện tại của bạn trên trình xác thực tương ứng. Bạn có thể xem chúng trong thẻ *Phần thưởng* trên trang chi tiết tài khoản của mình tại https://cspr.live/.

source: 8. Undelegating Tokens
fr: déblocage des Jetons (Undelegating)
ru: 8. Отмена делегирования токенов
vi: 8. Huỷ uỷ quyền token

source: If you want to undelegate your tokens, you can do so at any time. Note that the cost of the undelegation process is 0.5 CSPR. You can access the undelegate functionality in three ways.
fr: Si vous souhaitez annuler la délégation de vos jetons, vous pouvez le faire à tout moment. Notez que le coût de cette procédure est de 0,5 CSPR. Vous pouvez accéder à la fonctionnalité de déblocage de trois manières.
ru: Если вы хотите отменить делегирование своих токенов, вы можете сделать это в любое время. Обратите внимание, что стоимость процесса отмены составляет 0,5 CSPR. Вы можете получить доступ к функциям отмены делегирования тремя способами.
vi: Nếu bạn muốn hủy uỷ quyền token của mình, bạn có thể làm như vậy bất kỳ lúc nào. Lưu ý rằng chi phí của quá trình huỷ uỷ quyền là 0,5 CSPR. Bạn có thể truy cập chức năng huỷ uỷ quyền theo ba cách.

source: **Option 1:** Click **Wallet** from the top navigation menu and then click **Undelegate Stake**.
fr: **Option 1:** Cliquez sur **Portefeuille** dans le menu de navigation supérieur, puis sur **Débloquer le stake**.
ru: **Вариант 1:** Нажмите **Кошелек** в верхнем меню навигации, а затем нажмите **Отменить стейк**.
vi: **Tùy chọn 1:** Nhấp vào **Ví** từ menu điều hướng trên cùng, sau đó nhấp vào **Huỷ uỷ quyền đặt cọc**.

source: **Option 2:** Click **Validators** from the top navigation menu. From the validators table, click on any validator to access its details. Once you find the validator you wish to undelegate from, click the **Undelegate Stake** button.
fr: **Option 2:** Cliquez sur **Validateurs** dans le menu de navigation supérieur. Dans le tableau des validateurs, cliquez sur un validateur pour accéder à ses détails. Une fois que vous avez trouvé le validateur sur lequel vous souhaitez annuler la délégation, cliquez sur le bouton **Débloquer le stake**.
ru: **Вариант 2:** Нажмите **Валидаторы** в верхнем меню навигации. В таблице валидаторов щелкните любого валидатора, чтобы получить доступ к его сведениям. Как только вы найдете валидатора, от которого хотите отказаться, нажмите кнопку **Отменить стейк**.
vi: **Tùy chọn 2:** Nhấp vào **Trình xác thực** từ menu điều hướng trên cùng. Từ bảng trình xác thực, hãy nhấp vào bất kỳ trình xác thực nào để truy cập thông tin chi tiết của nó. Khi bạn tìm thấy trình xác thực mà bạn muốn hoàn tác, hãy nhấp vào nút **Huỷ uỷ quyền đặt cọc**.

source: **Option 3:** Go to your account details by clicking your public key in the top navigation menu or clicking **View Account** from the expanded menu. Then click on the **Delegations** tab, and click on the **Undelegate** button next to the entry you want to undelegate.
fr: **Option 3:** Accédez aux détails de votre compte en cliquant sur votre clé publique dans le menu de navigation supérieur ou en cliquant sur **Voir le compte** dans le menu étendu. Ensuite, cliquez sur l'onglet **Délégations**, et cliquez sur le bouton **Débloquer** à côté de l'entrée que vous voulez débloquer.
ru: **Вариант 3:** Перейдите к данным своей учетной записи, щелкнув свой открытый ключ в верхнем меню навигации или нажав **Просмотреть учетную запись** в расширенном меню. Затем перейдите на вкладку **Делегирование** и нажмите кнопку **Отменить делегирование** рядом с записью, которую вы хотите отменить.
vi: **Tùy chọn 3:** Đi đến chi tiết tài khoản của bạn bằng cách nhấp vào khóa công khai của bạn trong menu điều hướng trên cùng hoặc nhấp vào **Xem tài khoản** từ menu mở rộng. Sau đó nhấp vào thẻ **Ủy quyền** và nhấp vào nút **Huỷ uỷ quyền** cạnh mục nhập bạn muốn huỷ uỷ quyền.

source: Then follow these instructions to undelegate your tokens:
fr: Ensuite, suivez les instructions suivantes pour annuler la délégation de vos jetons :
ru: Затем следуйте этим инструкциям, чтобы отменить делегирование своих токенов:
vi: Sau đó, hãy làm theo các hướng dẫn sau để hủy uỷ quyền token của bạn:

source: **Step 1 - Undelegation Details**
fr: **Etape 1 - Détails du déblocage**.
ru: **Шаг 1 - Детали отмены делегирования**
vi: **Bước 1 - Chi tiết hủy uỷ quyền**

source: Start by choosing the validator from which you want to undelegate your tokens. If a validator is not already selected, you can search for one using the search box. The search box will automatically show you validators with which you have staked.
fr: Commencez par choisir le validateur sur lequel vous souhaitez annuler la délégation de vos jetons. Si un validateur n'est pas déjà sélectionné, vous pouvez en rechercher un à l'aide du champ de recherche. Le champ de recherche vous montrera automatiquement les validateurs avec lesquels vous avez misé.
ru: Начните с выбора валидатора, у которого вы хотите отменить делегирование своих токенов. Если валидатор еще не выбран, вы можете найти его с помощью поля поиска. В окне поиска автоматически отобразятся валидаторы, с помощью которых вы сделали ставку.
vi: Bắt đầu bằng cách chọn trình xác thực mà bạn muốn hủy uỷ quyền token của mình. Nếu trình xác thực chưa được chọn, bạn có thể tìm kiếm một trình xác thực bằng cách sử dụng hộp tìm kiếm. Hộp tìm kiếm sẽ tự động hiển thị cho bạn các trình xác thực mà bạn đã đặt cọc.

source: Enter the amount of Casper tokens you want to undelegate.
fr: Saisissez la quantité de jetons Casper que vous souhaitez débloquer.
ru: Введите сумму токенов Casper, которую вы хотите отменить с делегирования.
vi: Nhập số lượng mã thông báo Casper bạn muốn huỷ uỷ quyền.

source: Review your transaction details.
fr: Vérifiez les détails de votre transaction.
ru: Ознакомьтесь с деталями вашей транзакции.
vi: Xem lại chi tiết giao dịch của bạn.

source: If everything looks correct, click **Confirm** to undelegate the tokens. If you wish to change something, you can return to the previous step by clicking **Back to step 1**.
fr: Si tout semble correct, cliquez sur **Confirmation** pour annuler la délégation des jetons. Si vous souhaitez modifier quelque chose, vous pouvez revenir à l'étape précédente en cliquant sur **Retour à l'étape 1**.
ru: Если все правильно, нажмите **Подтвердить**. Если вы хотите что-то изменить, вы можете вернуться к предыдущему шагу, нажав **Вернуться к шагу 1**.
vi: Nếu mọi thứ đều chính xác, hãy nhấp vào **Xác nhận** để huỷ uỷ quyền token. Nếu bạn muốn thay đổi điều gì đó, bạn có thể quay lại bước trước đó bằng cách nhấp vào **Quay lại bước 1**.

source: Once the Signer app window opens, **make sure that the Deploy hash in the Signer window matches the Deploy hash in https://cspr.live/ before continuing**!
fr: Une fois que la fenêtre de l'application Signer s'ouvre, **vérifiez que le hash de déploiement dans la fenêtre Signer correspond au hash de déploiement dans https://cspr.live/ avant de continuer** !
ru: Как только откроется окно приложения Signer, **убедитесь, что хеш развертывания в окне Signer совпадает с хешем развертывания в https://cspr.live/ прежде чем продолжить!**
vi: Khi cửa sổ ứng dụng Signer mở ra, **hãy đảm bảo rằng Băm triển khai trong cửa sổ Signer khớp với Băm triển khai trong https://cspr.live/ trước khi tiếp tục**!

source: Click **Sign** in the Signer window to sign and finalize the transaction.
fr: Cliquez sur **Sign** dans la fenêtre Signer pour signer et finaliser la transaction.
ru: Нажмите **Подписать** в окне Signer, чтобы подписать и завершить транзакцию.
vi: Nhấp vào **Ký** trong cửa sổ Signer để ký và hoàn tất giao dịch.

source: The stake undelegation initiates as soon as the corresponding deploy is signed. It may take 1-2 minutes for the undelegation details to become available. Please note that your undelegated tokens will appear in your account automatically after a 7-era delay, which is approximately 14 hours.
fr: Le déblocage de la mise commence dès que le déploiement correspondant est signé. Il peut s'écouler 1 à 2 minutes avant que les détails du déblocage ne soient disponibles. Veuillez noter que vos jetons débloqués apparaîtront automatiquement sur votre compte après un délai de 7 ans, soit environ 14 heures.
ru: Отмена стейка начинается как только соответствующее развертывание подписано. Это может занять 1-2 минуты, пока детали отмены делегирования станут доступны. Пожалуйста обратите внимание, что отмененные токены вернутся на ваш аккаунт автоматически после периода ожидания 7 эр, что занимает примерно 14 часов.
vi: Việc hủy uỷ quyền đặt cọc bắt đầu ngay sau khi triển khai tương ứng được ký kết. Có thể mất 1-2 phút để thông tin chi tiết về huỷ uỷ quyền có tác dụng. Xin lưu ý rằng các token của bạn sẽ tự động xuất hiện trong tài khoản của bạn sau thời gian trì hoãn 7 kỷ nguyên, tức là khoảng 14 giờ.

source: Conclusion
ru: Вывод
vi: Phần kết luận

source: By staking your tokens, you help secure the network and earn rewards in return. Thank you for your trust and participation!
fr: Avec le Staking de vos jetons, vous contribuez à sécuriser le réseau et gagnez des récompenses en retour. Merci de votre confiance et de votre participation !
ru: Когда вы стейкаете свои токены, вы делаете вклад в безопасность сети и в ответ получаете вознаграждения. Спасибо за доверие и участие!
vi: Bằng cách đặt cọc token của mình, bạn giúp bảo mật mạng và đổi lại kiếm được phần thưởng. Xin chân thành cảm ơn bạn đã tin tưởng và tham gia!
