Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/workflow/transfer-workflow.po
Languages: ru

source: Direct Token Transfer
ru: Прямой перевод токенов

source: This workflow describes how to use the Casper command-line client to transfer tokens between accounts on a Casper Network.
ru: В этом рабочем процессе описывается, как использовать клиент командной строки Casper для передачи токенов между учетными записями в сети Casper.

source: This workflow assumes:
ru: Этот рабочий процесс предполагает:

source: You meet the `prerequisites <setup.html>`_
ru: Вы соответствуете 'предварительным условиям <setup.html>`_

source: You are using the Casper command-line client
ru: Вы используете клиент командной строки Casper

source: You have a source ``PublicKey`` hex and a target ``PublicKey`` hex
ru: У вас есть исходный шестнадцатеричный код "PublicKey" и целевой шестнадцатеричный код "PublicKey"

source: You have a valid ``node-address``
ru: У вас есть действительный "адрес ноды"

source: You must be able to sign a deploy for the source account
ru: У вас должна быть возможность подписывать развертывания исходного аккаунта.

source: Transfer
ru: Перевод

source: The ``transfer`` command allows you to move CSPR from one account to another as denominated in `Motes <https://docs.casperlabs.io/en/latest/implementation/tokens.html?highlight=motes#divisibility-of-tokens>`_. A `Mote` is a denomination of the cryptocurrency CSPR, where 1 CSPR = 1,000,000,000 Motes.
ru: Команда перевода ``transfer`` позволяет вам переводить CSPR из одного аккаунта в другой, как выражено в `Motes <https://docs.casperlabs.io/en/latest/implementation/tokens.html?highlight=motes#divisibility-of-tokens>`_ . Монетка "Mote" - это единица криптовалюты CSPR, где 1 CSPR = 1,000,000,000 Motes.

source: For transfers of at least 2.5 CSPR (2,500,000,000 Motes) from a single sender to a single recipient on a Casper network, the most efficient option is to use the direct transfer capability.
ru: Для переводов не менее 2,5 CSPR (2 500 000 000 motes) от одного отправителя одному получателю в сети Casper наиболее эффективным вариантом является использование возможности прямого перевода.

source: **Direct transfer example**:
ru: **Пример прямого трансфера**:

source: **Request fields:**
ru: **Поля запросов:**

source: ``id`` - <STRING OR INTEGER> Optional JSON-RPC identifier applied to the request and returned in the response. If not provided, a random integer will be assigned
ru: ``id`` - <STRING OR INTEGER> Необязательный идентификатор JSON-RPC, применяемый к запросу и возвращаемый в ответе. Если не указано, будет присвоено случайное целое число

source: ``transfer-id`` - <64-BIT INTEGER> The ``transfer-id`` is a memo field, providing additional information about the recipient, which is necessary when transferring tokens to some recipients. For example, if depositing tokens into an account where off-chain management keeps track of individual sub-balances, it is necessary to provide a memo id uniquely identifying the actual recipient. If this is not necessary for a given recipient, you may pass ``0`` or some ``u64`` value that is meaningful to you
ru: ``transfer-id`` - <64-BIT INTEGER> ``transfer-id`` Идентификатор перевода - это поле памятки, предоставляющее дополнительную информацию о получателе, которая необходима при передаче токенов некоторым получателям. Например, если вы вносите токены на счет, где автономное управление отслеживает отдельные суббалансы, необходимо предоставить идентификатор памятки, однозначно идентифицирующий фактического получателя. Если это не обязательно для данного получателя, вы можете передать "0" или какое-либо значение "u64", которое имеет для вас значение

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of a node on a network bound to a JSON-RPC endpoint [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт ноды, на которой запущена служба HTTP [по умолчанию:http://localhost:7777]

source: ``amount`` - <512-BIT INTEGER> The number of motes to transfer (1 CSPR = 1,000,000,000 ``Motes``)
ru: ``amount`` - сумма <512-BIT INTEGER> количество motes для перевода (1 CSPR = 1,000,000,000 ``Motes``)

source: ``secret-key`` - Path to secret key file
ru: ``secret-key`` - путь к файлу с секретным ключом

source: ``chain-name`` - Name of the chain, to avoid the deploy from being accidentally or maliciously included in a different chain
ru: ``chain-name`` - Имя цепочки, чтобы избежать случайного или злонамеренного включения развертывания в другую цепочку

source: The *chain-name* for testnet is **casper-test**
ru: *Имя цепочки* для тестнет - **casper-test**

source: The *chain-name* for mainnet is **casper**
ru: *Имя цепочки* для майннет - **casper**

source: ``target-account`` - <HEX STRING> Hex-encoded public key of the account from which the main purse will be used as the target
ru: ``target-account`` - <HEX STRING> целевой аккаунт - шестнадцатеричный публичный ключ аккаунта, главный кошелек которого будет использоваться как цель

source: **Important response fields:**
ru: **Важные области реагирования:**

source: ``"result"."deploy_hash"`` - the address of the executed transfer, needed to look up additional information about the transfer
ru: ``"result"."deploy_hash"`` - адрес выполненного перевода, необходимый для просмотра дополнительной информации о трансфере

source: **Note**: Save the returned `deploy_hash` from the output to query information about the transfer deploy later.
ru: **Примечание**: Сохраните возвращенный хеш развертывания 'deploy_hash' из выходных данных, чтобы запросить информацию о развертывании перевода позже.

source: **JSON-RPC Request**:
ru: запрос **JSON-RPC Request**:

source: **JSON-RPC Response**:
ru: ответ **JSON-RPC Response**:

source: Deploy Status
ru: Статус развертывания

source: A transfer on a Casper Network is only executed after it has been included in a finalized block.
ru: Перевод в сети Casper выполняется только после того, как он был включен в завершенный блок.

source: Refer to the Section on `querying deploys <querying.html#deploy-status>`_ within the network to check the execution status of the transfer.
ru: Обратитесь к разделу о запросе развертываний `querying deploys <querying.html#deploy-status>`_ в сети, чтобы проверить статус выполнения перевода.

source: ``"result"."execution_results"[0]."transfers[0]"`` - the address of the executed transfer that the source account initiated. We will use it to look up additional information about the transfer
ru: ``"result"."execution_results"[0]."transfers[0]"`` - адрес выполненного трансфера, инициированного исходным аккаунтом. Мы будем использовать его, чтобы смотреть дополнительную информацию о переводе

source: ``"result"."execution_results"[0]."block_hash"`` - contains the block hash of the block that included our transfer. We will require the `state_root_hash` of this block to look up information about the accounts and their balances
ru: ``"result"."execution_results"[0]."block_hash"`` - содержит хеш блока того блока, который включает наш перевод в себя. Мы будем запрашивать корневой хеш состояния `state_root_hash` этого блока, чтобы смотреть дополнительную информацию об аккаунтах и их балансах

source: **Note**: Transfer addresses use a ``transfer-`` string prefix.
ru: **Примечание**: В адресах переводов используется строковый префикс " transfer -".

source: State Root Hash
ru: Корневой хеш состояния

source: State information like the balance of an account on a Casper blockchain is stored in the `Global State <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_.
ru: Информация о состоянии, такая как баланс аккаунта в блокчейн Casper, хранится в глобальном состоянии `Global State <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_.

source: We will use the ``get-block`` command and the ``block_hash`` to query and retrieve the block that contains our deploy. We will use the ``state_root_hash`` from the response to look up various values, like the source and destination account and their balances.
ru: Мы будем использовать команду ``get-block`` и ``block_hash`` для запроса и получения блока, который содержит наше развертывание. Мы будем использовать корневой хеш ``state_root_hash`` этого ответа, чтобы просмотреть различные значения, такие как источник и аккаунт назначения и их балансы.

source: ``node-address`` <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт ноды, на которой запущена служба HTTP [по умолчанию:http://localhost:7777]

source: ``block-identifier`` - <HEX STRING OR INTEGER> Hex-encoded block hash or height of the block. If not given, the last block added to the chain as known at the given node will be used
ru: ``block-identifier`` - <HEX STRING OR INTEGER> 16-разрадный закодированный хеш высоты блока. Если не задан, последний блок добавленный в цепочку, как известно данной ноде, которая будет использоваться.

source: ``"result"."block"."header"."state_root_hash"`` - contains the ``state-root-hash`` for this block
ru: ``"result"."block"."header"."state_root_hash"`` - содержит корневой хеш состояния ``state-root-hash`` для этого блока

source: Query the Source Account
ru: Запрос исходного аккаунта

source: Next, we will query for information about the `Source` account, using the ``state-root-hash`` of the block containing our transfer and the public key of the `Target` account.
ru: Затем мы запросим информацию об учетной записи source - `Источника`, используя "корневой хеш состояния" блока, содержащего наш перевод, и открытый ключ учетной записи Цели - `Target`.

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
ru: ``node-address`` - <HOST:PORT> Имя хоста или IP-адрес и порт ноды, на которой запущена служба HTTP [по умолчанию:http://localhost:7777]

source: ``state-root-hash`` - <HEX STRING> Hex-encoded hash of the state root
ru: "корневой хеш состояния" - <HEX STRING> 16-разрядный закодированный хеш корневого состояния

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted public key, account hash, contract address hash, URef, transfer hash or deploy-info hash.
ru: "ключ" - <FORMATTED STRING or PATH> основной ключ для запроса. Это должен быть правильно сформатированный публичный ключ, хеш аккаунта, хеш адреса контракта, URef, хеш трансфера и хеш информации о развертывании.

source: ``"result"."stored_value"."Account"."main_purse"`` - the address of the main purse containing the sender’s tokens. This purse is the source of the tokens transferred in this example
ru: ``"result"."stored_value"."Account"."main_purse"`` - адрес основного кошелька, содержащего токены отправителя. Этот кошелек является источником токенов, передаваемых в этом примере

source: Query the Target Account
ru: Запрос целевого аккаунта

source: We will repeat the previous step to query information about the `Target` account.
ru: Мы повторим предыдущий шаг, чтобы запросить информацию о "Целевой" учетной записи.

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted public key, account hash, contract address hash, URef, transfer hash, or deploy-info hash.
ru: "ключ" - <FORMATTED STRING or PATH> основной ключ для запроса. Это должен быть правильно сформатированный публичный ключ, хеш аккаунта, хеш адреса контракта, URef, хеш трансфера и хеш информации о развертывании.

source: Get Source Account Balance
ru: Получить баланс исходного аккаунта

source: All accounts on a Casper system have a purse associated with the Casper system mint, which we call the `main purse`. The balance associated with a given purse is recorded in the global state, and the value can be queried using the ``URef`` associated with the purse.
ru: Все учетные записи в системе Casper имеют кошелек, связанный с выпуском монет системы Casper, который мы называем "основным кошельком". Баланс, связанный с данным кошельком, записывается в глобальном состоянии, и значение может быть запрошено с помощью "URef`, связанной с кошельком.

source: Now that we have the source purse address, we can get its balance using the ``get-balance`` command:
ru: Теперь, когда у нас есть адрес исходного кошелька, мы можем получить его баланс с помощью команды ``get-balance`` :

source: ``purse-uref`` - <FORMATTED STRING> The URef under which the purse is stored. This must be a properly formatted URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>"
ru: ``purse-uref`` - <FORMATTED STRING> URef под которой хранится кошелек. Это должна быть правильно форматированная URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>"

source: Get Target Account Balance
ru: Получить баланс целевого аккаунта

source: Similarly, now that we have the address of the target purse, we can get its balance.
ru: Аналогично, теперь, когда у нас есть адрес целевого кошелька, мы можем получить его баланс.

source: Query Transfer Details
ru: Запрос деталей перевода

source: Deploys in a Casper Network can contain multiple transfers. When such a deploy is executed, the information about each individual transfer is written to the global state. Each transfer can be uniquely identified by a hash known as the ``transfer-address``, a formatted string with a ``transfer-`` prefix.
ru: Развертывание в сети Casper может содержать несколько переводов. При выполнении такого развертывания информация о каждом отдельном переводе записывается в глобальное состояние. Каждый перевод может быть однозначно идентифицирован с помощью хеша, известного как ``transfer-address``, форматированной строки с префиксом ``transfer-``.

source: We will use the ``transfer-<address>`` to query more details about the transfer.
ru: Мы будем использовать ``transfer-<address>`` для запроса деталей о переводе.

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted transfer address; "transfer-<address>"
ru: "ключ" - <FORMATTED STRING or PATH> основной ключ для запроса. Это должен быть правильно сформатированный адрес перевода; "transfer- <address>"

source: The query responds with more information about the transfer we conducted: its deploy hash, the account which executed the transfer, the source, and target purses, and the target account. Using this additional information, we can verify that our transfer was executed successfully.
ru: Запрос отвечает дополнительной информацией о проведенном нами трансфере: хеш развертывания, учетная запись, которая выполнила передачу, исходный и целевой кошельки, а также целевая учетная запись. Используя эту дополнительную информацию, мы можем убедиться, что наш перевод был выполнен успешно.
