Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/staking/index.po
Languages: ru

source: Staking
ru: Стейкинг

source: A feature of Proof-of-Stake protocols is that token holders can actively participate in the protocol through a mechanism known as **staking**.
ru: Свойство протоколов Proof-of-Stake, заключающееся в том, что держатели токенов могут активно участвовать в протоколе через механизм, известный как **стейкинг**.

source: Persons that hold their private keys can choose to stake their tokens with any validator in the Casper network. Alternatively, it is possible to stake tokens via an exchange or custody provider as well.
ru: Лица, у которых есть свои закрытые ключи, могут поставить свои токены на стейк с любым валидатором в сети Casper. В качестве альтернативы, можно также размещать токены через биржу или поставщика услуг хранения.

source: This guide will outline the steps required to stake the CSPR token on the Casper network.
ru: Этот гайд освещает шаги, необходимые для стейкинга токенов CSPR в сети Casper.

source: What you need to know before staking
ru: Что нужно знать перед стейкингом

source: Please read the following sections carefully before staking tokens on the Casper network.
ru: Пожалуйста, внимательно изучите следующие разделы перед стейкингом токенов в сети Casper.

source: Slashing
ru: Слэшинг

source: Presently Casper does not slash for equivocations. If a node equivocates, its' messages are ignored by the rest of the validators for the balance of the era and made inactive. A node running the software provided by the Casper Association will terminate once it detects that it has equivocated. Future work includes locking an equivocating validator's stake for an extended duration of time, effectively penalizing the validator.
ru: В настоящее время Casper не сокращает за двусмысленности. Если нода отклоняется, его сообщения игнорируются остальными валидаторами для баланса эры и становятся неактивными. Нода, на которой запущено программное обеспечение, предоставленное Casper Association, завершит работу, как только обнаружит, что она допустила двусмысленность. Будущая работа включает блокировку сомнительного стейка валидатора на длительный период времени, эффективно наказывая валидатора.

source: Casper does not treat validator stake differently than delegator stake for security reasons.
ru: Casper относится к стейкам валидаторов и делегатов одинаково по причинам безопасности.

source: Delegation Rate
ru: Курс делегирования

source: Node operators (Validators) define a commission that they take in exchange for providing staking services. This commission is represented as a percentage of the rewards that the node operator retains for their services.
ru: Операторы ноды (валидаторы) определяют комиссию, которую они берут за обеспечение сервисов стейкинга. Эта комиссия выражена в проценте от вознаграждений, которые операторы берут за свои сервисы.

source: Rewards
ru: Вознаграждения

source: Validators receive rewards for participating in consensus by voting on blocks sending finality signatures (finalizing blocks). There is no precise *per-block* reward. Rewards are split proportionally among stakes within an era. If a validator is offline or cannot vote on many blocks, the rewards earned are also reduced. Delegators can only receive a proportional amount of the validator's rewards minus the validator’s commission (Delegation Rate).
ru: Валидаторы получают вознаграждения за участие в консенсусе, голосуя за блоки отправкой завершающих подписей (финализация блоков). Нет определенного вознаграждения *за блок*. Вознаграждения распределены пропорционально между стейками внутри эры. Если валидатор в оффлайн или не может голосовать во многих блоках, заработанные вознаграждения снимаются. Делегаты могут получить только пропорциональный объем от вознаграждения валидатора с учетом комиссии валидатора (курс делегирования).

source: Rewards are distributed at the end of each era.
ru: Вознаграждения выдаются в конце каждой эры

source: Selecting a node for Staking
ru: Выбор ноды для стейкинга

source: As a prospective delegator, it is important to select a validating node that you can trust. Please do your due diligence before you stake your tokens with a validator.
ru: В качестве потенциального делегата важно выбрать проверяющую ноду, которой вы можете доверять. Пожалуйста, проявите должную осмотрительность, прежде чем ставить свои токены на стейк с помощью валидатора.

source: Check in on your Stake
ru: Регистрация стейка

source: It’s recommended that you check in on how your stake is performing from time to time. If the validator you staked with decides to unbond, your stake will also be unbonded. Make sure that the validator you have selected is performing as per your expectations.
ru: Рекомендуется время от времени проверять, как работает ваша ставка. Если валидатор, с которым вы делали ставки, решит сделать анбондинг, ваша ставка также будет отменена. Убедитесь, что выбранный вами валидатор работает в соответствии с вашими ожиданиями.

source: Validators have to win a staking auction by competing with prospective and current validators for a slot. This process is permissionless, meaning validators can join and leave the auction without restrictions, except the unbonding wait period.
ru: Валидаторы должны выиграть аукцион ставок, соревнуясь с потенциальными и текущими валидаторами за слот. Этот процесс инклюзивен, что означает, что валидаторы могут присоединиться к аукциону и покинуть его без ограничений, за исключением периода анбондингового ожидания без привязки.

source: Unbonding Period
ru: Период анбондинга

source: For security purposes, whenever a token is un-staked or un-delegated, the protocol will continue to keep the token locked for 14 hours.
ru: В целях безопасности, когда бы ни был токен поставлен на стейк или делегирован, протокол будет продолжать удерживать токен в течение 14 часов.

source: Next Steps
ru: Дальнейшие шаги
