Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/economics/consensus.po
Languages: ru

source: Consensus Economics
ru: Экономика консенсуса

source: Highway consensus is a continuous, trust-less process where a fixed set of validators engage in scheduled communication to advance the linear chain of finalized blocks, representing the history of changes to the global state of the blockchain. The fixed set of validators may change at each era boundary. The economics of this layer revolve around validator selection and incentivization of participation according to the schedule.
ru: Консенсус Highway - это непрерывный и не требующий доверия процесс, в котором фиксированный набор валидаторов участвует в запланированной коммуникации для продвижения линейной цепочки завершенных блоков, представляющих историю изменений глобального состояния блокчейна. Фиксированный набор валидаторов может изменяться на каждой границе эры. Экономика этого слоя вращается вокруг выбора валидатора и стимулирования участия в соответствии с графиком.

source: Entry
ru: Вход

source: After genesis, the system selects a set of validators using a stake auction process. The auction takes place in the last block of an era, also called a switch block. An auction contract governs the validator selection process, and a *chainspec* configuration file specifies a few key parameters:
ru: После генезиса система выбирает набор валидаторов с помощью процесса стейкингового аукциона. Аукцион проводится в последнем блоке эры, также называемом блоком переключения. Аукционный контракт регулирует процесс выбора валидатора, а конфигурационный файл *chainspec* определяет несколько ключевых параметров:

source: The ``auction_delay`` specifies the amount of time that needs to pass before the system enables a new set of validators. For example, the `auction_delay` is 1 for Mainnet. Therefore, after a delay of 1 era, the winning validators become the validating set for the new era.
ru: ``auction_delay`` указывает количество времени, которое должно пройти, прежде чем система включит новый набор валидаторов. Например, `auction_delay` - это 1 для майннет. Поэтому после задержки в 1 эре, выигравшие валидаторы становятся валидирующим набором для новой эры.

source: The ``validator_slots`` parameter specifies how many validators can win an auction. The auction selects a fixed number of validators based on their highest bids.
ru: Параметр ``validator_slots`` определяет, сколько валидаторов могут выиграть аукцион. Аукцион избирает фиксированное количество валидаторов на основе их самых высоких бид.

source: Bids
ru: Бид - цена спроса

source: Each bid is a collection of tokens from a prospective or current validator and its delegators, considered in the auction as a single total. Bids and delegations can increase freely, but withdrawals are subject to an unbonding period governed by the ``unbonding_delay`` chainspec parameter. Tokens that are in the unbonding period are not part of the sum total considered in the auction. Consequently, the exact amount of the bid, which translates into protocol weight for winning validators, can vary within an era. The bids are visible in the switch block that determines the winners.
ru: Каждая ставка - бид представляет собой набор токенов потенциального или текущего валидатора и его делегатов, рассматриваемых в аукционе как единое целое. Биды и делегации могут свободно расти, но снятие средств осуществляется в течение периода анбондинга, регулируемого специфическим параметром сети ``unbonding_delay``. Токены, находящиеся в периоде анбондинга, не являются частью общей суммы, рассматриваемой в аукционе. Следовательно, точная сумма бида, которая переводится в вес протокола для выигравших валидаторов, может варьироваться в пределах эры. Биды отображаются в блоке переключения, который определяет победителей.

source: Each bid contains a delegation rate and activity status. The delegation rate can change at any time. Both of these properties are described further in this document.
ru: Каждый бид содержит курс делегирования и статус активности. Курс делегирования может измениться в любой момент. Оба эти свойства описаны далее в этом документе.

source: Delegation
ru: Делегирование

source: Delegation allows third parties to participate in consensus by adding weight to their preferred validators. Rewards received by validators are distributed in proportion to tokens bid and delegated. The current or prospective validator responsible for the bid receives a portion of the delegator rewards set by the delegation rate.
ru: Делегирование позволяет третьим лицам участвовать в консенсусе, добавляя вес к предпочтительным валидаторам. Награды, полученные валидаторами, распределяются пропорционально заявленным бидам токенов и делегированным токенам. Текущий или потенциальный валидатор, ответственный за проведение торгов получает часть делегаторского вознаграждение устанавливается по ставке курса делегирования.

source: Currently, delegation is unrestricted. Interested readers should review `CEP #29 <https://github.com/casper-network/ceps/pull/29>`_, which proposes delegation caps.
ru: В данный момент делегирование не ограничено. Заинтересованные пользователи могут изучить `CEP #29 <https://github.com/casper-network/ceps/pull/29>`_, где предлагаются фиксированные максимальные ставки по делегированию.

source: Incentives
ru: Стимулы

source: Correct operation of the Highway protocol requires the economics of the platform to discourage equivocation for safety and incentivize participation for liveness. Participation consists of on-time block proposals and timely responses to block proposals.
ru: Правильная работа протокола Highway требует, чтобы экономика платформы стимулировала отсутствие неопределенности в отношении безопасности и жизнеспособности. Участие состоит из своевременных блоковых предложений и своевременных ответов на блоковые предложения.

source: Safety may be incentivized through slashing for equivocation. This feature is currently disabled but may be reactivated in the future.
ru: Безопасность может быть стимулирована через сокращение неопределенности. Эта функция в настоящее время отключена, но может быть повторно активирована в будущем.

source: The network incentivizes participation by scaling rewards for on-time proposals and responses, taking into account the speed of finalizing blocks. All rewards are added directly to the corresponding bids and delegations.
ru: Сеть стимулирует участие путем масштабирования вознаграждений за своевременные предложения и ответы, принимая во внимание скорость завершения блоков. Все награды добавляются непосредственно к соответствующим бидам и делегированиям.

source: Participation
ru: Участие

source: Issuance of new tokens and their distribution to validators incentivizes work even under low transaction load.
ru: Выпуск новых токенов и их распределение валидаторам стимулирует работу даже в условиях низкой транзакционной загрузки.

source: CSPR is issued at a fixed rate and distributed to validators (and, indirectly, delegators) in proportion to their stake. This is analogous to block rewards in Proof-of-Work blockchains, outlining the following:
ru: Токены CSPR выпускаются по фиксированной ставке и распределяются между валидаторами (и непрямым образом между делегаторами) пропорционально их доле. Это аналогично вознаграждениям за блок в блокчейнах Proof-of-Work, за исключением нескольких отличий:

source: The growth of CSPR supply is exponential
ru: Рост предложения CSPR экспоненциальный

source: Issuance takes into account slashed CSPR
ru: При выдаче учитывается количество сокращенных CSPR

source: With slashing disabled, we can compute block rewards starting with the formula below, where we have these parameters:
ru: Если отключить сокращение, мы можем вычислить вознаграждение блока, начиная с приведенной ниже формулы, где у нас есть такие параметры:

source: ``i`` - the era's index as a positive integer [0, 1, 2, ..., n]
ru: ``i`` - индекс эры как натуральное число [0, 1, 2, ..., n]

source: ``initial_supply`` - the number of CSPR at genesis
ru: ``initial_supply`` - количество токенов CSPR на время генезиса

source: ``issuance_rate`` - the annual rate at which new CSPR tokens are minted
ru: ``issuance_rate`` - годовая ставка, по которой выпускаются новые токены CSPR

source: ``ticks_per_year`` - the number of milliseconds in a year equal to 31,536,000,000
ru: ``ticks_per_year`` - количество милисекунд в году, равное 31,536,000,000

source: We introduce the *round issuance rate* (corresponding to the chainspec parameter ``round_seigniorage_rate``) with this formula:
ru: Мы вводим *ставку круговой эмиссии* (соответствующую специфическому параметру сети ``round_seigniorage_rate``) с помощью этой формулы:

source: The *round issuance rate* is the annual issuance rate adjusted to a single round of length determined by the chainspec parameter ``minimum_round_exponent``. For illustration, an exponent of 14 corresponds to a round length of roughly 16 seconds.
ru: *Ставка круговой эмиссии* - это годовая ставка эмиссии, скорректированная на один раунд продолжительности, определяемый специфическим параметром сети ``minimum_round_exponent``. Например, показатель степени 14 соответствует круглой длине примерно 16 секунд.

source: Finally, the base round reward is computed as:
ru: Итак, основное вознаграждение за раунд рассчитывается так:

source: This value gives us the maximum amount of CSPR that the validators can collectively receive from a proposed block.
ru: Это значение дает максимальное количество CSPR, которое валидаторы могут коллективно получить от предлагаемого блока.

source: Distribution
ru: Распределение

source: Validators receive tokens for proposing and finalizing blocks according to their performance. The concept of weight is crucial for understanding this distribution scheme:
ru: Валидаторы получают токены за предложение и завершение работы блоков в соответствии с их производительностью. Понятие веса имеет решающее значение для понимания этой схемы распределения:

source: **Weight:** A validator's bonded stake, used in consensus
ru: **Вес:** Бондовый стейк валидатора, используемый в консенсусе

source: **Assigned weight of a block/round:** The total stake of validators scheduled to participate in a block
ru: **Назначенный вес блока/раунда:** Общая доля стейка валидаторов, запланированных для участия в блоке

source: **Participated weight of a block/round:** The total stake of validators that end up participating or sending messages to finalize a block before the end of their respective round
ru: **Распределенный вес блока/раунда:** Общий стейк валидаторов, которые участвовали в завершении блока и отправляли сообщения для завершения блока до завершения соответствующего раунда

source: To determine eligibility, we look at **on-time finalization (OTF)**. Validators should finalize blocks on time by sending required messages before the end of their respective round.
ru: Чтобы определить право на получение вознаграждения, мы смотрим на **своевременную доработку (OTF)**. Валидаторы должны своевременно завершать работу над блоками, отправляя необходимые сообщения до окончания соответствующего раунда.

source: Switch blocks are not visible to the issuance calculation (as this calculation is performed in the switch block itself for each era), and, consequently, no tokens are issued for switch blocks.
ru: Блоки переключения не видно при расчете выпуска (так как сам этот расчет происходит в локе переключения для каждой эры), и соответственно для блоков переключения не выпускаются токены.

source: Participation schedule
ru: Расписание участия

source: The participation schedule is segmented into rounds, which are allocated dynamically according to the validators' exponents and a deterministic (randomized at era start) assignment of validators to milliseconds of an era. Thus, a validator with the round exponent ``n`` must participate in rounds that repeat every ``2^n`` ticks.
ru: Расписание участия сегментировано на раунды, которые распределяются динамически в соответствии с показателями валидаторов и детерминированным (рандомизированным на старте эры) назначением валидаторов по миллисекундам эры. Таким образом, а валидатор с круглым показателем ``n`` необходимо участвовать в раундах, которые повторяются каждые ``2^n`` тиков.

source: Each validator is assessed according to its round exponent. All assigned validators become eligible to receive tokens as long as the block gets finalized with messages sent within each validator's round.
ru: Каждый валидатор оценивается в соответствии с собственным круглым показателем. Все назначенные валидаторы получают право на получение токенов, когда блок завершается сообщениями, отправленными в пределах каждого рауда валидатора.

source: Eligibility
ru: Право на вознаграждение

source: Once a block has been proposed and enough time has passed, the history of protocol messages can be examined to detect whether the block was finalized on time, according to the conditions given above. If the block was *not* finalized on time, validators receive a fraction of the expected tokens, governed by the ``reduced_reward_multiplier`` chainspec parameter. If the block was finalized on time, assigned validators share the reward proportionally to their stake, regardless of whether they have sent messages or not.
ru: Как только блок был предложен и прошло достаточно времени, история протокольных сообщений может быть изучена, чтобы определить, был ли блок завершен вовремя, в соответствии с приведенными выше условиями. Если блок был *не* завершен вовремя, валидаторы получают часть ожидаемых токенов, управляемых специфическим параметром сети ``reduced_reward_multiplier``. Если блок был завершен вовремя, назначенные валидаторы делят вознаграждение пропорционально их стейкам, независимо от того, отправили они сообщения или нет.

source: Inactivity
ru: Неактивность

source: Validators who send no messages during an entire era are marked as inactive and cease participating in the auction until they send a special deploy that reactivates their bid.
ru: Валидаторы, которые не отправили сообщений в течение целой эры, считаются неактивными и отстраняются от участия в аукционе до тех пор, ока не отправят специальное развертывание, которое вновь активирует их биды.

source: Slashing
ru: Сокращение

source: Please review our `Equivocator Policy <https://github.com/casper-network/ceps/blob/master/text/0038-equivocator-policy.md>`_. We are currently conducting research into the utility of slashing as an incentive mechanism.
ru: Пожалуйста, изучите нашу политику неопределенности `Equivocator Policy <https://github.com/casper-network/ceps/blob/master/text/0038-equivocator-policy.md>`_. В данный момент мы делаем исследование касательно полезности сокращения как механизма стимуляции.

source: Founding validators
ru: Учредительные валидаторы

source: Founding validators are subject to token lock-up, which prevents them from withdrawing any tokens from their bids for 90 days, then releases their genesis bid tokens in weekly steps, linearly, over an additional 90 days.
ru: Учредительные валидаторы подлежат блокировке токенов, что не позволяет им снимать любые токены со своих бид в течение 90 дней, а затем освобождает их биды генезиса еженедельно, линейно, в течение дополнительных 90 дней.
