Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/economics/index.po
Languages: ru

source: Overview
ru: Обзор

source: Economics
ru: Экономика

source: This page presents an overview of the Casper economics.
ru: На этой странице представлен обзор экономики Casper.

source: Casper's economic activity can be conceptualized as taking place on four distinct layers: consensus, runtime, ecosystem, and the macroeconomy. Each layer, consensus and up, provides a foundation for the activity taking place on the next layer. A trust-less platform requires that proper incentives be provided to participants operating each of these layers to ensure that they work together to unlock the platform's value.
ru: Экономическая деятельность Casper может быть концептуализирована как происходящая на четырех различных уровнях: консенсус, рабочая среда, экосистема и макроэкономика. Каждый слой, начиная с консенсуса, создает основу для деятельности, происходящей на следующем. Платформа, не требующая доверия, требует предоставления надлежащих стимулов участникам, работающим на каждом из этих уровней, чтобы гарантировать, что они работают вместе, чтобы раскрыть ценность платформы.

source: We cannot yet provide formal game-theoretic results for our incentive mechanisms, but interested readers can follow our progress with the `Economics of the Casper Blockchain <https://github.com/CasperLabs/Casper-economics-paper>`_ paper, which will be periodically updated to summarize ongoing research.
ru: Мы пока не можем предоставить формальные теоретико-игровые результаты для наших механизмов стимулирования, но заинтересованные читатели могут следить за прогрессом экономики блокчейна Casper здесь `Economics of the Casper Blockchain <https://github.com/CasperLabs/Casper-economics-paper>`_ - это статья, которая будет периодически обновляться для подведения итогов текущих исследований.

source: This section of our online documentation is intended only to familiarize the user with our core economics features rather than describe their precise implementation and user interface. Some of the features may not be currently active.
ru: Этот раздел нашей онлайн-документации предназначен только для ознакомления пользователя с нашими основными экономическими функциями, а не для описания их точной реализации и пользовательского интерфейса. Некоторые функции могут быть не активны в данный момент.

source: Consensus
ru: Консенсус

source: The consensus layer of our platform runs on the Highway flavor of CBC-Casper. The distinguishing characteristics of this protocol are its safety and liveness guarantees. Specifically, under the assumptions made in the `Highway protocol paper <https://github.com/casper-network/highway>`_, blocks in the canonical history cannot be reverted, and new blocks continue to be added to this history indefinitely. The assumptions, however, require that a large portion of validators remain online and honest; this assumed behavior must be incentivized for the platform to remain secure and live.
ru: Слой консенсуса нашей платформы работает на Highway предоставляемом CBC-Casper. Отличительными характеристиками этого протокола являются его гарантии безопасности и жизнеспособности. В частности, в соответствии с предположениями, сделанными в документе о протоколе Highway `Highway protocol paper <https://github.com/casper-network/highway>`_, блоки в канонической истории не могут быть возвращены назад, и новые блоки продолжают добавляться к этой истории бесконечно. Эти предположения, однако, требуют, чтобы большая часть валидаторов оставалась онлайн и честными; это предполагаемое поведение должно быть стимулировано для того, чтобы платформа оставалась безопасной и живой.

source: When discussing consensus, we default to considering it "one era at a time," unless expressly stated otherwise, in keeping with the Highway paper. Recall that each era is, effectively, a separate instance of the protocol.
ru: При обсуждении консенсуса мы по умолчанию рассматриваем его как "одну эру за раз", если прямо не указано иное, в соответствии с документом Highway. Напомним, что каждая эра, по сути, является отдельным экземпляром протокола.

source: Agents (consensus layer)
ru: Агенты (слой консенсуса)

source: *Validators* are responsible for maintaining platform security by building an ever-growing chain of finalized blocks, backing this chain's security with their stakes. Their importance (often referred to as "weight") both to protocol operation and security is, in fact, equal to their stake, which includes both their own and delegated tokens.
ru: *Валидаторы* ответственны за развитие безопасности платформы, благодаря сборке постоянно растущей сети завершенных блоков, поддерживающих безопасность сети своими стейками. Их значимость (часто называемая "вес") и для работы протокола и для безопасности - по факту равна доле их стейков, в которую включены их собственные токены и токены делегатов.

source: *Delegators* are users who participate in the platform's security by delegating their tokens to validators, which adds to their weight and collecting a part of the rewards proportional to their delegations, net of a cut ("delegation rate") that is collected by the validator.
ru: *Делегаты* - это пользователи, которые принимают участие в безопасности платформы благодаря делегированию своих токенов валидаторам, что добавляем им вес и позволяет собрать часть вознаграждений, пропорционально их делегированиям, и некая доля ("курс делегирования") их вознаграждений собирается валидаторами.

source: Incentives (consensus layer)
ru: Стимулы (слой консенсуса)

source: The *auction* determines the composition of the validator set for each era of the protocol. It is a "first-price" (winning bids become stakes) auction with a fixed number of spots chosen to balance security with performance (generally, the platform will run slower with more validators). Because rewards are proportional to the stake, we expect this competitive mechanism to provide a powerful impetus for staking as many tokens as possible.
ru: *Аукцион* определяет состав набора валидатора для каждой эры в протоколе. Это аукцион "первичной цены" (выигравшие биды становятся стейками), с фиксированным количеством точек, выбранных для балансировки безопасности и работоспособности (в основном платформа работает тем медленнее, чем больше валидаторов). Поскольку вознаграждения пропорциональны стейкам, мы ожидаем, что такой механизм конкуренции создаст мощный импульс для стейкинга максимально возможного числа токенов.

source: *Rewards* (per era) are issued to validators who perform, at their nominal pace, in such a way as to make timely progress on block finalization. These rewards are shared with delegators proportionally to their contributions, net of a cut taken by the validator.
ru: *Вознаграждения* (за эру) выдаются валидаторам, кто работает в своем номинальном темпе и при этом вносит постоянный вклад в процесс завершения блока. Эти вознаграждения также разделяются с делегатами, пропорционально их вкладу, с учетом доли валидатора.

source: *Evictions* deactivate validators who fail to participate in an era, disabling their bid and suspending their participation until they signal readiness to resume participation by invoking a particular entry point in the auction contract.
ru: *Выселение* - процесс деактивации валидаторов, которые не участвуют в эре, отключение их бидов и приостановка их участия до тех пор, пока они не сигнализируют о готовности возобновить участие, вызывая определенную точку входа в аукционном контракте.

source: Runtime
ru: Рабочая среда

source: The runtime layer encompasses the deployment and execution of smart contracts, session code, and other activity that performs computation on the global state. This suggests potential markets for finite platform resources, such as markets for computing time and storage. Such markets could ensure that resources are allocated to their highest-value uses. Currently, however, we limit ourselves to `metering computing time <https://docs.casperlabs.io/en/latest/implementation/execution-semantics.html#measuring-computational-work>`_, measured as gas. Gas can be conceptualized as relative time use of different WASM operations and host-side functions. Use of storage is also presently assigned a gas cost. We do not currently have a pricing mechanism for metered gas, although an outstanding Casper Enhancement Proposal (`CEP #22 <https://github.com/casper-network/ceps/pull/22>`_) suggests the implementation of a first-price gas auction similar to Ethereum's. The initial Mainnet deploy selection mechanism is based on FIFO.
ru: Слой рабочей среды включает в себя развертывание и выполнение смарт-контрактов, кода сеанса и других действий, выполняющих вычисления на глобальном состоянии. Это предполагает потенциальные рынки конечных ресурсов платформы, таких как рынки вычислительного времени и хранения. Такие рынки могли бы обеспечить распределение ресурсов для их наиболее выгодного использования. Однако в настоящее время мы ограничиваемся измерением вычислительного времени `metering computing time <https://docs.casperlabs.io/en/latest/implementation/execution-semantics.html#measuring-computational-work>`_, измеряемом как газ. Газ может быть концептуализирован как относительное временное использование различных операций WASM и функций на стороне хоста. Использование хранилища также в настоящее время назначается стоимостью газа. В настоящее время у нас нет механизма ценообразования на измеренный газ, хотя выдающееся предложение Casper Enhancement Proposal (`CEP #22 <https://github.com/casper-network/ceps/pull/22>`_) предполагает внедрение аукциона первичной цены на газ по модели в Ethereum. Первоначальный механизм выбора развертывания майннет основан на FIFO.

source: We expect to continue work on runtime resource markets, particularly gas futures (`CEP #17 <https://github.com/casper-network/ceps/pull/17>`_).
ru: Мы будем продолжать работать над рынками ресурсов рабочей среды, в частности фьючерсы газ (`CEP #17 <https://github.com/casper-network/ceps/pull/17>`_).

source: *Validators* again play a vital role in this layer since protocol operation includes construction and validation of new blocks, consisting of deploys that change the global state, which the validators also maintain.
ru: *Валидаторы* на этом слое опять же играют жизненно-важную роль, так как исполнение протокола включает конструкцию и валидацию новых блоков, состоящих из развертываний, которые изменяют глобальное состояние, которое также развивается валидаторами.

source: *Users* execute session and contract code using the platform's computational resources
ru: *Пользователи* исполняют сессию и код контракта, используя вычислительные ресурсы платформы.

source: *Transaction fees*, or charges for gas use, ensure that the users compensate validators for performing their computations. Transaction fees are awarded to the block creator. Because we expect to launch with FIFO ordering of deploys, it can be assumed that one unit of gas will be priced at one mote until future changes to deploy orders are implemented.
ru: *Стоимость транзакции*, или же сборы за использование газ, дают уверенность в том, что пользователи компенсируют валидаторам за проведение их вычислений. Стоимость транзакции выдается создателю блока. Поскольку мы ожидаем запуск с FIFO упорядочиванием развертываний, можно будет заключить, что один юнит газ будет стоить по их усмотрению, до тех пор пока будущие изменения в порядке развертываний не будут применены.

source: Ecosystem
ru: Экосистема

source: The ecosystem layer encompasses dApp design and operation. CasperLabs maintains multiple partnerships with prospective dApp developers, and we anticipate devoting significant resources to research the economics of prospective dApps.
ru: На слое экосистемы располагается дизайн и работе dApp. CasperLabs поддерживает партнерства с перспективными dApp разработчиками, и мы выступаем за посвящение значительных ресурсов в экономику будущих dApp приложений.

source: Macroeconomy
ru: Макроэкономика

source: Casper's macroeconomics refers to the activity in the cryptocurrency markets, where CSPR can be treated as one cryptoasset among many rather than a computational platform. Our token economics are different from those of "digital gold" tokens like Bitcoin, designed to be scarce. Our tokens are minted from a fixed starting basis, which is accounted for by tokens distributed to genesis validators, employees, community members and held for future distributions. The total supply of tokens grows at a fixed annual percentage rate from this basis.
ru: Макроэкономика Casper относится к деятельности на криптовалютных рынках, где CSPR можно рассматривать как один криптоассет среди многих, а не вычислительную платформу. Наша экономика токенов отличается от токенов "цифрового золота", таких как Bitcoin, рассчитанных на дефицит. Наши токены выпущены с фиксированной стартовой базы, которая учитывается токенами, распределенными между валидаторами эры генезиса, сотрудниками, членами сообщества и удерживаются для будущих распределений. Общее предложение токенов растет с фиксированной годовой процентной ставкой от этой базы.

source: The inflationary nature of our macroeconomics has two significant advantages over enforced scarcity. Inflation incentivizes token holders to stake or delegate their tokens, a behavior we explicitly support with our delegation feature. Additionally, because Casper is a general-purpose computing platform, it is essential to supply tokens to support actual economic activity on the platform and discourage hoarding tokens in expectation of speculative gain.
ru: Инфляционный характер нашей макроэкономики имеет два существенных преимущества перед тактикой вынужденного дефицита. Инфляция стимулирует держателей токенов стейкать или делегировать свои токены, поведение, которое мы явно поддерживаем с нашей функцией делегирования. Кроме того, поскольку Casper является универсальной вычислительной платформой, крайне важно поставлять токены для поддержки реальной экономической деятельности на платформе и препятствовать накоплению токенов в ожидании спекулятивной прибыли.
