Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/erc20/implementation.po
Languages: ru

source: ERC-20 Implementation
ru: Внедрение ERC-20

source: The ERC-20 standard is defined in `an Ethereum Improvement Proposal (EIP) <https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md#>`_. Read it carefully, as it defines the methods we have implemented:
ru: Стандарт ERC-20 определен в Предложении по улучшению Эфириума `an Ethereum Improvement Proposal (EIP) <https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md#>`_. Прочтите его внимательно, так как оно описывает методы, которые мы внедрили:

source: `allowance <#the-total-supply-balance-of-and-allowance-functions>`_
ru: надбавка `allowance <#the-total-supply-balance-of-and-allowance-functions>`_

source: `approve <#the-approve-and-transfer-from-functions>`_
ru: одобрение `approve <#the-approve-and-transfer-from-functions>`_

source: `balance_of <#the-total-supply-balance-of-and-allowance-functions>`_
ru: баланс `balance_of <#the-total-supply-balance-of-and-allowance-functions>`_

source: `decimals <#the-name-symbol-and-decimals-functions>`_
ru: десятичные `decimals <#the-name-symbol-and-decimals-functions>`_

source: `name <#the-name-symbol-and-decimals-functions>`_
ru: название `name <#the-name-symbol-and-decimals-functions>`_

source: `symbol <#the-name-symbol-and-decimals-functions>`_
ru: символ `symbol <#the-name-symbol-and-decimals-functions>`_

source: `total_supply <#the-total-supply-balance-of-and-allowance-functions>`_
ru: тотал `total_supply <#the-total-supply-balance-of-and-allowance-functions>`_

source: `transfer <#the-transfer-function>`_
ru: трансфер `transfer <#the-transfer-function>`_

source: `transfer_from <#the-approve-and-transfer-from-functions>`_
ru: трансфер из `transfer_from <#the-approve-and-transfer-from-functions>`_

source: Cloning the Example Contract
ru: Клонирование примерного контракта

source: An example ERC-20 for Casper is located in `GitHub <https://github.com/casper-ecosystem/erc20>`_.
ru: Пример ERC-20 для Casper расположен в `GitHub <https://github.com/casper-ecosystem/erc20>`_.

source: Installing the Required Crates
ru: Установка требуемых крейтов

source: This is a Rust contract. In Rust, the keyword ``use`` is like an ``include`` statement in C/C++. Casper contracts require a few crates to be included. They are:
ru: Это контракт Rust. В Rust ключевое слово ``use`` подобно положению ``include`` в языке C/C++. В контракты Casper должны быть включены несколько крейтов. А именно:

source: contract: The Casper contract API for runtime and storage
ru: contract: API контракта Casper для рабочей среды и хранения

source: types: The Casper contract type system
ru: types: типовая система контракта Casper

source: Initializing the Contract
ru: Инициализация контракта

source: When the contract is deployed, it must be initialized with some values; this is done with the help of the ``call()`` function. The contract is initialized with a name, symbol, decimals, starting balances, and the starting token supply.
ru: Когда контракт развернут, он должен быть инициирован с некоторыми значениями; это делается с помощью функции вызова ``call()``. Контракт инициируется с названием, символом, десятичными, стартовыми балансами и стартовым предложением токенов.

source: The ``name``, ``symbol``, and ``decimals`` functions
ru: Функции "название". "символ" и "десятичные"

source: We then also add a few helper functions to set and retrieve values from the contract. Notice that these helper functions reference each of the ``set_key`` definitions when the contract is deployed; a generic ``get_key`` function to retrieve values is also used.
ru: Затем мы также добавляем несколько вспомогательных функций для установки и извлечения значений из контракта. Обратите внимание, что эти вспомогательные функции ссылаются на каждое из определений ``set_key`` при развертывании контракта; также используется общая функция ``get_key`` для извлечения значений.

source: The ``total_supply``, ``balance_of``, and ``allowance`` functions
ru: Функции "общее предложение", "баланс" и " допущения"

source: Let's explore the implementation of some key ERC-20 methods: ``balance_of``, ``total_supply``, and ``allowance``.
ru: Давайте исследуем введение некоторых ключевых методов ERC-20: баланс "balance_of", общее предложение ``total_supply``, и допущения ``allowance``.

source: The ``allowance`` method enables owners to specify an amount that a spender account can spend.
ru: Метод допущений позволяет владельцам специфицировать количество, которое можно тратить с аккаунта трат.

source: The ``transfer`` function
ru: Функция трансфера

source: Here is the ``transfer`` method, which makes it possible to transfer tokens from the ``sender`` address to the ``recipient`` address. If the ``sender`` address has enough balance, then tokens should be transferred to the ``recipient`` address.
ru: А вот здесь метод трансфера "transfer", который позволяет осуществить трансфер токенов с адреса отправителя "spender" на адрес получателя "recipient". Если на балансе "отправителя" достаточно средств, токены должны быть переведены на адрес "получателя".

source: The ``approve`` and ``transfer_from`` functions
ru: Функции "одобрения" и "трансфера от"

source: Here are the functions ``approve`` and ``transfer_from``. ``approve`` is used to allow another address to spend tokens on one's behalf. This is used when multiple keys are authorized to perform deployments from an account.
ru: Здесь представлены функции одобрения ``approve`` и трансфера-от ``transfer_from``. "Одобрение" используется, чтобы разрешить трату токенов с другого адреса от вашего имени. Это применяется. когда авторизованы несколько ключей, чтобы осуществлять развертывания с аккаунта.

source: ``transfer_from`` allows spending an approved amount of tokens.
ru: А "трансфер от" позволяет потратить одобренное вами количество токенов.

source: The ``get_key`` and ``set_key`` functions
ru: Функции ключей ``get_key`` и ``set_key``

source: The ``get_key`` and ``set_key`` functions are generic Casper storage write and read methods. Implement these one time for the contract and then call them as needed.
ru: Функции получения ключа ``get_key`` и настройки ключа ``set_key`` - это основные методы записи и чтения в хранилище Casper. Они вводятся один раз за контракт и могут быть вызваны, когда необходимо.

source: Other Helper Functions
ru: Другие вспомогательные функции

source: The ``balance_key`` and ``allowance_key`` functions format the balances and account information from their internal representation into strings.
ru: Функции баланса ``balance_key`` и ``allowance_key `` форматируют балансы и информацию аккаунта из внутренней репрезентации в вид строки.
