Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/faq/index.po
Languages: ru

source: FAQ
ru: Часто задаваемые вопросы

source: FAQs regarding the Casper network, CasperLabs, and the CSPR token sale.
ru: Вопросы о сети Casper, CasperLabs и продаже токенов CSPR.

source: Casper Network
ru: Сеть Casper

source: What is Casper?
ru: Что такое Casper

source: Casper is an open-source Proof-of-Stake blockchain network built off the CBC (`Correct-by-Construction <https://github.com/cbc-casper/cbc-casper-paper>`_) Casper specification originally established by early Ethereum developers. The Casper network is optimized for enterprise and developer adoption by focusing on unique features like upgradeable contracts, predictable network fees, privacy flexibility, on-chain governance, and developer-friendly languages. Casper solves the scalability trilemma by allowing development teams to build with confidence that the network will optimize for security, decentralization, and high throughput.
ru: Casper - это блокчейн-сеть с открытым исходным кодом, работающая по модели Proof-of-Stake, построенная на базе CBC (`Correct-by-Construction <https://github.com/cbc-casper/cbc-casper-paper>`_). Спецификация Casper, первоначально созданная ранними разработчиками Ethereum. Сеть Casper оптимизирована для внедрения на предприятиях и разработчиками, и фокусируется на уникальных функциях, таких как обновляемые контракты, предсказуемые сетевые сборы, гибкость конфиденциальности, управление по цепочке и удобные для разработчиков языки. Casper решает трилемму масштабируемости, позволяя командам разработчиков с уверенностью утверждать, что сеть будет оптимизирована для обеспечения безопасности, децентрализации и высокой пропускной способности.

source: When is Casper’s mainnet launch?
ru: Когда запуск майннет Casper?

source: Casper’s mainnet launch will occur in Q1 2021.
ru: Запуск майннет Casper произойдет в 1 квартале 2021.

source: How does Casper solve the trilemma of security, decentralization, and scalability?
ru: Как в Casper решается трилемма безопасности, децентрализованности и масштабируемости?

source: As a Proof-of-Stake (PoS) network, Casper relies on a set of validators to uphold the network. PoS validators do not require the same hardware setup as Proof-of-Work networks, allowing validators to be more geographically decentralized and eliminating the centralizing pressures of economies of scale. PoS also enables scalability mechanisms like sharding, a forthcoming feature to allow the network to process multiple transactions simultaneously, improving overall throughput.
ru: Casper, как сеть Proof-of-Stake (PoS), полагается на набор валидаторов, поддерживающих сеть. Валидаторам PoS не требуется то же оборудование, что требуется сетям Proof-of-Stake, что позволяет валидаторам быть географически децентрализованными и нивелирует централизационное давление экономик масштаба. PoS также осуществляет механизмы масштабирования, такие как долевое участие, предстоящее нововведение, которое позволит сети производить множество транзакций одновременно, улучшая общую пропускную способность.

source: What is unique about Casper’s blockchain architecture?
ru: Что уникально в блокчейн-архитектуре Casper?

source: The Highway Protocol is the specific implementation of PoS that supports the Casper network. Highway has two primary benefits over classic Byzantine Fault Tolerant consensus mechanisms. First, Highway enables the network to reach higher thresholds of finality. Second, it achieves flexibility in a way not possible in typical BFT models. `Learn more about Highway <https://blog.casperlabs.io/the-casper-network-highway-consensus-protocol/>`_.
ru: Протокол Highway - это конкретная реализация PoS, которая поддерживает сеть Casper. Highway имеет два основных преимущества по сравнению с классическими отказоустойчивыми механизмами консенсуса типа византийской ошибки. Во-первых, Highway позволяет сети достигать более высоких пороговых значений завершенности. Во-вторых, он обеспечивает гибкость, которая невозможна в типичных моделях BFT. `Узнайте больше о Highway <https://blog.casperlabs.io/the-casper-network-highway-consensus-protocol/>`_.

source: Why is Casper a good fit for enterprises and developers?
ru: Почему Casper - отличное решение для предприятий и разраотчиков?

source: Casper is optimized for enterprise and developers through three main features: upgradeable contracts, developer-friendly languages, and forthcoming predictable network fees.
ru: Casper оптимизирован для предприятий и разработчиков благодаря трем основным функциям: обновляемые контракты, удобные для разработчиков языки и предстоящие предсказуемые сетевые сборы.

source: **Upgradeable Contracts**. Casper enables on-chain smart contracts to be directly upgraded, removing the need for complex and migration processes and making it easier to patch smart contract vulnerabilities.
ru: **Контракты с возможностью обновления**. Casper позволяет напрямую обновлять смарт-контракты по цепочке, устраняя необходимость в сложных процессах миграции и упрощая исправление уязвимостей смарт-контрактов.

source: **Developer-Friendly Languages**. Casper supports developers building with WebAssembly. The network’s development ecosystem is designed to be familiar to existing Web2 developers instead of being written in a proprietary language like Solidity. This provides an easier path for developers and businesses to start building with Casper immediately.
ru: **Языки, удобные для разработчиков**. Каспер поддерживает разработчиков, создающих с помощью WebAssembly. Экосистема разработки сети разработана таким образом, чтобы быть знакомой существующим разработчикам Web2, вместо того, чтобы быть написанной на собственном языке, таком как Solidity. Это обеспечивает более легкий путь для разработчиков и предприятий, чтобы начать сборку проектов с Casper немедленно.

source: **Predictable Network Fees (In Development)**. Casper intends to incentivize active and diverse network behavior by establishing consistent, predictable, and transparent gas costs - eliminating volatility and improving both developer and user experience.
ru: **Предсказуемые сетевые сборы (в стадии разработки)**. Casper намерен стимулировать активное и разнообразное поведение сети путем установления последовательных, предсказуемых и прозрачных затрат на газ - для устранения нестабильности и улучшения работы как разработчиков, так и пользователей.

source: What’s an example of the Casper network in use?
ru: Приведите пример применения сети Casper?

source: IPwe is a global patent registry currently building on the Casper network. CasperLabs and IPwe have partnered to build a chain of custody (CoC) solution for public patent records. The “CoC Solution” will use the Casper public blockchain to store, secure, and trace patent data. `Learn more <https://blog.casperlabs.io/intellectual-property-and-patent-assets-on-casper/>`_.
ru: IPwe - это глобальный реестр патентов, который в настоящее время создается в сети Casper. Casper Labs и IPwe сотрудничают в создании решения цепочки поставок (CoC) для публичных записей патентов. “Решение цепочки поставок” CoC Solution будет использовать публичный блокчейн Casper для хранения, защиты и отслеживания патентных данных. `Узнайте больше <https://blog.casperlabs.io/intellectual-property-and-patent-assets-on-casper/>`_.

source: How can I learn more about the Casper network?
ru: Где я могу узнать больше о сети Casper?

source: Visit the `CasperLabs website <https://casperlabs.io/>`_, `read the blog <https://blog.casperlabs.io/>`_, and `join our community <https://casperlabs.io/community/>`_.
ru: Посетите `веб-сайт CasperLabs <https://casperlabs.io/>`_, `прочтите блог <https://blog.casperlabs.io/>`_, и `присоединитесь к сообществу <https://casperlabs.io/community/>`_.

source: What’s the difference between CasperLabs and Casper?
ru: В чем разница между CasperLabs и Casper?

source: CasperLabs is the development team that is currently building the Casper network. CasperLabs has been developing Casper during its testnet phase and is currently planning for mainnet launch in Q1 2021. As a public, open-source network, Casper can be developed on and by anyone in addition to the CasperLabs team.
ru: CasperLabs -это команда разработчиков, которая в настоящее время создает сеть Casper. CasperLabs разрабатывает Casper на этапе тестирования и в настоящее время планирует запуск майннет в 1 квартале 2021 года. Будучи общедоступной сетью с открытым исходным кодом, Casper может быть разработан кем угодно, в дополнение к команде CasperLabs.

source: What’s the CasperLabs team’s background?
ru: Как узнать более подробную информацию о команде CasperLabs?

source: The engineering, executive, business, and marketing teams of CasperLabs are diverse groups of thinkers and builders with decades of experience in internet-scale computing systems across academia, business, and engineering. `Meet the CasperLabs team <https://casperlabs.io/company/meet-our-team/>`_.
ru: Инженерные, исполнительные, деловые и маркетинговые команды Casper Labs - это разнообразные группы мыслителей и разработчиков с многолетним опытом работы в компьютерных и вычислительных интернет-масштабируемых системах в академических кругах, бизнесе и инженерном деле. `Познакомьтесь с командой CasperLabs <https://casperlabs.io/company/meet-our-team/>`_.

source: What is CasperLabs’ fundraising history?
ru: Какова история фандрайзинга CasperLabs?

source: In September 2019, CasperLabs raised a $14.5 million Series A round led by Terren Piezer with participation from Consensus Capital, Axiom Holdings Group, and Digital Strategies, MW Partners, and more.
ru: В сентябре 2019 года CasperLabs собрали раунд серии A стоимостью 14,5 миллиона долларов под руководством Террена Пейзера с участием Consensus Capital, Axiom Holdings Group и Digital Strategies, MW Partners и многих других.

source: Who has partnered with CasperLabs to build on the Casper network?
ru: Кто был партнером CasperLabs в создании сети Casper?

source: CasperLabs has established a diverse ecosystem of participants who will be building, staking, and validating on Casper from day one, spanning blockchain, enterprise technology, and financial services. Among others, CasperLabs has established relationships with BitGo, Huobi, Ledger Leap, Chainlink, Metis, and Cardinal Cryptography. Companies including IPwe and Broadleaf are already using the Casper Network to unlock new value by tokenizing existing assets.
ru: Casper Labs создали разнообразную экосистему участников, которые с первого дня будут создавать, стейкать и валидировать Casper, охватывая блокчейн, корпоративные технологии и финансовые услуги. Среди прочего, CasperLabs установили отношения с BitGo, Huobi, Ledger Leap, Chainlink, Metis и Cardinal Cryptography. Такие компании, как IPwe и Broadleaf, уже используют сеть Casper для создания новой ценности за счет токенизации существующих активов.

source: To learn more about how to work within the Casper ecosystem, contact neil@casperlabs.io.
ru: Чтобы узнать больше о работе внутри экосистемы Casper, пишите neil@casperlabs.io.

source: CSPR Token
ru: Токены CSPR

source: What is CSPR, and its role in the Casper network?
ru: Что такое CSPR и какова его роль в сети Casper?

source: CSPR is the native token to the Casper network. As a Proof-of-Stake blockchain, Casper relies on CSPR to reward the validators that participate in the PoS consensus mechanism to secure and uphold the network. Casper users also rely on CSPR to pay network fees for on-chain actions. For example, each token transfer costs 0.0001 CSPR (10000 motes) and the amount transferred needs to be 2.5 CSPR or more.
ru: CSPR - это собственный токен для сети Casper. В качестве Proof-of-Stake блокчейна Casper полагается на CSPR для вознаграждения валидаторов, участвующих в механизме PoS консенсуса для обеспечения безопасности и поддержки сети. Пользователи Casper также полагаются на CSPR для оплаты сетевых сборов за действия в сети. Например, каждый перевод токена стоит 0,0001 CSPR (10000 единиц - motes), а сумма перевода должна составлять 2.5 CSPR или более.

source: Where can I find information about CSPR, the supply, the allocation, and the sale?
ru: Где я могу найти информацию о CSPR, поставках, распределении и продаже?

source: The Casper Association has launched its CSPR token sale. Head to `casper.network <https://casper.network/>`_ to learn more.
ru: Ассоциация Casper Association запустила продажи токенов CSPR. Перейдите в `casper.network <https://casper.network/>`_ , чтобы узнать больше.
