Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/sdk/script-sdk.po
Languages: ru

source: The `TypeScript/JavaScript SDK <https://casper-ecosystem.github.io/casper-js-sdk/next>`_ allows developers to interact with the Casper Network using TypeScript or JavaScript. This page covers different examples of using the SDK.
ru: `TypeScript/JavaScript SDK <https://casper-ecosystem.github.io/casper-js-sdk/next>`_ позволяет разработчикам взаимодействовать с сетью Casper, используя TypeScript или JavaScript. Эта страница освещает разные примеры использования SDK.

source: Installation
ru: Установка

source: To install this library using Node.js, run the following command:
ru: Чтобы установить эту библиотеку, используя Node.js, запустите следующую команду:

source: Tests
ru: Тесты

source: You can find basic examples for how to use this library in the ``test`` directory. To run the tests, use this command:
ru: Вы можете найти основные примеры использования этой библиотеки в каталоге ``test`` . Чтобы запустить тесты, используйте следующую команду:

source: Usage Examples
ru: Примеры использования

source: In this section, we outline a couple of essential tasks you can accomplish with the JavaScript SDK:
ru: В этом разделе выделим несколько необходимых задач, которые вы можете выполнить с JavaScript SDK:

source: Generating account keys
ru: Генерация ключей аккаунта

source: Sending a transfer
ru: Отправка трансфера

source: For a complete implementation example, read the `Multi-Signature Tutorial <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/index.html>`_, which uses the JavaScript SDK.
ru: Для изучения полноценного примера внедрения, прочитайте туториал о мультиподписях `Multi-Signature Tutorial <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/index.html>`_, который использует JavaScript SDK.

source: Generating Account Keys
ru: Генерация ключей аккаунта

source: This example shows you how to use the SDK to generate account keys to sign your deploy.
ru: Этот пример показывает, как использовать SDK для генерации ключей аккаунта для подписи вашего развертывания.

source: After generating the keys with this code, you can add them to the `CasperLabs Signer Chrome extension <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce?hl=en-US>`_ and use them to sign your transactions.
ru: После того, как ключи сгенерированы этим кодом, вы можете добавить их в расширение `CasperLabs Signer Chrome extension <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce?hl=en-US>`_ и использовать для подписи ваших транзакций.

source: Sending a Transfer
ru: Отправка трансфера

source: This code block shows you how to define and send a transfer on the Casper Network. Replace the ``account-address`` in the code below with the sender's account address.
ru: Этот блок кода показывает, как определять и отправлять трансфер в сеть Casper. Замените адрес `account-address`` в коде, указанном ниже, адресом аккаунта отправителя.

source: The ``sendTransfer`` function below will return a ``transfer-hash`` which you can check on https://testnet.cspr.live/.
ru: Функция ``sendTransfer`` , указанная ниже, вернет хеш трансфера ``transfer-hash`` , который вы можете проверить в https://testnet.cspr.live/.

source: **Note**: At any moment, you can serialize the deploy from this example to JSON to accomplish whatever you want (store it, send it, etc.).
ru: **Примечание**: в любой момент вы можете сериализовать развертывание из этого примера в JSON, чтобы осуществить с ним любое действие (сохранить, отправить и т.д.).

source: Here is the code you can use to serialize the deploy:
ru: Следующий код вы можете использовать, чтобы сериализовать развертывание:

source: Then, you can reconstruct the deploy object using this function:
ru: Затем вы можете реконструировать объект развертывания с этой функцией:

source: Additional Resources
ru: Дополнительные ресурсы

source: If you are looking for additional examples, another great resource is the `BitGo JS implementation <https://github.com/BitGo/BitGoJS/tree/master/modules/account-lib/src/coin/cspr>`_.
ru: Если мы посмотрим на дополнительные примеры, другой замечательный ресурс - это `BitGo JS implementation <https://github.com/BitGo/BitGoJS/tree/master/modules/account-lib/src/coin/cspr>`_.
