Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/appendix.po
Languages: ru

source: We will discuss how to compute whether two maps of transforms commute in the next section. For now, we assume that run some set of deploys :math:`d_1, d_2, d_3, \ldots` in parallel against a fixed pre-state :math:`G` to obtain a set of transform maps :math:`T_1, T_2, T_3, \ldots`, then select only the transforms that commute :math:`T_i, T_j, T_k, \ldots` to apply to :math:`G`, and thus obtain the post-state :math:`G^\prime`. The remaining deploys we can all run in parallel against :math:`G^\prime`, again choosing the commuting ones to commit, obtaining :math:`G^{\prime\prime}`, and so on. This final post-state is the same as if we had run all the deploys :math:`d_1, d_2, d_3, \ldots` in sequence against :math:`G`, but perhaps faster (depending on how many could commute [#]_) because we were able to run in parallel batches.
ru: И мы обсудим, как вычислить, коммутируют ли две карты преобразований, в следующем разделе. А сейчас мы подытожим запуск некого набора развертываний :math:`d_1, d_2, d_3, \ldots` параллельно в пред-состоянии :math:`G` для осуществления набора карт преобразований :math:`T_1, T_2, T_3, \ldots`, затем выберем только те преобразования, которые коммутируют :math:`T_i, T_j, T_k, \ldots` и применим их в :math:`G`, чем самым выполним пост-состояние :math:`G^\prime`. Оставшиеся развертывания мы можем все запустить параллельно в :math:`G^\prime`, вновь выбирая из них те, что коммутируют, и выполняя :math:`G^{\prime\prime}`, и т.д. и т.п. И это финальное пост-состояние будет такое же, как если бы мы запустили все развертывания :math:`d_1, d_2, d_3, \ldots` в последовательности в :math:`G`, но скорее всего быстрее (в зависимости от того, сколько могут коммутировать [#]_), так как мы могли запустить процессы в параллельных пакетах.

source: Recall that committing transforms is a very fast operation relative to execution, so it causes little overhead. The main overhead would come from executing the same deploy against multiple different starting states because it failed to commute multiple times. This can be mitigated by favoring including more expensive deploys in each committed batch.
ru: Напомним, что фиксация преобразований - это очень быстрая операция по сравнению с выполнением, поэтому она вызывает небольшие накладные расходы. Основные накладные расходы будут связаны с выполнением одного и того же развертывания в нескольких разных начальных состояниях, поскольку оно не выполнялось несколько раз. Это можно смягчить, предпочтя включать более дорогостоящие развертывания в каждую зафиксированную партию-пакет.

source: Detecting when maps of transforms commute
ru: Обнаружение, когда карты преобразований коммутируют

source: Two transform maps ``m_1: Map<Key, Transform>`` and ``m_2: Map<Key,Transform>`` commute if for all keys ``k`` which are present in both maps, the transforms ``t_1 = m_1[k]`` and ``t_2 = m_2[k]`` commute. Notably, if there are no such keys then the maps trivially commute. Two transforms ``t_1:Transform`` and ``t_2: Transform`` commute if:
ru: Две карты преобразований `m_1: Map<Key, Transform>`` и ``m_2: Map<Key,Transform>`` коммутируют для всех ключей ``k``, которые присутствуют в обеих картах, преобразования ``t_1 = m_1[k]`` и ``t_2 = m_2[k]`` коммутируют. Примечательно, что если нет таких ключей, то карты тривиально коммутируют. Два преобразования ``t_1:Transform`` и ``t_2: Transform`` коммутируют если:

source: ``t_1`` and ``t_2`` are both of the same ``Add*`` transform variant (note they do not need to contain the same values within that variant)
ru: ``t_1`` и ``t_2`` оба являются вариативностями преобразования ``Add*`` (но они не обязаны содержать одинаковые значения внутри этой вариативности)

source: where ``Add*`` is a placeholder representing any of the typed native add operations (``AddInt32``, ``AddInt64``, ``AddInt128``, ``AddInt256``, ``AddInt512``, ``AddKeys``). And they do not commute otherwise. A short montra for this is: reads commute, adds commute, writes conflict. Note that writes *always* conflict, even if they are writing the same value. Consider the following example:
ru: где ``Add*`` - это заполнитель, представляющий любую из типизированных собственных операций добавления (``AddInt32``, ``AddInt64``, ``AddInt128``, ``AddInt256``, ``AddInt512``, ``AddKeys``). И они не коммутируют иначе. Короткая мантра для этого такова: чтения - Read - коммутируют, добавления - Add - коммутируют, записи - Write - конфликтуют. Запомните, что записи *всегда* конфликтуют, даже если это записи об одинаковом значении. Обратите внимание на пример:

source: If the pre-state :math:`G` has ``local("x") == 7`` then ``f(G)`` results in the transform ``Write(10)``, and so does ``g(G)``. However, if we compose ``g(f(G))`` then we obtain ``Write(100)``, and if we compose ``f(g(G))`` then the result is ``Write(0)`` and hence the functions do not commute.
ru: В пред-состоянии :math:`G` has ``local("x") == 7`` тогда ``f(G)`` результирует в преобразование ``Write(10)``, и то же самое происходит с ``g(G)``. Если же мы сложим ``g(f(G))`` то мы получим ``Write(100)``, а если сложим ``f(g(G))`` , то результат будет ``Write(0)`` , и таким образом функции не коммутируют.

source: Handling Errors
ru: Работа с ошибками

source: The reason we can say "adds commute" in our rules is because mathematically addition is commutative. However, this relies on the infinite nature of the number line and real computers are finite. For example, if we considered the addition of three 8-bit numbers: 250, 3, and 5, any two of them can be added and they commute, but attempting to add all three results in an overflow error. Thus the final result depends on the order of addition:
ru: Причина, по которой мы можем сказать "добавления коммутируют" в наших правилах, заключается в том, что математически сложение коммутативно. Однако это зависит от бесконечной природы числовой строки, а реальные компьютеры конечны. Например, если мы рассмотрим добавление трех 8-разрядных чисел: 250, 3 и 5, любые два из них могут быть добавлены, и они коммутируют, но попытка добавить все три приводит к ошибке переполнения. Таким образом, конечный результат зависит от порядка сложения:

source: 250 + 3 + 5 = 253 (last addition does not happen due to the error)
ru: 250 + 3 + 5 = 253 (последнее сложение не произошло из-за ошибки)

source: Presently we circumvent this error by actually using modular arithmetic (wrapped addition as it is often called in computer science). Addition in modular arithmetic is still a commutative operation, so our theory holds together. In our example above 250 + 5 + 3 is always equal to 3, no matter what. However in the context of financial applications wrapping back to zero is an unexpected behavior. For this reason we use 512-bit numbers in our mint contract to represent balances, and the total number of token units (motes) available is less than ``U512::MAX``, so overflow is impossible.
ru: В настоящее время мы обходим эту ошибку, фактически используя модульную арифметику (обернутое сложение, как его часто называют в информатике). Сложение в модульной арифметике по-прежнему является коммутативной операцией, поэтому наша теория остается верной. В нашем примере выше 250 + 5 + 3 всегда равно 3, несмотря ни на что. Однако в контексте финансовых приложений возврат к нулю является неожиданным поведением. По этой причине мы используем 512-разрядные числа в нашем контракте выпуска токенов для представления баланса, а общее количество доступных единиц токенов (motes) меньше, чем ``U512::MAX``, поэтому переполнение невозможно.

source: That said, this is not the only error which may arise due to the finite nature of computers. For example, the ``AddKeys`` transform is about adding elements to a map, which is a commutative operation as well (so long as none of the keys already existed in the map, then it is more akin to a write operation). Yet, this operation can also fail due to the physical machine being out of memory, thus once again meaning the order of additions could effect the final state of the map.
ru: Тем не менее, это не единственная ошибка, которая может возникнуть из-за конечной природы компьютеров. Например, преобразование ``AddKeys`` связано с добавлением элементов на карту, что также является коммутативной операцией (пока ни один из ключей еще не существовал на карте, это больше похоже на операцию записи). Тем не менее, эта операция также может завершиться неудачно из-за нехватки памяти у физической машины, что еще раз означает, что порядок добавлений может повлиять на конечное состояние карты.

source: In a more powerful theory of parallel execution we could consider operations which fail. In this case we could say that transforms ``t_1`` and ``t_2`` commute if they are of the same addition type and the outcome of applying both to the input global state, :math:`G` is not an error. This is a more complex rule because it requires doing some amount of computation during commutativity checking, whereas the previous theory was simple comparison. Yet, this theory might be worth pursuing because it solves the two problems we have listed here (overflow and out-of-memory), along with other problems that we presently cannot handle at all. For example, ``Minus`` could be introduced as a transform, and underflows could be handled using this refined commutativity rule. This has practical application in our system because it would mean transfers from the same source could commute if enough funds are available, whereas presently they will always be conservatively labeled as not commuting.
ru: В более мощной теории параллельного выполнения мы могли бы рассмотреть операции, которые завершаются неудачей. В этом случае мы могли бы сказать, что преобразования``t_1`` и ``t_2`` коммутируют, если они имеют один и тот же тип сложения, и результат применения обоих к входному глобальному состоянию :math:`G` не является ошибкой. Это более сложное правило, поскольку оно требует выполнения некоторого объема вычислений во время проверки коммутативности, в то время как предыдущая теория была простым сравнением. Тем не менее, эту теорию, возможно, стоит продолжить, потому что она решает две проблемы, которые мы перечислили здесь (переполнение и нехватка памяти), наряду с другими проблемами, с которыми мы в настоящее время вообще не можем справиться. Например, "Минус" может быть введен в качестве преобразования, а переполнения могут обрабатываться с использованием этого уточненного правила коммутативности. Это имеет практическое применение в нашей системе, поскольку это означало бы, что переводы из одного и того же источника могут осуществляться при наличии достаточного количества средств, в то время как в настоящее время они всегда будут консервативно помечены как не коммутирующие.
