Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/block-structure.po
Languages: ru

source: Block Structure
ru: Структура блока

source: Introduction
ru: Введение

source: A *block* is the primary data structure by which network nodes communicate information about the state of the Casper Network. We briefly describe here the format of this data structure.
ru: *Блок* - это первичная информационная структура, с помощью которой ноды передают информацию о состоянии сети Casper. Мы кратко опишем здесь формат информационной структуры.

source: Data fields
ru: Информационные поля

source: A block consists of the following:
ru: Блок состоит из:

source: a ``block_hash``
ru: хеш блока ``block_hash``

source: a header
ru: заголовок

source: a body
ru: тело

source: Each of these fields is detailed in the subsequent sections.
ru: Каждое из этих полей описано в последующих разделах.

source: ``block_hash``
ru: Хеш блока ``block_hash``

source: The ``block_hash`` is the ``blake2b256`` hash of the header.
ru: Хеш блока ``block_hash`` является хешем заголовка ``blake2b256``

source: Header
ru: Заголовок

source: The block header contains the following fields:
ru: Заголовок блока содержит следующие поля:

source: ``parent_hashes``
ru: Родительский хеш ``parent_hashes``

source: a list of ``block_hash``\ es giving the parents of the block
ru: Список хешей блока или блоков ``block_hash`` предоставляющий родителей блока

source: justifications
ru: обоснования

source: a list of ``block_hash``\ es giving the justifications of the block (see consensus description in part A for more details)
ru: Список хешей блока или блоков ``block_hash`` предоставляющий обоснования блока (смотрите описание консенсуса в части A для более подробной информации)

source: a summary of the global state, including
ru: итог глобального состояния, включая

source: the :ref:`root hash of the global state trie <global-state-trie>` before executing the deploys in this block (``pre_state_hash``)
ru: корневой хеш :ref:`root hash структуры глобального состояния <global-state-trie>` до выполнения развертываний в этом блоке (хеш пред-состояния ``pre_state_hash``)

source: the root hash of the global state trie after executing the deploys in this block (``post_state_hash``)
ru: корневой хеш структуры глобального состояния после исполнения развертываний в этом блоке (хеш пост-состояния ``post_state_hash``)

source: the list of currently bonded validators, and their stakes
ru: Список текущих связанных валидаторов и их стейки

source: the ``blake2b256`` hash of the body of the block
ru: Хеш тела блока ``blake2b256``

source: the time the block was created
ru: Время, когда был создан блок

source: the protocol version the block was executed with
ru: Версия протокола, при которой исполнялся блок

source: the number of deploys in the block
ru: Количество развертываний в блоке

source: the human-readable name corresponding to this instance of the Casper Network (``chain_id``)
ru: Человекочитаемое имя в соответствии с этим экземпляром сети Casper (``chain_id``)

source: an indicator for whether this message is intended as a valid block or merely a *ballot* (see consensus description in part A for more details)
ru: Индикатор, показывающий является ли сообщение валидным блоком или это *бюллетень* (см. описание консенсуса в части A)

source: Body
ru: Тело

source: The block body contains an **ordered** list of ``DeployHashes`` which refer to deploys, and an **ordered** list of ``DeployHashes`` for native transfers (which are specialized deploys that only transfer token between accounts). All deploys, including a specialization such as native transfer, can be broadly categorized as some unit of work that, when executed and committed, affect change to global state :ref:`Global State<global-state-intro>`. It should be noted that a valid block may contain no deploys and / or native transfers.
ru: Тело блока содержит **нумерованный** список хешей развертываний ``DeployHashes``, которые ссылаются на развертывания и **нумерованный** список хешей ``DeployHashes`` для нативных трансферов (которые являются специализированными развертываниями, которые передают токены между аккаунтами). Все развертывания, включая специальные типа нативных трансферов, могут быть широко категоризированы как некие юниты работы, которые - когда исполнены и зафиксированы - вносят изменения в глобальное состояние :ref:`Global State<global-state-intro>`. Нужно отметить, что валидный блок может не содержать развертываний и/или нативных трансферов.

source: The block body also contains the public key of the validator that proposed the block.
ru: Тело блока также содержит публичный ключ валидатора, который выдвинул этот блок.

source: Refer to the :ref:`Deploy Serialization Standard <serialization-standard-deploy>` for additional information on deploys and how they are serialized. Refer to :ref:`Block Serialization Standard <serialization-standard-block>` for how blocks are serialized.
ru: Обратитесь к стандартам сериализации развертываний :ref:`Deploy Serialization Standard <serialization-standard-deploy>` за дополнительной информацией о развертываниях и как они сериализуются. Обратитесь к стандартам сериализации блоков :ref:`Block Serialization Standard <serialization-standard-block>` за информацией о том, как сериализуются блоки.
