Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/p2p.po
Languages: ru

source: Network Communication
ru: Коммуникация в сети

source: Nodes form a peer-to-peer network are continually communicating with each other to reach *consensus* about the blockchain state. A node is not necessarily a single physical machine. Still, it appears as a single logical entity to the rest of its peers by having a unique ID and address where it responds to incoming network traffic.
ru: Ноды, образующие одноранговую(peer-to-peer) сеть, постоянно взаимодействуют друг с другом, чтобы достичь *консенсуса* о состоянии блокчейна. Нода не обязательно является одной физической машиной. Тем не менее, она выглядит как единый логический объект для остальных своих одноранговых нод, имея уникальный идентификатор и адрес, по которому она реагирует на входящий сетевой трафик.

source: Identity
ru: Идентичность

source: Each node has an identity on the network (which is not the same as its identity in the consensus process). The network identity (ID) is based on the fingerprint of the public key of a self-signed TLS certificate. A node generates a new private key each time it starts, ensuring a unique ID.
ru: У каждой ноды есть своя идентичность в сети (которая не тождественна идентичности в процессе консенсуса). Сетевая идентичность (ID) основана на отпечатке пальца публичного ключа самоподписанного сертификата TLS. Нода генерирует новый приватный ключ каждый раз при запуске, что гарантирует уникальность ID.

source: Each identity is linked with an address, which is an IP and port pair where the node is reachable. This address is also called an endpoint.
ru: Каждая идентичность связана с адресом, который является IP и порт-пара, где нода доступна. Этот адрес также называется конечной точкой.

source: Inter-node connections
ru: Связи между нодами

source: Should a node want to connect to another node with a known endpoint, it opens a TLS connection to the endpoint's address. In the context of common TLS terminology, this makes the connecting node the *client* and the remote node the *server* for this connection.
ru: Если нода хочет связаться с другой нодой с известной конечной точкой, она открывает связь TLS с адресом конечной точки. В контексте известной TLS терминологии, это делает связывающуюся ноду *клиентом* а удаленную ноду *сервером* для этой связи.

source: During connection setup, the client checks the server's certificate, matching the endpoint's expected public identity to ensure we have connected to the right node. Additionally, the TLS parameters of the connection and certificate are required to contain the same ciphers, digests, etc., to protect against downgrade attacks.
ru: Во время настройки подключения клиент проверяет сертификат сервера, соответствующий ожидаемой общедоступной идентификации конечных точек, чтобы убедиться, что мы подключились к нужной ноде. Кроме того, параметры TLS подключения и сертификата должны содержать одинаковые шифры, дайджесты и т.д. для защиты от атак с понижением уровня.

source: Simultaneously, the connecting node sends its certificate as the client certificate, allowing the server to perform the same check-in reverse and establish the client's ID. At the end of the process, both nodes can be sure to which peer they are connected.
ru: Одновременно соединительная нода отправляет свой сертификат в качестве сертификата клиента, позволяя серверу выполнить ту же обратную проверку и установить идентификатор - ID - клиента. В конце процесса обе ноды могут быть уверены, к какому узлу- пиру- они подключены.

source: Once a connection is established, the server will immediately seek to connect back to a node based on its endpoint (see `Node Discovery`_ on how the server finds endpoints) if it is a one-way connection. If a bidirectional connection setup cannot be established within a certain amount of time, all peer ID connections are dropped.
ru: Как только соединение установлено, сервер немедленно попытается подключиться обратно к ноде на основе ее конечной точки (см. Обнаружение нод `Node Discovery`_ о том, как сервер находит конечные точки), если это одностороннее соединение. Если настройка двунаправленного соединения не может быть установлена в течение определенного промежутка времени, все одноранговые соединения с ID удаляются.

source: Connections are used for sending messages one-way only; only the node initiating a connection will send messages on it.
ru: Соединения используются для односторонней отправки сообщений; отправляет их только нода, инициировавшая соединение.

source: Network
ru: Сеть

source: As soon as a node has connected to one node in the network, it partakes in `Node Discovery`_. In general, any node will attempt to connect to any other node on the network it finds as described above, leading to a fully connected network.
ru: Как только нода подключается к одной ноде в сети, она участвует в Обнаружении узла `Node Discovery`_. В общем случае любая нода, которая пытается подключиться к любой другой ноде в сети, которую она обнаружит, как описано выше, приведет к полностью подключенной сети.

source: Two classes of data transfers happen in the network; broadcasts and gossiping. A broadcast message is sent once, without guarantees, to all the nodes connected to it. The process of gossiping is described further below.
ru: В сети происходят два класса передачи данных: трансляции и госсипинг. Трансляционное сообщение отправляется один раз, без гарантий, всем нодам, подключенным к нему. Процесс госсипинга описан далее ниже.

source: In general, only consensus messages, which are only sent by active validators, are broadcast. Everything else is gossipped.
ru: В целом, только сообщения консенсуса, которые посылаются активными валидаторами, являются трансляционными. Все остальные относятся к госсипингу.

source: Gossiping
ru: Госсипинг

source: Multiple types of objects are gossipped, the most prominent ones being blocks, deploys, and endpoints (see `Identity`_). Each of these objects is immutable and can be identified by a unique hash.
ru: Госсипинг охватывает несколько типов объектов, наиболее заметными из которых являются блоки, развертывания и конечные точки (см. об идентификации `Identity`_). Каждый из этих объектов является неизменяемым и может быть идентифицирован с помощью уникального хеша.

source: Gossiping is a process of distributing a value across the entire network without directly sending it to each node. This process allows only a subset of nodes to be connected to the original sender and spreading the bandwidth and processing requirements across the network at the cost of latency and overall bandwidth consumed.
ru: Госсипинг - это процесс распространения значения по всей сети без прямой отправки его каждой ноде. Этот процесс позволяет подключать только подмножество нод к исходному отправителю и распределять пропускную способность и требования к обработке по сети за счет задержки и общей потребляемой пропускной способности.

source: The process can be summarized as follows:
ru: Процесс может быть описан следующим образом:

source: Given a message `M` to gossip, the desired saturation `S`, and an infection limit `L`:
ru: Допустим мы запускаем сообщение `M` с желаемым разрешением `S`, и инфекционным ограничением `L`:

source: Pick a subset `T` of `k` nodes from all currently connected nodes.
ru: Берем подмножество `T` из нод `k` от всех соединенных в данный момент нод .

source: Send `M` to each node in `T`, noting which nodes were already infected (a node is considered infected if it already had received or known `M`).
ru: Отправляем `M` каждой ноде в `T`, отмечая какие ноды уже инфицированы (нода считается инфицированной, если она уже получила или знает о `M`).

source: For every node shown as already infected, add another random node outside to `T` and send it `M`, again noting the response.
ru: Для каждой ноды, которая отображается как уже инфицированная, добавляем другую случайную ноду вне `T` и отправляем ей `M`, снова подмечая ответ.

source: End when we confirm infection of `L` new nodes or encountered `S` already infected nodes.
ru: Наконец когда мы подтверждаем инфицирование `L` новых нод или засчитываем `S` уже инфицированные ноды.

source: Through this process, a message will spread to almost all nodes over time.
ru: Через этот процесс сообщение распространится почти всем нодам в этом времени.

source: Requesting missing data
ru: Запрос недостающей информации

source: While gossiping and broadcasting are sufficient to distribute data across the network in most cases, nodes can also request missing data from peers should they require it. A common example is a missing deploy from a block.
ru: В то время как распространения сообщений - госсипинга и широковещания - бродкастинга - в большинстве случаев достаточно для распространения данных по сети, ноды также могут запрашивать недостающие данные у одноранговых нод, если им это потребуется. Распространенным примером является отсутствующее развертывание из блока.

source: Validation
ru: Валидация

source: Objects have a concept of dependencies. For example, a block depends on all the deploys whose hashes are listed inside it. A node considers any object valid if all of its dependencies are available on the local node.
ru: У объектов есть концепция зависимостей. Например блок зависит от всех развертываний, хеш которых размещен внутри него. Нода считает любой объект валидным если все его зависимости доступны в локальной ноде.

source: Should a node receive an object from a peer that is not valid yet, it will attempt to complete its validation before processing it further. In the case of gossiping, this means pausing the gossiping of the object until all its dependencies can be retrieved.
ru: Если нода получила объект из пира, который еще не валидный, она будет пытаться завершить его валидацию перед тем, как передать объект далее. В случае госсипинга это означает остановку госсипинга этого объекта до тех пор, пока все его зависимости не будут восстановлены.

source: Any node is responsible for only propagating valid objects. Should a node not retrieve all missing dependencies of an object from the peer that sent it, it may punish the peer for doing so.
ru: Любая нода ответственна за продвижение валидных объектов. Если нода не извлекает все отсутствующие зависимости объекта от отправившего его однорангового узла, она может наказать одноранговый узел за это.

source: Node Discovery
ru: Обнаружение нод

source: Node discovery happens by each node periodically gossiping its public address. Upon receiving an address via gossip, each node immediately tries to establish a connection to it and notes the resulting endpoint, if successful.
ru: Обнаружение нод происходит периодически с каждой нодой, которая передает свой публичный адрес. Получив адрес через госсипинг, каждая нода немедленно пытается установить с ней соединение и отмечает полученную конечную точку, в случае успеха.
