Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: ru

source: Serialization Standard
ru: Стандарты сериализации

source: We provide a custom implementation to serialize data structures used by the Casper node to their byte representation. This document details how this custom serialization is implemented, allowing developers to build a library that implements the custom serialization.
ru: Мы предоставляем кастомизированную реализацию для сериализации структур данных, используемых нодой Casper, в их байтовую репрезентацию. В этом документе подробно описано, как реализуется эта пользовательская сериализация, что позволяет разработчикам собрать библиотеку, реализующую пользовательскую сериализацию.

source: Block
ru: Блок

source: A block is the core component of the Casper linear blockchain, used in two contexts:
ru: Блок - это основной компонент блокчейн Casper, используемый в двух контекстах:

source: A data structure containing a collection of transactions. Blocks form the primary structure of the blockchain.
ru: Информационная структура, содержащая транзакции. Блоки из первичной структуры блокчейн.

source: A message that is exchanged between nodes containing the data structure as explained in (1).
ru: Сообщения, которые передаются от ноды к ноде, содержащие в себе информационную структуру, как описано в (1).

source: Each block has a globally unique ID, achieved by hashing the contents of the block.
ru: У каждого блока есть глобальный уникальный ID, который формируется хешированием содержания блока.

source: Each block points to its parent. An exception is the first block, which has no parent.
ru: Каждый блок указывает на своего родителя. Исключение - первый блок, у которого нет родителя.

source: A block is structurally defined as follows:
ru: Структурно блок определяется следующим образом:

source: ``hash``: A hash over the header of the block.
ru: хеш ``hash``: хеш заголовка блока

source: ``header``: The header of the block that contains information about the contents of the block with additional metadata.
ru: заголовок ``header``: заголовок блока, который содержит информацию о содержании блока с дополнительной метаинформацией.

source: ``body``: The block's body contains the proposer of the block and hashes of deploys and transfers contained within it.
ru: тело ``body``: тело блока содержит информацию о том, кто его выдвинул, и хеш развертываний и трансферов, содержащихся в нем.

source: Block hash
ru: Хеш блока

source: The block hash is a ``Digest`` over the contents of the block Header. The ``BlockHash`` serializes as the byte representation of the hash itself.
ru: Хеш блока это своего рода антология ``Digest`` всего содержимого заголовка блока. Хеш блока ``BlockHash`` сериализуется как бит-репрезентация самого хеша.

source: Block header
ru: Заголовок блока

source: The header portion of a block, structurally, is defined as follows:
ru: Часть блока, именуемая заголовком, структурно описывается так:

source: ``parent_hash``: is the hash of the parent block. It serializes to the byte representation of the parent hash. The serialized buffer of the ``parent_hash`` is 32 bytes long.
ru: родительский хеш ``parent_hash``: хеш родительского блока. Он сериализуется в бит-репрезентацию родительского хеша. Сериализованный буфер родительского хеша ``parent_hash`` равен 32 бит.

source: ``state_root_hash``: is the global state root hash produced by executing this block's body. It serializes to the byte representation of the ``state root hash``. The serialized buffer of the ``state_root_hash`` is 32 bytes long.
ru: корневой хеш состояния ``state_root_hash``: корневой хеш глобального состояния, произведенный при выполнении тела блока. Он сериализуется в бит-репрезентацию корневого хеша состояния ``state root hash``. Сериализованный буфер корневого хеша состояния равен 32 бит.

source: ``body_hash``: the hash of the block body. It serializes to the byte representation of the body hash. The serialized buffer of the ``body_hash`` is 32 bytes long.
ru: хеш тела ``body_hash``: хеш тела блока. Он сериализуется в бит-репрезентацию хеша тела. Сериализованный буфер хеша тела блока равен 32 бит.

source: ``random_bit``: is a boolean needed for initializing a future era. It is serialized as a single byte; true maps to 1, while false maps to 0.
ru: случайный бит ``random_bit``:` это логическое значение, необходимое для инициализации будущей эры. Он сериализуется как один бит; значение true соответствует 1, а значение false - 0.

source: ``accumulated_seed``: A seed needed for initializing a future era. It serializes to the byte representation of the parent Hash. The serialized buffer of the ``accumulated_hash`` is 32 bytes long.
ru: аккумулированное семя "accumulated_seed": семя, необходимое для инициализации будущей эры. Оно сериализуется в бит-репрезентацию родительского хэша. Сериализованный буфер "accumulated_hash" имеет длину 32 бита.

source: ``era_end``: contains equivocation and reward information to be included in the terminal finalized block. It is an optional field. Thus if the field is set as ``None``, it serializes to `0`. The serialization of the other case is described in the :ref:`EraEnd<serialization-standard-era-end>` .
ru: конец эры ``era_end``: содержит неопределенность и информацию о вознаграждениях, которая будет включена в терминальный завершенный блок. Это опциональное поле. Так, если поле настроено как ``None``, оно сериализуется в `0`. Другие случаи сериализации описаны тут :ref:`EraEnd <serialization-standard-era-end>` .

source: ``timestamp``: The timestamp from when the block was proposed. It serializes as a single ``u64`` value. The serialization of a ``u64`` value is described in in the :ref:`CLValues<serialization-standard-values>` section.
ru: временной отпечаток ``timestamp``: временной отпечаток момента, когда блок был выдвинут. Он сериализуется в единое значение ``u64`` . Сериализация значения ``u64`` описана в разделе :ref:`CLValues<serialization-standard-values>`

source: ``era_id``: Era ID in which this block was created. It serializes as a single ``u64`` value.
ru: идентификатор эры ``era_id``: ID эры, в которой этот блок был создан. Он сериализуется в единое значение ``u64``.

source: ``height``: The height of this block, i.e., the number of ancestors. It serializes as a single ``u64`` value.
ru: высота ``height``: высота этого блока, т.е. количество предшественников. Он сериализуется в единое значение ``u64``.

source: ``protocol_version``: The version of the Casper network when this block was proposed. It is 3-element tuple containing ``u32`` values. It serializes as a buffer containing the three ``u32`` serialized values. Refer to the :ref:`CLValues<serialization-standard-values>` section on how ``u32`` values are serialized.
ru: версия протокола ``protocol_version``: версия сети Casper, когда этот блок был выдвинут. Это кортеж из 3 элементов, содержащий значения "u32". Он сериализуется как буфер, содержащий три сериализованных значения "u32". Обратитесь к разделу :ref:`CLValues<serialization-standard-values>` о том, как сериализуются значения "u32".

source: EraEnd
ru: Конец эры - EraEnd

source: ``EraEnd`` as represented within the block header, is a struct containing two fields.
ru: ``EraEnd`` конец эры представлен в заголовке блока, это структура, содержащая два поля.

source: ``era_report``: The first field is termed as ``EraReport`` and contains information about equivocators and rewards for an era.
ru: сообщение об эре ``era_report``: это поле названо ``EraReport`` и содержит информацию о неопределенностях и вознаграждениях за эру.

source: ``next_era_validator_weights``: The second field is map for the validators and their weights for the era to follow.
ru: вес валидатора следующей эры ``next_era_validator_weights``: второе поле - это карта для валидаторов и их вес для эры, для справки и следования.

source: ``EraReport`` itself contains two fields:
ru: ``EraReport`` содержит два поля:

source: ``equivocators``: A vector of ``PublicKey``.
ru: ``equivocators``: как вектор ``PublicKey``.

source: ``rewards``: A Binary Tree Map of ``PublicKey`` and ``u64``.
ru: ``rewards``: бинарная карта-древо ``PublicKey`` и ``u64``.

source: When serializing an EraReport, the buffer is first filled with the individual serialization of the PublicKey contained within the vector.
ru: Когда сериализуется EraReport, буфер сначала заполняется индивидуальной сериализацией публичного ключа PublicKey, которая содержится в векторе.

source: If the ``PublicKey`` is an ``Ed25519`` key, the first byte within the buffer is a ``1`` followed by the individual bytes of the serialized key.
ru: Если ключ ``PublicKey`` -это ``Ed25519``, то первый бит в буфере это "1", за ним следуют индивидуальные биты сериализованного ключа.

source: If the ``PublicKey`` is an ``Secp256k1`` key, the first byte within the buffer is a ``2`` followed by the individual bytes of the serialized key.
ru: Если ключ ``PublicKey`` - это `Secp256k1``, первый бит в буфере будет "2", за ним следуют индивидуальные биты сериализованного ключа.

source: When serializing the overarching struct of ``EraEnd``, we first allocate a buffer, which contains the serialized representation of the ``EraReport`` as described above, followed by the serialized BTreeMap.
ru: Когда сериализуется всеобъемлющая структура ``EraEnd``, мы сначала мы сначала выделяем буфер, который содержит сериализованное представление "EraReport", как описано выше, а затем сериализованную карту BTreeMap.

source: Note that ``EraEnd`` is an optional field. Thus the above scheme only applies if there is an ``EraEnd``; if there is no era end, the field simply serializes to `0`.
ru: Обратите внимание, что ``EraEnd`` - это опциональное поле. Так вышеприведенная схема только уместна, когда есть ``EraEnd``; если же конца эры нет, то поле просто сериализуется в `0`.

source: Body
ru: Тело

source: The body portion of the block is structurally defined as:
ru: Часть блока, именуемая телом, структурно описывается как:

source: ``proposer``: The PublicKey which proposed this block.
ru: предлагающий ``proposer``: публичный ключ, который выдвинул этот блок.

source: ``deploy_hashes``: Is a vector of hex-encoded hashes identifying Deploys included in this block.
ru: хеш развертываний ``deploy_hashes``: это векторные 16-разрядные хеши, идентифицирующие развертывания, включенные в данный блок.

source: ``transfer_hashes``: Is a vector of hex-encoded hashes identifying Transfers included in this block.
ru: хеш трансферов ``transfer_hashes``: это векторные 16-разрядные хеши, идентифицирующие переводы, включенные в данный блок.

source: When we serialize the ``BlockBody``, we create a buffer that contains the serialized representations of the individual fields present within the block.
ru: Когда мы сериализуем тело блока "BlockBody", мы создаем буфер, который содержит сериализованные репрезентации индивидуальных полей, существующих внутри блока.

source: ``proposer``: serializes to the byte representation of the ``PublicKey``. If the ``PublicKey`` is an ``Ed25519`` key, then the first byte within the serialized buffer is 1 followed by the bytes of the key itself; else, in the case of ``Secp256k1``, the first byte is 2.
ru: предлагающий ``proposer``: сериализует в бит-репрезентацию публичного ключа "PublicKey". Если публичный ключ - ``Ed25519``, то первый бит внутри сериализованного буфера - 1, а за ним следуют биты самого ключа; также в случае ``Secp256k1`` - первый бит равняется 2.

source: ``deploy_hashes``: serializes to the byte representation of all the deploy_hashes within the block header. Its length is ``32 * n``, where n denotes the number of deploy hashes present within the body.
ru: хеш развертываний ``deploy_hashes``: сериализует в бит-репрезентацию все хеши развертываний внутри заголовка блока. Его длина ``32 * n``, где n означает количество хешей развертываний, присутствующих в теле блока.

source: ``transfer_hashes``: serializes to the byte representation of all the deploy_hashes within the block header. Its length is ``32 * n``, where n denotes the number of transfers present within the body.
ru: хеш переводов ``transfer_hashes``: сериализует в бит-репрезентацию все хеши развертываний внутри заголовка блока. Его длина ``32 * n``, где n означает количество переводов - трансферов, присутствующих в теле блока.

source: Deploy
ru: Развертывание

source: A deploy is a data structure containing a smart contract and the requester's signature(s). Additionally, the deploy header contains additional metadata about the deploy itself. A deploy is structurally defined as follows:
ru: Развертывание - это информационная структура, содержащая смарт-контракт и подпись(и) заказчика. Кроме того, заголовок развертывания содержит дополнительную метаинформацию о развертывании. Развертывание можно структурно описать следующим образом:

source: ``hash``: The hash of the deploy header.
ru: хеш ``hash``: хеш заголовка развертывания

source: ``header``: Contains metadata about the deploy. The structure of the header is detailed further in this document.
ru: заголовок ``header``: содержит метаданные о развертывании. Структура заголовка более детально описана далее.

source: ``payment``: The payment code for contained smart contract.
ru: платеж ``payment``: код платежа для вложенного смарт-контракта.

source: ``session``: The stored contract itself.
ru: сессия ``session``: сам вложенный контракт

source: ``approvals``: A list of signatures:
ru: подтверждения ``approvals``: список подписей:

source: Deploy-Hash
ru: Хеш развертывания

source: The deploy hash is a digest over the contents of the deploy header. The deploy hash serializes as the byte representation of the hash itself.
ru: Хэш развертывания представляет собой дайджест содержимого заголовка развертывания. Хэш развертывания сериализуется как битовое представление самого хэша.

source: Deploy-Header
ru: Заголовок развертывания

source: ``account``: A supported public key variant (currently either ``Ed25519`` or ``Secp256k1``). An ``Ed25519`` key is serialized as a buffer of bytes, with the leading byte being ``1`` for ``Ed25519``, with remainder of the buffer containing the byte representation of the signature. Correspondingly, a ``Secp256k1`` key is serialized as a buffer of bytes, with the leading byte being ``2``.
ru: аккаунт ``account``: поддерживаемый вариант публичного ключа (сейчас либо ``Ed25519`` либо ``Secp256k1``). Ключ ``Ed25519`` сериализуется в буфер битов с ведущим битом "1" для ``Ed25519``, с напоминанием буфера в виде битовой репрезентации подписи. Соответственно, ключ ``Secp256k1`` сериализуется как буфер бит с ведущим битом "2".

source: ``timestamp``: A timestamp is a struct that is a unary tuple containing a ``u64`` value. This value is a count of the milliseconds since the UNIX epoch. Thus the value ``1603994401469`` serializes as ``0xbd3a847575010000``
ru: временной отпечаток ``timestamp``: метка времени - это структура, представляющая собой унарный кортеж, содержащий значение "u64". Это значение представляет собой количество миллисекунд, прошедших с эпохи UNIX. Таким образом, значение "1603994401469" сериализуется как "0xbd3a847575010000".

source: ``ttl``: The **Time to live** is defined as the amount of time for which deploy is considered valid. The ``ttl`` serializes in the same manner as the timestamp.
ru: ``ttl``: Time to live - **Время жизни** определяется как количество времени, в течение которого развертывание считается валидным. "ttl" сериализуется так же, как метка времени.

source: ``gas_price``: The gas is ``u64`` value which is serialized as ``u64`` CLValue discussed below.
ru: цена на газ ``gas_price``: газ является значением ``u64``, которое сериализуется как значение ``u64`` CLValue - о чем более детально рассказано ниже.

source: ``body_hash``: Body hash is a hash over the contents of the deploy body, which includes the payment, session, and approval fields. Its serialization is the byte representation of the hash itself.
ru: хеш тела ``body_hash``: Хеш тела - это хеш над содержимым тела развертывания, которое включает поля оплаты, сеанса и утверждения. Его сериализация -это битовое представление самого хэша.

source: ``dependencies``: Dependencies is a vector of deploy hashes referencing deploys that must execute before the current deploy can be executed. It serializes as a buffer containing the individual serialization of each DeployHash within the Vector.
ru: зависимости ``dependencies``: Зависимости - это вектор хешей развертывания, ссылающихся на развертывания, которые должны быть выполнены до выполнения текущего развертывания. Он сериализуется в виде буфера, содержащего индивидуальную сериализацию каждого хеша развертывания в векторе.

source: ``chain_name``: Chain name is a human-readable string describing the name of the chain as detailed in the chainspec. It is serialized as a String CLValue described below.
ru: имя цепочки ``chain_name``: Имя цепочки - это человекочитаемая строка, описывающая имя цепочки, как описано в спецификации цепочки chainspec. Оно сериализуется как значение строки String CLValue , описанное ниже.

source: Payment & Session
ru: Платеж & Сессия

source: Payment and Session are both defined as ``ExecutableDeployItems``. ``ExecutableDeployItems`` is an enum described as follows:
ru: Платеж и Сессия считаются выполнимыми единицами развертывания ``ExecutableDeployItems``. ``ExecutableDeployItems`` можно описать так:

source: Module Bytes are serialized such that the first byte within the serialized buffer is ``0`` with the rest of the buffer containing the bytes present.
ru: Байты модуля сериализуются таким образом, что первый байт в сериализованном буфере равен "0", а остальная часть буфера содержит присутствующие байты.

source: ``ModuleBytes { module_bytes: "[72 bytes]", args: 434705a38470ec2b008bb693426f47f330802f3bd63588ee275e943407649d3bab1898897ab0400d7fa09fe02ab7b7e8ea443d28069ca557e206916515a7e21d15e5be5eb46235f5 }`` will serialize to
ru: ``ModuleBytes { module_bytes: "[72 bytes]", args: 434705a38470ec2b008bb693426f47f330802f3bd63588ee275e943407649d3bab1898897ab0400d7fa09fe02ab7b7e8ea443d28069ca557e206916515a7e21d15e5be5eb46235f5 }`` сериализуются в

source: StoredContractByHash serializes such that the first byte within the serialized buffer is 1u8. This is followed by the byte representation of the remaining fields.
ru: StoredContractByHash сериализуется таким образом, что первый байт внутри сериализованного буфера равен 1u8. Из этого следует байтовая репрезентация остающися полей.

source: ``StoredContractByHash { hash: c4c411864f7b717c27839e56f6f1ebe5da3f35ec0043f437324325d65a22afa4, entry_point: "pclphXwfYmCmdITj8hnh", args: d8b59728274edd2334ea328b3292ed15eaf9134f9a00dce31a87d9050570fb0267a4002c85f3a8384d2502733b2e46f44981df85fed5e4854200bbca313e3bca8d888a84a76a1c5b1b3d236a12401a2999d3cad003c9b9d98c92ab1850 }``
ru: ``StoredContractByHash { хеш hash: c4c411864f7b717c27839e56f6f1ebe5da3f35ec0043f437324325d65a22afa4, точка входа entry_point: "pclphXwfYmCmdITj8hnh", вводные args: d8b59728274edd2334ea328b3292ed15eaf9134f9a00dce31a87d9050570fb0267a4002c85f3a8384d2502733b2e46f44981df85fed5e4854200bbca313e3bca8d888a84a76a1c5b1b3d236a12401a2999d3cad003c9b9d98c92ab1850 }``

source: StoredContractByName serializes such that the first byte within the serialized buffer is 2u8. This is followed by the individual byte representation of the remaining fields.
ru: StoredContractByName сериализуется таким образом, что первый байт внутри сериализованного буфера равен 2u8. Из этого следует байтовая репрезентация остающися полей.

source: ``StoredContractByName { name: "U5A74bSZH8abT8HqVaK9", entry_point: "gIetSxltnRDvMhWdxTqQ", args: 07beadc3da884faa17454a }``
ru: ``StoredContractByName { имя name: "U5A74bSZH8abT8HqVaK9", точка входа entry_point: "gIetSxltnRDvMhWdxTqQ", вводные args: 07beadc3da884faa17454a }``

source: StoredVersionedContractByHash serializes such that the first byte within the serialized buffer is 3u8. However, the field version within the enum serializes as an Option CLValue, i.e., if the value is None as shown in the example, it serializes to 0, else it serializes the inner u32 value, which is described below.
ru: StoredVersionedContractByHash сериализуется таким образом, что первый байт внутр сериализованного буфера равен 3u8. Таким образом версия поля в этом enum модуле сериализуется как значение Option CLValue, т.е. если значение - None, как показано в примере, оно сериализуется в 0, или оно сериализуется во внутреннее значение u32, что описано ниже.

source: ``StoredVersionedContractByHash { hash: b348fdd0d0b3f66468687df93141b5924f6bb957d5893c08b60d5a78d0b9a423, version: None, entry_point: "PsLz5c7JsqT8BK8ll0kF", args: 3d0d7f193f70740386cb78b383e2e30c4f976cf3fa834bafbda4ed9dbfeb52ce1777817e8ed8868cfac6462b7cd31028aa5a7a60066db35371a2f8 }``
ru: ``StoredVersionedContractByHash { хеш hash: b348fdd0d0b3f66468687df93141b5924f6bb957d5893c08b60d5a78d0b9a423, версия version: None, точка входа entry_point: "PsLz5c7JsqT8BK8ll0kF", вводные args: 3d0d7f193f70740386cb78b383e2e30c4f976cf3fa834bafbda4ed9dbfeb52ce1777817e8ed8868cfac6462b7cd31028aa5a7a60066db35371a2f8 }``

source: StoredVersionedContractByName serializes such that the first byte within the serialized buffer is 4u8. The name and entry_point are serialized as a String CLValue, with the Option version field serializing to 0 if the value is None; else, it serializes the inner u32 value as described below.
ru: StoredVersionedContractByName сериализуется таким образом, что первый байт внутри сериализованного буфера равен 4u8. Имя и точка входа сериализуются как значение строки String CLValue, с версией поля Option, сериализуемой в 0, если значение None; или же сериализуется внутренне значение u32, как описано ниже.

source: ``StoredVersionedContractByName { name: "lWJWKdZUEudSakJzw1tn", version: Some(1632552656), entry_point: "S1cXRT3E1jyFlWBAIVQ8", args: 9975e6957ea6b07176c7d8471478fb28df9f02a61689ef58234b1a3cffaebf9f303e3ef60ae0d8 }``
ru: ``StoredVersionedContractByName { имя name: "lWJWKdZUEudSakJzw1tn", версия version: Some(1632552656), точка входа entry_point: "S1cXRT3E1jyFlWBAIVQ8", вводные args: 9975e6957ea6b07176c7d8471478fb28df9f02a61689ef58234b1a3cffaebf9f303e3ef60ae0d8 }``

source: Transfer serializes such that the first byte within the serialized buffer contains is 5u8, with the remaining bytes of the buffer containing the bytes contained within the args field of Transfer.
ru: Трансфер сериализуется так, что первый байт сериализованного буфера содержит 5u8, с остатком байтов буфера, содержащим байты из вводных поля Трансфера.

source: Approval
ru: Подтверждение

source: Approval contains two fields:
ru: Подтверждение содержит два поля:

source: ``signer``: The public key of the approvals signer. It serializes to the byte representation of the ``PublicKey``. If the ``PublicKey`` is an ``Ed25519`` key, then the first byte within the serialized buffer is 1 followed by the bytes of the key itself; else, in the case of ``Secp256k1``, the first byte is 2.
ru: подписант ``signer``: публичный ключ подписанта подтверждений. Он сериализуется в байтовую репрезентацию публичного ключа ``PublicKey``. Если ``PublicKey`` - это ключ ``Ed25519``; тогда первый байт внутри сериализованного буфера равен 1 и далее следуют байты самого ключа; также в случае если ``Secp256k1``, первый байт равен 2.

source: ``signature``: The approval signature, which serializes as the byte representation of the ``Signature``. The fist byte within the signature is 1 in the case of an ``Ed25519`` signature or 2 in the case of ``Secp256k1``.
ru: подпись ``signature``: подпись подтверждения, которая сериализуется в байтовую репрезентацию подписи ``Signature``. Первый байт в подписи равен 1 в случае если ``Ed25519`` или 2 если ``Secp256k1``.
