Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: ru

source: DeployInfo Key
ru: Ключ информации развертывания DeployInfo Key

source: This key type is used specifically for storing information related to deploys in the global state. Information for a given deploy is stored under this key only. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the deploy itself.
ru: Этот тип ключа используется специально для хранения информации, связанной с развертываниями в глобальном состоянии. Информация для данного развертывания хранится только под этим ключом. 32-разрядный идентификатор, представляющий этот ключ, получен из хеша "blake2b256" самого развертывания.

source: EraInfo Key
ru: Ключ информации эры EraInfo Key

source: This key type is used specifically for storing information related to the ``Auction`` metadata for a particular era. The underlying data type stored under this is a vector of the allocation of seigniorage for that given era. The identifier for this key is a new type that wraps around the primitive ``u64`` data type and co-relates to the era number when the auction information was stored.
ru: Этот тип ключа используется специально для хранения информации, связанной с метаданными "Аукциона" для определенной эры. Базовый тип данных, хранящийся под этим, представляет собой вектор распределения сеньоража для данной эпохи. Идентификатор этого ключа представляет собой новый тип, который охватывает примитивный тип данных "u64" и соотносится с номером эры, когда была сохранена информация об аукционе.

source: Balance Key
ru: Ключ баланса

source: This key type is used to store information related to the balance of a given purse. All purse balances are stored using this key. The 32-byte identifier which represents this key is derived from the Address of the URef, which relates to the purse.
ru: Этот тип ключа используется для хранения информации, связанной с балансом данного кошелька. Все остатки на кошельках хранятся с помощью этого ключа. 32-байтовый идентификатор, представляющий этот ключ, получен из адреса URef, который относится к кошельку.

source: Bid Key
ru: Ключ бида

source: This key type is used specifically for storing information related to auction bids in the global state. Information for the bids is stored under this key only. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the public key used to create the associated account (see :ref:`Accounts <accounts-associated-keys-weights>` for more information).
ru: Этот тип ключа используется специально для хранения информации, связанной с аукционными ставками - бидами - в глобальном состоянии. Информация для ставок хранится только под этим ключом. 32-байтовый идентификатор, представляющий этот ключ, получен из хеша "blake2b256" открытого ключа, используемого для создания связанной учетной записи (см. :ref:`Accounts <accounts-associated-keys-weights>` для получения дополнительной информации).

source: Withdraw Key
ru: Ключ вывода Withdraw key

source: This key type is used specifically for storing information related to auction withdraws in the global state. Information for the withdrawals is stored under this key only. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the public key used to create the associated account (see :ref:`Accounts <accounts-associated-keys-weights>` for more information).
ru: Этот тип ключа используется специально для хранения информации, связанной с выводом средств с аукциона в глобальном состоянии. Информация для вывода средств хранится только под этим ключом. 32-байтовый идентификатор, представляющий этот ключ, получен из хеша "blake2b256" открытого ключа, используемого для создания связанной учетной записи (см. :ref:`Accounts <accounts-associated-keys-weights>` для получения дополнительной информации).

source: Serialization for ``Key``
ru: Сериализация для ``Key``

source: Given the different variants for the over-arching ``Key`` data-type, each of the different variants is serialized differently. This section of this chapter details how the individual variants are serialized. The leading byte of the serialized buffer acts as a tag indicating the serialized variant.
ru: Учитывая различные варианты для всеобъемлющего типа данных "Ключ", каждый из различных вариантов сериализуется по-разному. В этом разделе этой главы подробно описывается, как сериализуются отдельные варианты. Начальный байт сериализованного буфера действует как тег, указывающий сериализованный вариант.

source: ``Account`` serializes as a 32 byte long buffer containing the byte representation of the underlying ``AccountHash``
ru: Аккаунт ``Account" сериализуется как буфер длиной 32 байта, содержащий байтовое представление базового хеша учетной записи ``AccountHash`` .

source: ``Hash`` serializes as a 32 byte long buffer containing the byte representation of the underlying ``Hash`` itself.
ru: ``Hash`` сериализуется как буфер длиной 32 байта, содержащий байтовое представление самого "хеша".

source: ``URef`` is a tuple that contains the address of the URef and the access rights to that ``URef``. The serialized representation of the ``URef`` is 33 bytes long. The first 32 bytes are the byte representation of the ``URef`` address, and the last byte contains the bits corresponding to the access rights of the ``URef``. Refer to the :ref:`CLValue<serialization-standard-values>` section of this chapter for details on how ``AccessRights`` are serialized.
ru: ``URef"- это кортеж, содержащий адрес URef и права доступа к этой ссылке ``URef``. Сериализованное представление "URef" имеет длину 33 байта. Первые 32 байта являются байтовым представлением адреса "URef", а последний байт содержит биты, соответствующие правам доступа "URef". Обратитесь к разделу:ref:`CLValue<serialization-standard-values>` этой главы для получения подробной информации о том, как сериализуются `Права доступа` ``AccessRights`` .

source: ``Transfer`` serializes as a 32 byte long buffer containing the byte representation of the hash of the transfer.
ru: ``Transfer`` сериализуется как буфер длиной 32 байта, содержащий байтовое представление хеша трансфера.

source: ``DeployInfo`` serializes as 32 byte long buffer containing the byte representation of the Deploy hash. See the Deploy section above for how Deploy hashes are serialized.
ru: ``DeployInfo`` сериализуется как 32-байтовый буфер, содержащий байтовую репрезентацию хеша развертывания. Смотрите раздел про развертывания выше, чтобы понять, как сериализуются развертывания.

source: ``EraInfo`` serializes a ``u64`` primitive type containing the little-endian byte representation of ``u64``.
ru: Информация об эре ``EraInfo`` сериализуется в примитивный тип ``u64`` , содержащий малоконечное байтовое представление ``u64``.

source: ``Balance`` serializes as 32 byte long buffer containing the byte representation of the URef address.
ru: Баланс ``Balance`` сериализуется как буфер длиной 32 байта, содержащий байтовое представление адреса ссылки URef.

source: ``Bid`` and ``Withdraw`` both contain the ``AccountHash`` as their identifier; therefore, they serialize in the same manner as the ``Account`` variant.
ru: Бид ``Bid`` и Вывод ``Withdraw`` оба содержат хеш аккаунта ``AccountHash`` в качестве идентификатора; так что они сериализуются так же, как ``Account``.

source: Permissions
ru: Разрешения

source: There are three types of actions that can be done on a value: read, write, add. The reason for *add* to be called out separately from *write* is to allow for commutativity checking. The available actions depend on the key type and the context. Some key types only allow controlled access by smart contracts via the contract API, and other key types refer to values produced and used by the system itself and are not accessible to smart contracts at all but can be read via off-chain queries. This is summarized in the table below:
ru: Существует три типа действий, которые можно выполнить над значением: чтение, запись, добавление. Причина, по которой добавление *add* вызывается отдельно от записи *write*, заключается в том, чтобы обеспечить проверку коммутативности. Доступные действия зависят от типа ключа и контекста. Некоторые типы ключей разрешают контролируемый доступ только смарт-контрактам через API контрактов, а другие типы ключей относятся к значениям, создаваемым и используемым самой системой, и вообще недоступны для смарт-контрактов, но могут быть прочитаны с помощью запросов вне цепочки. Это кратко изложено в таблице ниже:

source: Key Type
ru: Тип ключа

source: Available Actions
ru: Доступные действия

source: Account
ru: Аккаунт

source: Read + Add (via API)
ru: Чтение + Добавление (через API)

source: Hash
ru: Хеш

source: Read
ru: Чтение

source: Read + Write and/or Add
ru: Чтение + Запись и/или Добавление

source: Transfer
ru: Трансфер

source: System
ru: Система

source: EraInfo
ru: Информация об эре

source: Balance
ru: Баланс

source: Read (via API)
ru: Чтение (через API)

source: Bid
ru: Бид

source: Withdraw
ru: Вывод

source: Refer to :ref:`URef permissions<uref-permissions>` on how permissions are handled in the case of ``URef``\ s.
ru: Обратитесь к разделу о разрешениях :ref:`URef permissions<uref-permissions>` за информацией о том, как управлять разрешениями с ``URef``.
