Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: ru

source: Deploy Serialization at High Level
ru: Сериализация развертывания на высшем уровне

source: Consider the following deploy:
ru: Возьмем следующее развертывание:

source: The above deploy will serialize to:
ru: Приведенное развертывание сериализуется в:

source: Values
ru: Значения

source: A value stored in the global state is a ``StoredValue``. A ``StoredValue`` is one of three possible variants:
ru: Значение.хранящееся в глобальном состоянии - это хранимое значение ``StoredValue``. Оно является одним из трех возможных вариантов:

source: A ``CLValue``
ru: Значение ``CLValue``

source: A contract
ru: Контракт

source: An account
ru: Аккаунт

source: We discuss ``CLValue`` and contract in more detail below. Details about accounts can be found in :ref:`accounts-head`.
ru: Мы более детально обсудим контракт и ``CLValue`` ниже. Детали про аккаунты можно найти тут :ref:`accounts-head`.

source: Each ``StoredValue`` is serialized when written to the global state. The serialization format consists of a single byte tag, indicating which variant of ``StoredValue`` it is, followed by the serialization of that variant. The tag for each variant is as follows:
ru: Каждое хранимое значение ``StoredValue`` сериализуется, когда записано в глобальном состоянии. Формат сериализации состоит из одинарного байта-метки, означающей, какой вариант ``StoredValue`` под ней, и далее следует сериализация этого варианта. Метка для каждого варианта такая:

source: ``CLValue`` is ``0``
ru: Для ``CLValue`` это ``0``

source: ``Account`` is ``1``
ru: Для аккаунта ``Account`` это ``1``

source: ``Contract`` is ``2``
ru: Для контракта ``Contract`` это ``2``

source: The details of ``CLType`` serialization are in the following section. Using the serialization format for ``CLValue`` as a basis, we can succinctly write the serialization rules for contracts and accounts:
ru: Детали сериализации ``CLType`` находятся в соответствующем разделе. Используя формат сериализации ``CLValue`` как базу, мы можем лаконично составить правила для сериализации контрактов и аккаунтов:

source: contracts serialize in the same way as data with ``CLType`` equal to ``Tuple3(List(U8), Map(String, Key), Tuple3(U32, U32, U32))``;
ru: контракты сериализуются тем же способом, что данные с ``CLType`` тождественные ``Tuple3(List(U8), Map(String, Key), Tuple3(U32, U32, U32))``;

source: accounts serialize in the same way as data with ``CLType`` equal to ``Tuple5(FixedList(U8, 32), Map(String, Key), URef, Map(FixedList(U8, 32), U8), Tuple2(U8, U8))``.
ru: аккаунты сериализуются тем же способом, что данные с ``CLType`` , тождественные ``Tuple5(FixedList(U8, 32), Map(String, Key), URef, Map(FixedList(U8, 32), U8), Tuple2(U8, U8))``.

source: Note: ``Tuple5`` is not a presently supported ``CLType``. However, it is clear how to generalize the rules for ``Tuple1``, ``Tuple2``, ``Tuple3`` to any size tuple.
ru: Примечание: ``Tuple5`` на данный момент не поддерживаемый формат ``CLType``. Но в целом понятно, как обобщить правила для ``Tuple1``, ``Tuple2``, ``Tuple3`` и кортежа любого размера.

source: Note: links to further serialization examples and a reference implementation are found in :ref:`Appendix B <appendix-b>`.
ru: Примечание: ссылки для дальнейших примеров сериализации и примеры их ввода можно найти в :ref:`Appendix B <appendix-b>`.

source: ``CLValue`` is used to describe data that is used by smart contracts. This could be as a local state variable, input argument, or return value. A ``CLValue`` consists of two parts: a ``CLType`` describing the type of the value and an array of bytes representing the data in our serialization format.
ru: ``CLValue`` используется для описания данных, которые используются смарт-контрактами. Это может быть переменная локального состояния, вводное значение или возвратимое значение. ``CLValue`` состоит из двух частей: "CLType`` описывающее тип значения и поток байтов, представляющих данные в нашем формате сериализации.

source: ``CLType`` is described by the following recursive data type:
ru: ``CLType`` описывается следующим рекурсивным типом данных:

source: All data which can be assigned a (non-``Any``) ``CLType`` can be serialized according to the following rules (this defines the Casper serialization format):
ru: Все данные, которые могут быть обозначены (non-``Any"- не любые) как ``CLType`` могут быть сериализованы согласно следующим правилам (это определяет формат сериализации Casper):

source: Boolean values serialize as a single byte; ``true`` maps to ``1``, while ``false`` maps to ``0``.
ru: Булевый тип значений сериализуется как одинарный байт; ``true`` картируется в ``1``, а ``false`` картируется в ``0``.

source: Numeric values consisting of 64 bits or less serialize in the two's complement representation with little-endian byte order, and the appropriate number of bytes for the bit-width.
ru: Числовые значения, состоящие из 64 бит или менее, сериализуются в дополнительном представлении двух с небольшим порядком байтов и соответствующим количеством байтов для разрядности.

source: E.g. ``7u8`` serializes as ``0x07``
ru: ``7u8`` сериализуется как ``0x07``

source: E.g. ``7u32`` serializes as ``0x07000000``
ru: или ``7u32`` сериализуется как "0x07000000``

source: E.g. ``1024u32`` serializes as ``0x00040000``
ru: или же ``1024u32`` сериализуется как ``0x00040000``

source: Wider numeric values (i.e. ``U128``, ``U256``, ``U512``) serialize as one byte given the length of the next number (in bytes), followed by the two's complement representation with little-endian byte order. The number of bytes should be chosen as small as possible to represent the given number. This is done to reduce the serialization size when small numbers are represented within a wide data type.
ru: Более обширные численные значения (т.е. ```U128``, ``U256``, ``U512``) сериализуются как один байт длиной в следующее число (в байтах), за ним следует представление дополнения двух с порядком байтов малого конца. Количество байтов должно быть выбрано как можно меньшим, чтобы представлять заданное число. Это делается для уменьшения размера сериализации, когда небольшие числа представлены в широком типе данных.

source: E.g. ``U512::from(7)`` serializes as ``0x0107``
ru: Например ``U512::from(7)`` сериализуется как "0x0107``

source: E.g. ``U512::from(1024)`` serializes as ``0x020004``
ru: или ``U512::from(1024)`` сериализуется как ``0x020004``

source: E.g. ``U512::from("123456789101112131415")`` serializes as ``0x0957ff1ada959f4eb106``
ru: или же ``U512::from("123456789101112131415")`` сериализуется как ``0x0957ff1ada959f4eb106``

source: Unit serializes to an empty byte array.
ru: Юнит сериализуется в пустой массив байтов.

source: Strings serialize as a 32-bit integer representing the length in bytes (note: this might be different than the number of characters since special characters, such as emojis, take more than one byte), followed by the UTF-8 encoding of the characters in the string.
ru: Строки сериализуются как 32-разрядное целое число, представляющее длину в байтах (примечание: это может отличаться от количества символов, поскольку специальные символы, такие как смайлики, занимают более одного байта), за которыми следует кодировка символов в строке UTF-8

source: E.g. ``"Hello, World!"`` serializes as ``0x0d00000048656c6c6f2c20576f726c6421``
ru: Например ``"Hello, World!"`` сериализуется как ``0x0d00000048656c6c6f2c20576f726c6421``

source: Optional values serialize with a single byte tag, followed by the serialization of the value itself. The tag is equal to ``0`` if the value is missing, and ``1`` if it is present.
ru: Опциональные значения сериализуются с однобайтной меткой, за которой идет сериализация самого значения. Метка равна "0" если значение отсутствует, и "1", если присутствует.

source: E.g. ``None`` serializes as ``0x00``
ru: Так, ``None`` сериализуется в ``0x00``

source: E.g. ``Some(10u32)`` serializes as ``0x010a000000``
ru: Например ``Some(10u32)`` сериализуется как ``0x010a000000``

source: A list of values serializes as a 32-bit integer representing the number of elements in the list (note this differs from strings where it gives the number of *bytes*), followed by the concatenation of each serialized element.
ru: Список значений сериализуется как 32-разрядное целое число, представляющее количество элементов списка (обратите внимание, что это отличается от строк, где дается количество *байтов*), и далее следует сцепление каждого сериализованного элемента.

source: E.g. ``List()`` serializes as ``0x00000000``
ru: Например ``List()`` сериализуется как ``0x00000000``

source: E.g. ``List(1u32, 2u32, 3u32)`` serializes as ``0x03000000010000000200000003000000``
ru: или ``List(1u32, 2u32, 3u32)`` сериализуется как ``0x03000000010000000200000003000000``

source: A fixed-length list of values serializes as the concatenation of the serialized elements. Unlike a variable-length list, the length is not included in the serialization because it is statically known by the type of the value.
ru: Список значений фиксированной длины сериализуется как объединение сериализованных элементов. В отличие от списка переменной длины, длина не включается в сериализацию, поскольку она статически известна по типу значения.

source: E.g. ``[1u32, 2u32, 3u32]`` serializes as ``0x010000000200000003000000``
ru: Например ``[1u32, 2u32, 3u32]`` сериализуется как ``0x010000000200000003000000``

source: A ``Result`` serializes as a single byte tag followed by the serialization of the contained value. The tag is equal to ``1`` for the success variant and ``0`` for the error variant.
ru: Результат ``Result`` сериализуется как однобайтная метка , за которой идет сериализация самого значения. Метка равна "1" в случае успеха и "0" в случае ошибки.

source: E.g. ``Ok(314u64)`` serializes as ``0x013a01000000000000``
ru: Например, ``Ok(314u64)`` сериализуется как ``0x013a01000000000000``

source: E.g. ``Err("Uh oh")`` serializes as ``0x00050000005568206f68``
ru: Например, ``Err("Uh oh")`` сериализуется как ``0x00050000005568206f68``

source: Tuples serialize as the concatenation of their serialized elements. Similar to ``FixedList`` the number of elements is not included in the serialization because it is statically known in the type.
ru: Кортежи сериализуются как объединение их сериализованных элементов. Подобно Фиксированному списку ``FixedList``, количество элементов не включается в сериализацию, поскольку оно статически известно в типе.

source: E.g. ``(1u32, "Hello, World!", true)`` serializes as ``0x010000000d00000048656c6c6f2c20576f726c642101``
ru: Например, ``(1u32, "Hello, World!", true)`` сериализуется как ``0x010000000d00000048656c6c6f2c20576f726c642101``

source: A ``Map`` serializes as a list of key-value tuples. There must be a well-defined ordering on the keys, and in the serialization, the pairs are listed in ascending order. This is done to ensure determinism in the serialization, as ``Map`` data structures can be unordered.
ru: Карта ``Map`` сериализуется как список кортежей ключей-значений. В ключах должен быть четко определенный порядок, и при сериализации пары перечислены в порядке возрастания. Это делается для обеспечения детерминизма при сериализации, так как структуры данных "Карты" могут быть неупорядоченными.

source: ``URef`` values serialize as the concatenation of its address (which is a fixed-length list of ``u8``) and a single byte tag representing the access rights. Access rights are converted as follows:
ru: Значения ``URef`` сериализуются как объединения их адресов (которые имеют фиксированную длину списка "u8") а однобайтную метку, представляющую права доступа. Права доступа конвертируются следующим образом:

source: Access Rights
ru: Права доступа

source: Serialization
ru: Сериализация

source: ``PublicKey`` serializes as a single byte tag representing the algorithm followed by 32 bytes of the ``PublicKey`` itself:
ru: Публичный ключ ``PublicKey`` сериализуется как однобайтная метка, представляющая алгоритм, за которым следуют 32 байта самого ключа ``PublicKey``:

source: If the ``PublicKey`` is an ``Ed25519`` key, the single tag byte is ``1`` followed by the individual bytes of the serialized key.
ru: Если публичный ключ ``PublicKey`` - это ключ ``Ed25519``, однобайтная метка "1" и за ней следуют индивидуальные байты сериализованного ключа.

source: If the ``PublicKey`` is a ``Secp256k1`` key, the single tag byte is a ``2`` followed by the individual bytes of the serialized key.
ru: Если публичный ключ ``PublicKey`` - это ключ ``Secp256k1``, однобайтная метка - "2", и за ней следуют индивидуальные байты сериализованного ключа.

source: ``Key`` values serialize as a single byte tag representing the variant, followed by the serialization of the data that variant contains. For most variants, this is simply a fixed-length 32-byte array. The exception is ``Key::URef``, which contains a ``URef``; so its data serializes per the description above. The tags are as follows: ``Key::Account`` serializes as ``0``, ``Key::Hash`` as ``1``, ``Key::URef`` as ``2``.
ru: Значения ключей ``Key`` сериализуются как однобайтная метка, представляющая вариант, за которым следует сериализация данных, содержащихся в этом варианте. Для большинства вариантов это просто 32-байтный поток фиксированной длины. Исключение составляет ``Key::URef``, который содержит ``URef``; так что его данные сериализуются по описанию выше. Теги следующие: ``Key::Account`` сериализуется как ``0``, ``Key::Hash`` как ``1``, ``Key::URef`` как ``2``.

source: ``CLType`` itself also has rules for serialization. A ``CLType`` serializes as a single-byte tag, followed by the concatenation of serialized inner types, if any (e.g., lists and tuples have inner types). ``FixedList`` is a minor exception because it also includes the length in the type. However, the length is included in the serialization (as a 32-bit integer, per the serialization rules above), following the serialization of the inner type. The tags are as follows:
ru: У ``CLType`` тоже есть правила для сериализации. ``CLType`` сериализуется как однобайтная метка, за которой следует объединение сериализованных внутренних типов, если таковые имеются (например, списки и кортежи имеют внутренние типы). Фиксированный список ``FixedList`` является незначительным исключением, поскольку он также включает длину в типе. Однако длина включается в сериализацию (в виде 32-разрядного целого числа, согласно приведенным выше правилам сериализации) после сериализации внутреннего типа. Теги следующие:

source: Serialization Tag
ru: Тэг сериализации

source: ``String``
ru: ``String`` строка

source: ``Option``
ru: опция ``Option``

source: ``List``
ru: Список ``List``

source: ``FixedList``
ru: Фиксированный список ``FixedList``

source: ``Result``
ru: Результат ``Result``

source: ``Map``
ru: Карта ``Map``

source: ``Tuple1``
ru: Кортеж ``Tuple1``

source: ``Tuple2``
ru: Кортеж ``Tuple2``

source: ``Tuple3``
ru: Кортеж ``Tuple3``

source: ``Any``
ru: Любой ``Any``

source: A complete ``CLValue``, including both the data and the type, can also be serialized (to store it in the global state). This is done by concatenating: the serialization of the length (as a 32-bit integer) of the serialized data (in bytes), the serialized data itself, and the serialization of the type.
ru: Полное Значение ``CLValue``, включающее как данные, так и тип, также может быть сериализовано (для хранения в глобальном состоянии). Это делается путем объединения: сериализации длины (в виде 32-разрядного целого числа) сериализованных данных (в байтах), самих сериализованных данных и сериализации типа.

source: Contracts
ru: Контракты

source: Contracts are a special value type because they contain the on-chain logic of the applications running on the Casper network. A *contract* contains the following data:
ru: Контракты являются особым типом значений, поскольку они содержат цепную логику приложений, запущенных в сети Casper. *Контракт* содержит следующие данные:

source: a `wasm module <https://webassembly.org/docs/modules/>`__
ru: модуль wasm `wasm module <https://webassembly.org/docs/modules/>`__

source: a collection of named keys
ru: коллекция именованных ключей

source: a protocol version
ru: версия протокола

source: The wasm module must contain a function named ``call``, which takes no arguments and returns no values. This is the main entry point into the contract. Moreover, the module may import any of the functions supported by the Casper runtime; a list of all supported functions can be found in :ref:`Appendix A <appendix-a>`.
ru: Модуль wasm должен содержать функцию с именем вызов - ``call`` , которая не принимает аргументов и не возвращает значений. Это основная точка входа в контракт. Кроме того, модуль может импортировать любую из функций, поддерживаемых средой выполнения Casper; список всех поддерживаемых функций можно найти в :ref:`Appendix A <appendix-a>`.

source: Note: though the ``call`` function signature has no arguments and no return value, within the ``call`` function body, the ``get_named_arg`` runtime function can be used to accept arguments (by ordinal), and the ``ret`` runtime function can be used to return a single ``CLValue`` to the caller.
ru: Примечание: хотя подпись функции "вызов" не имеет аргументов и возвращаемого значения, в теле функции "вызов" функция времени выполнения "get_named_arg" может использоваться для приема аргументов (по порядку), а функция времени выполнения "ret" может использоваться для возврата одного значения "CLValue" вызывающему.

source: The named keys are used to give human-readable names to keys in the global state, which are essential to the contract. For example, the hash key of another contract it frequently calls may be stored under a meaningful name. It is also used to store the ``URef``\ s, which are known to the contract (see the section on Permissions for details).
ru: Именованные ключи используются для присвоения удобочитаемых имен ключам в глобальном состоянии, которые необходимы для контракта. Например, хеш-ключ другого контракта, который он часто вызывает, может храниться под значимым именем. Он также используется для хранения "URef", которые известны контракту (подробности см. в разделе о разрешениях).

source: Each contract specifies the Casper protocol version that was active when the contract was written to the global state.
ru: Каждый контракт определяет версию протокола Casper, которая была активна, когда контракт был записан в глобальное состояние.

source: Keys
ru: Ключи

source: In this chapter, we describe what constitutes a “key”, the permissions model for the keys, and how they are serialized.
ru: В этой главе мы описываем, что составляет "ключ", модели разрешений для ключей, и как они сериализуются.

source: A *key* in the :ref:`Global State<global-state-intro>` is one of the following data types:
ru: *Ключ* в глобальном состоянии :ref:`Global State<global-state-intro>` является одним из следующих типов данных:

source: 32-byte account identifier (called an “account identity key”)
ru: 32-байтовый идентификатор аккаунта (называемый "идентификационный ключ аккаунта")

source: 32-byte immutable contract identifier (called a “hash key”)
ru: 32-байтовый неизменяемый идентификатор контракта (называемый “хеш-ключом”)

source: 32-byte reference identifier (called an “unforgeable reference”)
ru: 32-байтовый идентификатор ссылок (называемый "криптографически стойкой ссылкой")

source: 32-byte transfer identifier
ru: 32-байтный идентификатор трансфера

source: 32-byte deploy information identifier
ru: 32-байтный идентификатор информации развертывания

source: 32-byte purse balance identifier
ru: 32-байтный идентификатор баланса кошелька

source: 32-byte Auction bid identifier
ru: 32-байтный идентификатор бида аукциона

source: 32-byte Auction withdrawal identifier
ru: 32-байтный идентификатор снятия средств с аукциона

source: The one exception to note here is the identifier for ``EraInfo``, which actually serializes as a ``u64`` value with an additional byte for the tag.
ru: Тут следует отметить одно исключение, идентификатор для информации об эре ``EraInfo``, который сериализуется как значение ``u64`` с дополнительным байтом для метки.

source: Account identity key
ru: Идентификационный ключ аккаунта

source: This key type is used specifically for accounts in the global state. All accounts in the system must be stored under an account identity key, and no other types. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the public key used to create the associated account (see :ref:`Accounts <accounts-associated-keys-weights>` for more information).
ru: Этот тип ключа используется специально для учетных записей в глобальном состоянии. Все учетные записи в системе должны храниться под ключом идентификации учетной записи, и никаких других типов. 32-байтовый идентификатор, представляющий этот ключ, получен из хеша "blake2b256" открытого ключа, используемого для создания связанной учетной записи (см. :ref:`Accounts <accounts-associated-keys-weights> ` для получения дополнительной информации).

source: Hash key
ru: Ключ хеша

source: This key type is used for storing contracts immutably. Once a contract is written under a hash key, that contract can never change. The 32-byte identifier representing this key is derived from the ``blake2b256`` hash of the deploy hash (see :ref:`block-structure-head` for more information) concatenated with a 4-byte sequential ID. The ID begins at zero for each deploy and increments by one each time a contract is stored. The purpose of this ID is to allow each contract stored in the same deploy to have a unique key.
ru: Этот тип ключа используется для неизменного хранения контрактов. Как только контракт написан под хеш-ключом, этот контракт никогда не может измениться. 32-байтовый идентификатор, представляющий этот ключ, получен из хеша "blake2b256" хеша развертывания (см. :ref:`block-structure-head` для получения дополнительной информации), объединенного с 4-байтовым последовательным идентификатором. Идентификатор - ID - начинается с нуля для каждого развертывания и увеличивается на единицу при каждом хранении контракта. Цель этого идентификатора состоит в том, чтобы позволить каждому контракту, хранящемуся в одном развертывании, иметь уникальный ключ.

source: Unforgeable Reference (``URef``)
ru: Криптографически стойкая ссылка (``URef``)

source: ``URef`` broadly speaking can be used to store values and manage permissions to interact with the value stored under the ``URef``. ``URef`` is a tuple which contains the address under which the values are stored and the Access rights to the ``URef``. Refer to the :ref:`Unforgeable Reference<uref-head>` section for details on how ``URefs`` are managed.
ru: "URef" в широком смысле может использоваться для хранения значений и управления разрешениями для взаимодействия со значением, хранящимся в "URef". "URef" - это кортеж, содержащий адрес, по которому хранятся значения, и права доступа к "URef". Обратитесь к разделу :ref:`Unforgeable Reference<uref-head>` для получения подробной информации о том, как управляются ссылки ``URefs`` .

source: Transfer Key
ru: Ключ трансфера

source: This key type is used specifically for transfers in the global state. All transfers in the system must be stored under a transfer key and no other type. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the transfer address associated with the given transfer
ru: Этот тип ключа используется специально для переводов в глобальном состоянии. Все переводы в системе должны храниться под ключом перевода и никаким другим типом. 32-байтовый идентификатор, представляющий этот ключ, получен из хеша "blake2b256" адреса передачи, связанного с данной передачей
