Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/implementation/tokens.po
Languages: ru

source: Tokens
ru: Токены

source: Introduction
ru: Введение

source: The Casper Network is a decentralized blockchain platform based on a Proof-of-Stake consensus algorithm called `Highway <https://github.com/casper-network/highway>`_. Having a unit of value is required to make this system work because users must pay for computation, and validators must have `stake <https://docs.casperlabs.io/en/latest/staking/index.html>`_ to bond. In the blockchain space, this unit of value is a *token*.
ru: Сеть Casper - это децентрализованная блокчейн-платформа, основанная на алгоритме консенсуса с подтверждением ставки Proof-of-Stake, называемом `Highway <https://github.com/casper-network/highway>`_. Наличие единицы стоимости необходимо для того, чтобы эта система работала, потому что пользователи должны платить за вычисления, а валидаторы должны иметь долю - стейк `stake <https://docs.casperlabs.io/en/latest/staking/index.html>`_ для бондинга к сети. В пространстве блокчейна этой единицей стоимости является *токен*.

source: This chapter describes how we define tokens and how one can use them on the Casper platform.
ru: Эта глава описывает, как мы определяем токены и как их можно использовать на платформе Casper.

source: Token Generation and Distribution
ru: Генерирование и дистрибуция токенов

source: A blockchain system generally needs to have a supply of tokens available to pay for computation and reward validators for processing transactions on the network. The initial supply at the launch of Mainnet was 10 billion CSPR. The current supply is available `here <https://api.cspr.live/supply>`_. In addition to the initial supply, the system will have a low rate of inflation, the results of which will be paid out to validators in the form of seigniorage.
ru: Блокчейн-система, как правило, должна иметь запас токенов, доступных для оплаты вычислений и вознаграждений валидаторам за обработку транзакций в сети. Первоначальная поставка при запуске Mainnet составляла 10 миллиардов CSPR. Нынешнее предложение доступно 'здесь <https://api.cspr.live/supply>`_. В дополнение к первоначальному предложению, система будет иметь низкий уровень инфляции, результаты которой будут выплачиваться валидаторам в виде сеньоража.

source: The number of tokens used as a basis for calculating seigniorage is 10 billion.
ru: Количество токенов, используемых как база для вычисления сеньоража - 10 млрд.

source: Divisibility of Tokens
ru: Делимость токенов

source: Typically, a *token* is divisible into some number of parts. We call the indivisible units which make up the CSPR token *motes*. Each CSPR is divisible into :math:`10^{9}` motes. To avoid rounding errors, it is essential to always represent token balances in motes. In comparison, Ether is divisible into :math:`10^{18}` parts called Wei.
ru: Как правило, *токен* делится на некоторое количество частей. Мы называем неделимые единицы, из которых состоит токен CSPR, пылинками *motes*. Каждый CSPR делится на :math:`10^{9}` motes. Чтобы избежать ошибок округления, важно всегда представлять балансы токенов в единицах. Для сравнения, любой из них делится на :math:`10^{18}` частей, называемых Вэй - Wei.

source: Mints and Purses
ru: Выпуск и кошельки

source: A *mint* is a contract that can produce new motes of a particular type. We allow for multiple mote types (each of which would have its mint contract) because we anticipate the existence of a large ecosystem of different tokens, similar to the way Etherum works with ERC20 tokens. Casper will deploy a specific mint contract, and it will manage the CSPR utility token (used for paying for computation and bonding onto the network). The mint also maintains all the balances for its type of mote. Each balance is associated with a ``URef``, which acts as a key to instruct the mint to perform actions on that balance (e.g., transfer motes). Informally, we will refer to these balances as *purses* and conceptually represent a container for motes. The ``URef`` is how a purse is referenced externally, outside the mint.
ru: *Выпуск монет* - mint - это контракт, который может создавать новые motes определенного типа. Мы допускаем несколько типов монет motes (у каждой из которых будет свой контракт выпуска), потому что мы ожидаем существования большой экосистемы различных токенов, аналогичной тому, как Ethereum работает с токенами ERC20. Casper развертывает конкретный контракт выпуска mint, и он будет управлять служебным токеном CSPR (используется для оплаты вычислений и подключения к сети). Mint также поддерживает все балансы для своего типа монетки mote. Каждый баланс связан с "URef", которая действует как ключ для указания контракту выпуска выполнять действия с этим балансом (например, переводить motes). Неофициально мы будем называть эти балансы *кошельками* и концептуально они будут представлять собой контейнер для монеток. "URef" - это то, как на кошелек ссылаются извне, за пределами контракта выпуска.

source: The ``AccessRights`` of the :ref:`URefs <global-state-urefs-permissions>` permissions model determine what actions are allowed to be performed when using a ``URef`` associated with a purse.
ru: "Права доступа" к модели разрешений :ref:`URefs <global-state-urefs-permissions>` определяют, какие действия разрешены с применением "URef" к кошельку.

source: As all ``URef``\ s are unforgeable, so the only way to interact with a purse is for a ``URef`` with appropriate ``AccessRights`` to be given to the current context in a valid way (see :ref:`URefs <global-state-urefs-permissions>` permissions for details).
ru: Все ссылки "URef" являются криптографически стойкими, так что единственный способ взаимодействия с кошельком через "URef" - с правильными правами доступа "AccessRights", чтобы увидеть текущий контекст должным образом (смотрите разрешения :ref:`URefs <global-state-urefs-permissions> 1` для уточнения деталей).

source: The basic global state options map onto more standard monetary operations according to the table below:
ru: Основные параметры глобального состояния сопоставляются с более стандартными денежными операциями в соответствии с приведенной ниже таблицей:

source: Global State Action
ru: Действия в глобальном состоянии

source: Monetary Action
ru: Денежные действия

source: Add
ru: Добавление

source: Deposit (i.e. transfer to)
ru: Депозит (т.е. трансфер в)

source: Write
ru: Запись

source: Withdraw (i.e. transfer from)
ru: Вывод (т.е. трансфер из)

source: Read
ru: Чтение

source: Balance check
ru: Проверка баланса

source: We will use these definitions throughout this chapter to describe the implementation and usage of tokens on the Casper system.
ru: Мы будем использовать эти определения в этой главе для описания реализации и использования токенов в системе Casper.

source: The mint Contract Interface
ru: Интерфейс контракта выпуска монет

source: A valid mint contract exposes the following methods (recall that many mint implementations may exist, each corresponding to a different currency):
ru: Действующий контракт выпуска предоставляет следующие методы (напомним, что может существовать множество реализаций выпуска, каждая из которых соответствует разному виду валюты):

source: ``source`` must have at least ``Write`` access rights, ``target`` must have at least ``Add`` access rights
ru: источник ``source`` должен иметь как минимум права на запись ``Write``, цель "target" должна иметь как минимум права на добавление "Add"

source: ``TransferResult`` may be a success acknowledgment or an error in the case of invalid ``source`` or ``target`` or insufficient balance in the ``source`` purse
ru: Результат трансфера ``TransferResult`` может быть успешно подтвержден или же показать ошибку в случае невалидного источника ``source`` или цели ``target`` или несоответствующего баланса в кошельке источника ``source``

source: ``MintResult`` either gives the created ``URef`` (with full access rights), which now has a balance equal to the given ``amount``; or an error due to the minting of new motes not being allowed
ru: Результат выпуска ``MintResult`` дает либо созданную ``URef`` (с полными правами доступа), на которой баланс соответствует заданному количеству "amount"; или в случае запрета на выпуск новых монеток motes происходит ошибка

source: In the Casper mint, only the system account can call ``mint``, and it has no private key to produce valid cryptographic signatures, which means only the software itself can execute contracts in the context of the system account
ru: В выпуске монет Casper только системная учетная запись может вызывать выпуск "mint", и у нее нет приватного ключа для создания действительных криптографических подписей, что означает, что только само программное обеспечение может выполнять контракты в контексте системной учетной записи

source: a convenience function for ``mint(0)`` which cannot fail because it is always allowed to create an empty purse
ru: удобная функция для ``mint(0)`` , которая не может давать ошибку, потому что всегда имеет право создать пустой кошелек

source: ``purse`` must have at least ``Read`` access rights
ru: Кошелек ``purse`` должен как минимум иметь право на чтение ``Read``

source: ``BalanceResult`` either returns the number of motes held by the ``purse``, or nothing if the ``URef`` is not valid
ru: Результат баланса либо возвращает некоторое количество монеток из кошелька "purse", либо ничего, если ссылка ``URef`` недействительна

source: Using purse ``URef``\ s
ru: Использование ссылок ``URef`` кошелька

source: It is dangerous to pass a purse's ``URef`` with ``Write`` permissions to a contract. A malicious contract may use that access to take more tokens than were intended or share that ``URef`` with another contract that was not meant to have that access. Therefore, if a contract requires a purse with ``Write`` permissions, it is always recommended to use a “payment purse” -- a purse used for that single transaction and nothing else. This ensures that even if the ``URef`` becomes compromised, it does not contain any more funds than the user intended on giving.
ru: Опасно передавать "URef" кошелька с разрешениями на "Запись" в контракт. Вредоносный контракт может использовать этот доступ, чтобы получить больше токенов, чем предполагалось, или поделиться этой "URef" с другим контрактом, который не должен был иметь такой доступ. Поэтому, если для контракта требуется кошелек с разрешениями на "Запись", всегда рекомендуется использовать “платежный кошелек” - payment purse - используемый для этой единственной транзакции и ничего больше. Это гарантирует, что даже если cсылка ``URef`` будет скомпрометирована, она не будет содержать больше средств, чем пользователь намеревался предоставить.

source: To avoid this inconvenience, it is a better practice for application developers intending to accept payment on-chain to make a version of their own purse ``URef`` with ``Read`` and ``Add`` access rights publicly available. This allows clients to pay via a transfer using their purse, without either party exposing ``Write`` access to any purse.
ru: Чтобы избежать этого неудобства, разработчикам приложений, намеревающимся принимать платежи по цепочке, рекомендуется сделать общедоступную версию ссылки "URef" своего собственного кошелька `с правами доступа "Чтение" и "Добавление". Это позволяет клиентам осуществлять оплату посредством перевода, используя свой кошелек, без предоставления какой-либо из сторон доступа на "запись" к любому кошельку.

source: Purses and Accounts
ru: Кошельки и аккаунты

source: All :ref:`accounts-head` on the Casper system have a purse associated with the Casper system mint, which we call the *main purse*. However, for security reasons, the ``URef`` of the main purse is only available to code running in the context of that account (i.e. only in payment or session code). Therefore, the mint’s ``transfer`` method which accepts ``URef``\ s is not the most convenient to use when transferring between account main purses. For this reason, Casper supplies a `transfer_to_account <https://docs.rs/casper-contract/latest/casper_contract/contract_api/system/fn.transfer_to_account.html>`_ function which takes the public key used to derive the :ref:`identity key <global-state-account-key>` of the account. This function uses the mint transfer function with the current account’s main purse as the ``source`` and the main purse of the account at the provided key as the ``target``.
ru: Все заголовки аккаунтов :ref:`accounts-head` в системе Casper имеют кошелек, связанный с выпуском монеток системой Casper, и это мы называем *главный кошелек*. Однако по соображениям безопасности "URef" основного кошелька доступна только для кода, выполняемого в контексте этой учетной записи (т. е. только в коде платежа или сеанса). Поэтому метод "перевода" контракта выпуска, который принимает "URef", не самый удобный для использования при переводе между основными кошельками аккаунта. По этой причине Casper предоставляет функцию для перевода в аккаунт 'transfer_to_account <https://docs.rs/casper-contract/latest/casper_contract/contract_api/system/fn.transfer_to_account.html>`_ функция, которая принимает открытый ключ, используемый для получения идентификационного ключа :ref:`identity key <global-state-account-key>` аккаунта. Эта функция использует функцию перевода mint с основным кошельком текущего аккаунта в качестве "источника" и основным кошельком аккаунта по предоставленному ключу в качестве "цели".
