Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/multi-sig/examples.po
Languages: ru

source: Additional Scenarios
ru: Дополнительные сценарии

source: This section walks you through additional scenarios where accounts have multiple associated keys for signing transactions at various thresholds.
ru: В этом разделе рассматриваются дополнительные сценарии, в которых аккаунты имеют несколько связанных ключей для подписания транзакций с различными пороговыми значениями.

source: Scenario 1: signing transactions with a single key
ru: Сценарий 1: подпись транзакций одинарным ключом

source: In this example, only one key can sign transactions in the name of this account. The key is "account-hash-a1…" under the `associated_keys`. If you sign the transaction using "account-hash-a1…", the signed transaction will have a `weight` equal to 1. For deployments or key management, the weight required is also 1. Therefore, the associated key meets the deployment and key management thresholds and can perform both actions.
ru: В этом примере только один ключ может подписывать транзакции от имени этой учетной записи. Ключ "account-hash-a1…" в разделе связанные ключи `associated_keys`. Если вы подпишете транзакцию с помощью "account-hash-a1…", подписанная транзакция будет иметь 'вес', равный 1. Для развертывания или управления ключами также требуется вес 1. Таким образом, связанный ключ соответствует пороговым значениям развертывания и управления ключами и может выполнять оба действия.

source: **Faucet account in scenario 1:**
ru: **Аккаунт крана в сценарии 1.**

source: Scenario 2: deploying with special keys
ru: Сценарий 2: развертывание со специальными ключами

source: In this example, you have two keys. One key can only perform deployments, while the second key can perform key management and deployments. The key with account address *a1* can deploy and make account changes, but the second key with account address *b2* can only deploy.
ru: В этом примере у вас есть два ключа. Один ключ может выполнять только развертывание, в то время как второй ключ может выполнять управление ключами и развертывание. Ключ с адресом аккаунта *a1* может развертываться и вносить изменения в аккаунт, но второй ключ с адресом аккаунта *b2* может только развертываться.

source: **Faucet account in scenario 2:**
ru: **Аккаунт крана в сценарии 2.**

source: Scenario 3: signing transactions with multiple keys
ru: Сценарий 3: подпись транзакций с мультиключами

source: Sometimes you will require multiple associated keys to execute a transaction. In this example, we have two associated keys with a weight equal to 1. To make changes to the account, you need to use both keys to sign the transaction. However, for deployment, each key can sign separately and perform deployments independently.
ru: Иногда для выполнения транзакции вам потребуется несколько связанных ключей. В этом примере у нас есть два связанных ключа с весом, равным 1. Чтобы внести изменения в аккаунт, вам необходимо использовать оба ключа для подписания транзакции. Однако для развертывания каждый ключ может подписываться отдельно и выполнять развертывание независимо.

source: **Faucet account in scenario 3:**
ru: **Аккаунт крана в сценарии 3.**

source: Scenario 4: managing lost or stolen keys
ru: Сценарий 4: управление потерянными или украденными ключами

source: In this example, you need two out of three associated keys to sign a transaction. Consider a transaction where you have one key in your browser, one key on your mobile phone, and one key in your safe. To do a transaction, first, you sign it with your browser extension (for example, Metamask). Afterward, a notification appears on your mobile phone requesting you to approve the transaction. With these two keys, you can complete the transaction. However, what if you lose the two keys on your browser and phone? Or, what if someone steals your browser and phone? In this case, you can use the safe key to remove the lost or stolen keys from the account. Notice that the safe key's weight is 3, which gives you the option to manage your account and add or remove keys. Also, the stolen or lost keys can only enable deployments, and in this case, no one can use them to change your account.
ru: В этом примере для подписания транзакции вам понадобятся два из трех связанных ключей. Рассмотрим транзакцию, в которой у вас есть один ключ в вашем браузере, один ключ на вашем мобильном телефоне и один ключ в вашем сейфе. Чтобы выполнить транзакцию, сначала вы подписываете ее с помощью расширения вашего браузера (например, Metamask). После этого на вашем мобильном телефоне появится уведомление с просьбой одобрить транзакцию. С помощью этих двух ключей вы можете завершить транзакцию. Однако, что делать, если вы потеряете два ключа в своем браузере и телефоне? Или, что, если кто-то украдет ваш браузер и телефон? В этом случае вы можете использовать безопасный ключ для удаления потерянных или украденных ключей из учетной записи. Обратите внимание, что вес безопасного ключа равен 3, что дает вам возможность управлять своей учетной записью и добавлять или удалять ключи. Кроме того, украденные или потерянные ключи могут разрешить только развертывание, и в этом случае никто не сможет использовать их для изменения вашей учетной записи.

source: **Faucet account in scenario 4:**
ru: **Аккаунт крана в сценарии 4.**

source: Scenario 5: managing accounts with multiple keys
ru: Сценарий 5: управление аккаунтами с мультиключами

source: This example builds upon the previous example, where you can set up multiple safe keys for account management. In this scenario, the safe keys have the weight required to manage your keys and account.
ru: Этот пример основан на предыдущем примере, где вы можете настроить несколько безопасных ключей для управления аккаунтами. В этом случае безопасные ключи имеют вес, необходимый для управления вашими ключами и аккаунтом.

source: **Faucet account in scenario 5:**
ru: **Аккаунт крана в сценарии 5.**

source: Scenario 6: losing your primary account key
ru: Сценарий 6: при потере вашего первичного ключа аккаунта

source: Suppose you lose your account key; in this case, "account-hash-00…", you can set up other keys to execute transactions. Although not recommended, you can throw away the private key of your account or set its weight to zero, and you would still be able to execute transactions if your faucet account has backup keys that can perform key management.
ru: Предположим, вы потеряли ключ своей учетной записи; в этом случае "account-hash-00…", вы можете настроить другие ключи для выполнения транзакций. Хотя это и не рекомендуется, вы можете выбросить закрытый ключ своего аккаунта или установить его вес равным нулю, и вы все равно сможете выполнять транзакции, если в вашем аккаунте крана есть резервные ключи, которые могут выполнять управление ключами.

source: **Faucet account in scenario 6:**
ru: **Аккаунт крана в сценарии 6.**
