Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/multi-sig/introduction.po
Languages: ru

source: Concepts
ru: Концепции

source: The Casper implementation of multiple signatures is unique and allows you to set up and customize access to your account and deployments.
ru: В Casper реализация мультиподписей уникальна и позволяет настроить и кастомизировать доступ к вашим аккаунтам и развертываниям.

source: Many companies handle large transactions and use smart contracts to manage tokens. However, these contracts need to be audited and secure and require a significant investment in setup and maintenance.
ru: Многие компании обрабатывают крупные транзакции и используют смарт-контракты для управления токенами. Однако эти контракты должны быть проверены и защищены, а также требуют значительных инвестиций в настройку и техническое обслуживание.

source: Casper enables you to sign anything with its multi-signature (multi-sig) implementation. For example, you do not need a multi-sig wallet to call a feature from a smart contract. Instead, you can use the multi-sig feature at the account level and sign your account with multiple keys.
ru: Casper позволяет подписывать что угодно с помощью реализации с несколькими подписями (multi-sig). Например, вам не нужен многозначный кошелек для вызова функции из смарт-контракта. Вместо этого вы можете использовать функцию multi-sig на уровне учетной записи и подписать свою учетную запись несколькими ключами.

source: Your `Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ is a cryptographically secured gateway into the Casper Network, and you can set it up using `the Casper Permissions Model <https://docs.casperlabs.io/en/latest/implementation/accounts.html#permissions-model>`_.
ru: Ваш аккаунт `Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ является криптографически защищенным входом в сеть Casper, и вы можете настроить его с помощью модели разрешений `the Casper Permissions Model <https://docs.casperlabs.io/en/latest/implementation/accounts.html#permissions-model>`_.

source: The account contains associated keys and action thresholds:
ru: Аккаунт содержит связанные ключи и пороговые значения действий:

source: The **associated keys** of an account are the set of public keys allowed to provide signatures on account actions.
ru: **Связанные ключи** аккаунта - это набор публичных ключей, которые имеют право предоставлять подписи для действий в аккаунте.

source: An account can perform two types of actions: **deployment** and **key management**.
ru: Аккаунт может осуществлять два типа действий: **развертывание** и **управление ключами**.

source: The **action thresholds** in the account data structure set a **weight**, which you must meet to perform an action.
ru: **Пороговые значения действий** в информационной структуре аккаунта настраивают **вес**, который мы должны задать для осуществлений действий.

source: For more information, please review the `Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_.
ru: Для долее подробной информации зайдите в раздел `Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_.
