Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/theory/index.po
Languages: ru

source: Introduction
ru: Введение

source: Theory
ru: Теория

source: This is version 3.0 of technical specification and it corresponds to April 2020 release of our platform ("Alpha Testnet").
ru: Это версия 3.0 технической спецификации, и она соответствует выпуску нашей платформы в апреле 2020 года ("Alpha Testnet").

source: To build a proof-of-stake blockchain, one must follow this general recipe:
ru: Чтобы собрать proof-of-stake блокчейн, нужно следовать этому основному рецепту:

source: Pick the core consensus protocol (a machinery that allows to do distributed selection of one element from a finite set).
ru: Выберите основной протокол консенсуса (механизм, позволяющий распределенно выбирать один элемент из конечного набора).

source: Pick the model of transactions ledger (transactions and blocks structure show up here).
ru: Выберите модель книги транзакций (здесь отображается структура транзакций и блоков).

source: Apply the core consensus to the ledger, i.e. establish consensus-based way of extending the ledger by blockchain participants. Ensure that liveness theorem can be proven for the resulting design.
ru: Примените основной консенсус к бухгалтерской книге, т. е. Установите основанный на консенсусе способ расширения бухгалтерской книги участниками блокчейна. Убедитесь, что теорема о жизнеспособности может быть доказана для результирующей конструкции.

source: Plug-in stakes management solution.
ru: Подключите решение для управления ставками.

source: Plug-in the suitable computing model (i.e. smart contracts virtual machine).
ru: Подключите подходящую вычислительную модель (т. е. виртуальную машину смарт-контрактов).

source: The "Theory" chapter explains how we approached steps (1) ... (4) in the abstract way, while implementation-level details are specified in "Casper Blockchain Design" chapter. The outline of material presented is:
ru: В главе "Теория" объясняется, как мы подошли к шагам (1) ... (4) абстрактно, в то время как детали на уровне реализации указаны в главе "Дизайн блокчейна Casper". Изложение представленного материала таково:

source: **Abstract Casper Consensus** - presents the core consensus protocol we use; concepts such as estimator, finality and fault-tolerance threshold and summits are explained
ru: **Абстрактный Консенсус Casper** - представляет основной протокол консенсуса, который мы используем; объясняются такие понятия, как оценка, окончательность и порог отказоустойчивости,а также саммиты

source: **Brickdag** - introduces the transactions ledger structure - bricks, blocks, ballots, parents tree and justifications graph
ru: **Brickdag** - представляет структуру книги транзакций - кирпичи, блоки, бюллетени, дерево родителей и график обоснований

source: **Leaders and rounds** - explains the mechanics of "Flat Highway", i.e. when the set of validators is fixed
ru: **Лидеры и раунды** - объясняет механику "Плоской трассы", т. е. когда набор валидаторов фиксирован

source: **Fork choice and finality** - applies the abstract Casper consensus to the brickdag
ru: **Выбор вилки и окончательность** - применяет абстрактный консенсус Casper к брикдагу

source: **Eras** - describes how we do stake management in Highway
ru: **Эра** - описывает, как мы управляем ставками на Highway

source: **Known limitations and features planned for ver 4.0** - sketches changes we anticipate to hit version 4.0 of this spec
ru: **Известные ограничения и функции, запланированные для версии 4.0** - изменения эскизов, которые мы ожидаем увидеть в версии 4.0 этой спецификации

source: Research trace
ru: Отслеживание исследований

source: The consensus solution used in Casper blockchain is a latest achievement of a research path that can be traced back to the 1980’s. Important milestones on this path are:
ru: Консенсусное решение, используемое в блокчейне Casper, является последним достижением исследовательского пути, который можно проследить с 1980-х годов. Важными вехами на этом пути являются:

source: 1980: The problem of byzantine consensus defined (Lamport, Shostak)
ru: 1980: Определена проблема византийского консенсуса (Лампорт, Шостак)

source: 1985: Impossibility of distributed consensus with one faulty process theorem (Fischer, Lynch, Paterson)
ru: 1985: Невозможность распределенного консенсуса с одной ошибочной теоремой о процессе (Фишер, Линч, Патерсон)

source: 1997: Proof-of-Work invented (Hashcash system)
ru: 1997: Изобретено Proof-of-Work (система Hashcash)

source: 1999: “Practical Byzantine Fault Tolerance” (PBFT) algorithm (Castro, Liskov)
ru: 1999: Алгоритм “Практическая византийская отказоустойчивость” (PBFT) (Кастро, Лисков)

source: 2008: Bitcoin invented (Satoshi Nakamoto)
ru: 2008: Изобретен биткоин (Сатоши Накамото)

source: 2012: First proof-of-stake cryptocurrency system created (Peercoin system)
ru: 2012: Создана первая система криптовалюты с Proof-of-Stake (система Peercoin)

source: 2013: Ethereum invented - cryptocurrency idea generalized to a decentralized general-purpose computing platform (Vitalik Buterin)
ru: 2013: Изобретен Ethereum - идея криптовалюты, обобщенная на децентрализованную вычислительную платформу общего назначения (Виталик Бутерин)

source: 2013: “Greedy Heaviest Observed Subtree” (GHOST) algorithm introduced (Sompolinsky, Zohar)
ru: 2013: Введен алгоритм” Жадное самое тяжелое наблюдаемое поддерево " (GHOST) (Сомполинский, Зоар)

source: 2015: Blockchain idea extended to “block DAG” - “Inclusive Block Chain Protocols” (Lewenberg, Sompolinsky, Zohar)
ru: 2015: Идея блокчейна распространилась на “блок DAG” - “Инклюзивные протоколы блокчейн” (Левенберг, Сомполински, Зоар)

source: 2017: First draft version of Casper protocol spec published (Ethereum research group, Vlad Zamfir)
ru: 2017: Опубликован первый проект спецификации протокола Casper (исследовательская группа Ethereum, Влад Замфир)

source: Jul 2018: First implementation of proof-of-stake blockchain built on Casper-GHOST-Blockdag combination attempted
ru: Июль 2018: Предпринята первая попытка внедрения блокчейна с proof-of-stake, построенного на комбинации Casper-GHOST-Blockdag

source: Dec 2018: CBC Casper protocol 1.0 specification (Ethereum research group, Vlad Zamfir)
ru: Декабрь 2018: Спецификация протокола CBC Casper 1.0 (исследовательская группа Ethereum, Влад Замфир)

source: Sep 2019: Highway Protocol (Daniel Kane, Vlad Zamfir, Andreas Fackler)
ru: Сентябрь 2019: Протокол Highway (Дэниел Кейн, Влад Замфир, Андреас Факлер)
