Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: ru

source: **Main-tree** encodes the multi-variant progress of a transaction's history. When a validator creating a block B picks block A as the main parent of B, it means “I want transactions included in B to extend the history of the blockchain that ended at block A with all transactions in A already executed”. This tree is analogous to a similar tree of blocks that forms in a previous generation of blockchains, like Bitcoin or Ethereum.
ru: **Главное дерево** кодирует многовариантный ход истории транзакции. Когда валидатор, создающий блок B, выбирает блок A в качестве основного родителя B, это означает: “Я хочу, чтобы транзакции, включенные в B, расширяли историю блокчейна, которая закончилась в блоке A, со всеми транзакциями уже выполненными в А”. Это дерево аналогично похожему дереву блоков, которое формируется в блокчейнах предыдущего поколения, таких как Биткоин или Эфириум.

source: **P-dag** and the concept of secondary parents, corresponds to “merging of histories” -- a subtle optimization on the way we process transactions. In blockchains such as Ethereum, effectively only a single path of the main-tree ends up as “transactions that have been actually executed” while all the rest of the main-tree ends up being wasted, or - as we say - “orphaned”. In fact, the amount of wasted work can be reduced by “merging”. While creating a new block, a validator performs careful analysis of all branches of the main-tree and attempts to merge as many of them possible without introducing a concurrency conflict.
ru: **P-dag** и концепция вторичных родителей соответствует “слиянию историй” - тонкой оптимизации способа обработки транзакций. В блокчейнах, таких как Ethereum, фактически только один путь главного дерева заканчивается как “транзакции, которые были фактически выполнены”, в то время как все остальное основное дерево оказывается потраченным впустую или, как мы говорим, “осиротевшим”. На самом деле, количество потраченной впустую работы может быть уменьшено путем “слияния”. При создании нового блока валидатор выполняет тщательный анализ всех ветвей главного дерева и пытается объединить как можно больше из них, не создавая конфликта параллелизма.

source: Core mechanics of the blockchain
ru: Основная механика блокчейн

source: The blockdag emerges as a combination of these central ideas:
ru: Блокдаг возникает как комбинация этих центральных идей:

source: Independently proposing updates of the shared database inevitably leads to a tree of transactions (blocks) because the proposing validator must choose which version of history it is about to extend. This is how the **main-tree** pops up.
ru: Независимое предложение обновлений общей базы данных неизбежно приводит к дереву транзакций (блоков), поскольку предлагающий валидатор должен выбрать, какую версию истории он собирается расширить. Вот как появляется **главное дерево**.

source: All that remains is to add the mechanics for validators to collectively agree on which branch of the main-tree is the “official” one.
ru: Все, что остается, это добавить механику для валидаторов, чтобы коллективно договориться о том, какая ветвь главного дерева является “официальной".

source: We solve this problem by recursively applying the Abstract Casper Consensus (a.k.a. ACC).
ru: Мы решаем эту проблему путем рекурсивного применения Абстрактного консенсуса Casper (он же ACC).

source: The Secondary parents idea is a further refinement of the solution by merging as many non-agreed paths of a main-tree as possible without introducing inconsistencies.
ru: Идея вторичных родителей заключается в дальнейшем уточнении решения путем объединения как можно большего числа несогласованных путей главного дерева без внесения несоответствий.

source: The single most crucial trick here is the recursive application of the Abstract Casper Consensus -- to first try to understand this trick before diving into detailed specs of how validators and finalizers operate.
ru: Самым важным трюком здесь является рекурсивное применение Абстрактного консенсуса Casper - сначала попытаться понять этот трюк, прежде чем углубляться в подробные спецификации того, как работают валидаторы и финализаторы.

source: Let **b** be any block. So, **b** is a vertex in the main-tree. We will consider a projection of validators P2P protocol to a particular Abstract Casper Consensus model instance we will be calling **b-game**.
ru: Пусть **b** будет любым блоком. Итак, **b** - это вершина в главном дереве. Мы рассмотрим проекцию протокола P2P валидаторов на конкретный абстрактный экземпляр модели консенсуса Casper, который мы будем называть **b-game**.

source: Abstract Casper Consensus concept
ru: Концепция абстрактного консенсуса Casper

source: How this concept maps to b-game
ru: Как эта концепция соотносится с b-игрой

source: validators
ru: валидаторы

source: validators with non-zero weight in post-state of **b**
ru: валидаторы с ненулевым весом в пост-состоянии **b**

source: validator weights
ru: вес валидаторов

source: **weights-map(globals-states-db(b.po st-state-hash))**
ru: **карта весов(globals-states-db(b.po st-state-hash))**

source: message
ru: сообщение

source: message (= block or ballot)
ru: сообщение (= блок или бюллетень)

source: consensus value
ru: значение консенсуса

source: direct child of **b** in the **main-tree**
ru: прямой ребенок **b** в **главном дереве**

source: message **m** is voting for consensus value **c**
ru: сообщение **m** голосует за консенсусное значение **c**

source: for a block **m**: **m** is a descendant of **c** along the **main-tree**, for a ballot **m**: **m.target-block** is a descendant of **c** along the **main-tree** when above conditions are not met, we consider **m** as voting for nothing (empty vote)
ru: для блока **m**: **m** является потомком **c** вдоль **главного дерева**, для бюллетеня **m**: **m.целевой блок** является потомком **c** вдоль **главного дерева** когда вышеуказанные условия не выполняются, мы рассматриваем **m** как голосование ни за что (пустое голосование)

source: The contents of the table above may be explained as follows:
ru: Содержание приведенной выше таблицы может быть объяснено следующим образом:

source: Hypothetically assuming that validators already achieved consensus on the block **b** as being the part of an “official” chain of blocks, they will have to decide which direct child of **b** (in main-tree) will be the next “official” chain.
ru: Гипотетически предполагая, что валидаторы уже достигли консенсуса по блоку **b** как части “официальной” цепочки блоков, им придется решить, какой прямой потомок **b** (в главном дереве) будет следующей “официальной” цепочкой.

source: So the focus now is on the block **b** and on its direct main-tree children.
ru: Поэтому сейчас основное внимание уделяется блоку **b** и его прямым дочерним элементам главного дерева.

source: We setup the Abstract Casper Consensus instance “relative to block **b**” where consensus values are direct children of **b**.
ru: Мы настраиваем абстрактный экземпляр консенсуса Casper “относительно блока **b**”, где значения консенсуса являются прямыми потомками **b**.

source: Any block **x** can be seen as a vote for some child of **b** only if **x** is a descendant of **b** in the main-tree. So if **x** is not a descendant of **b**, we consider **x** as carrying an empty vote.
ru: Любой блок **x** можно рассматривать как голосование за какого-либо потомка **b** только в том случае, если **x** является потомком **b** в главном дереве. Поэтому, если **x** не является потомком **b**, мы считаем, что **x** имеет пустой голос.

source: **Note:** when defining the players of **b-game**, we exclude all equivocators, as seen in the current protocol state. This means that b-game is not “absolute”, it is rather depending on the current perspective on the blockchain that given validator has. Also, the collection of equivocators grows over time, which means that over time we may need to recalculate b-game, excluding more validators. This aspect plays a crucial role in how **finalizers** work - (*see below* the topic **Operation of a finalizer**).
ru: **Примечание:** при определении игроков **b-игры** мы исключаем всех уклоняющихся, как видно из текущего состояния протокола. Это означает, что b-игра не является “абсолютной”, она скорее зависит от текущей точки зрения на блокчейн, которую имеет данный валидатор. Кроме того, коллекция двусмыслителей растет с течением времени, а это означает, что со временем нам может потребоваться пересчитать b-игру, исключая большее количество валидаторов. Этот аспект играет решающую роль в том, как работают **финализаторы** - (*см. Ниже* раздел **Работа финализатора**).

source: Not all **b-games** tend to be equally important. What happens is presented with the following pattern:
ru: Не все **b-игры**, как правило, одинаково важны. То, что происходит, представлено следующей схемой:

source: The **Genesis** block is given. So, **Genesis-game** is the first game.
ru: Дан блок **Генезис**. Итак, **Genesis-игра** - это первая игра.

source: As the blockdag grows, the **Genesis-game** is progressing towards finality.
ru: По мере роста блокдага **Генезис-игра** продвигается к завершению.

source: Finality of the **Genesis-game** means picking some direct child of **Genesis**. Let us name this child **LFB1**
ru: Завершенность **Genesis-игры** означает выбор какого-либо прямого потомка **Genesis**. Давайте назовем этого ребенка **LFB1**

source: Then, the **LFB1-game** becomes the “important” game that everybody looks at.
ru: Затем **LFB1-игра** становится “важной” игрой, на которую все смотрят.

source: As the blockdag grows, the **LFB1-game** is progressing towards finality.
ru: По мере роста блокдага **LFB1-игра** продвигается к завершению.

source: Finality of the **LFB1-game** means picking some direct child of **LFB1**. Let us name this child **LFB2**
ru: Завершенность **LFB1-игры** означает выбор какого-либо прямого потомка **LFB1**. Давайте назовем этого ребенка **LFB2**

source: This pattern goes on forever.
ru: И такой паттерн продолжается бесконечно.

source: “LFB” stands for “last finalized block”. For symmetry, we set **LFB0** = **Genesis**.
ru: "LFB” означает “последний завершенный блок”. Для симметрии мы задаем **LFB0** = **Генезис**.

source: Why do we need ballots ?
ru: Почему нам нужны бюллетени?

source: The security of proof-of-stake blockchain is based on the stake in two ways:
ru: Безопасность блокчейна с подтверждением ставки Proof-of-Stake основана на ставке - stake - двумя способами:

source: Large investment (=money) is needed to revert/overtake the history of transactions using honest means.
ru: Большие инвестиции (=деньги) необходимы, чтобы вернуть/обогнать историю транзакций с использованием честных средств.

source: Malicious behavior (= hacking) implies that the stake will get slashed.
ru: Вредоносное поведение (= хакинг) подразумевает, что ставка будет снижена.

source: Therefore, we would like only bonded validators to be able to participate in blockchain evolution. The problem here is that - when a validator unbonds, some of the **b-games** he was a player of might not be completed (= finalized) yet. We would like to allow the validator to still participate in these games while not allowing him to join new games. This is where ballots come into play. Ballots make it possible for a validator that is no longer bonded to continue the consensus game.
ru: Поэтому мы хотели бы, чтобы только связанные валидаторы могли участвовать в эволюции блокчейна. Проблема здесь в том, что - когда валидатор отключается, некоторые из **b-игр**, в которых он был игроком, могут быть еще не завершены (= финализированы). Мы хотели бы разрешить валидатору по-прежнему участвовать в этих играх, не позволяя ему присоединяться к новым играм. Вот тут-то и вступают в игру бюллетени для голосования. Бюллетени позволяют валидатору, который больше не связан обязательствами, продолжить игру на основе консенсуса.

source: Merging of histories
ru: Слияние историй

source: Topological sortings of p-past-cone
ru: Топологические сортировки p-past-конуса

source: This is a previous example of a blockdag, reduced to **p-dag** only:
ru: Это предыдущий пример блокдага, уменьшенный только до **p-dag** :

source: We define **p-past-cone(b)** as the set of all blocks :math:`x` such that :math:`x \leqslant b` (in the POSET corresponding to p-dag, :math:`x \leqslant y \iff y \rightarrow x`).
ru: Мы определяем **p-past-cone(b)** как набор всех блоков :math:`x` такой, что :math:`x \leqslant b` (в наборе POSET, соответствующем p-dag,:math:`x \leqslant y \iff y \rightarrow x`).

source: **Example:** Let’s look at the block :math:`3`. Its p-past-cone is :math:`\{Genesis, 1, 2, 3\}`. Let’s look at the block :math:`9`. Its p-past-cone is :math:`\{Genesis, 1,2,3,4,5,9\}`.
ru: **Пример:** Давайте посмотрим на этот блок :math:`3`. Его p-past-cone - :math:`\{Genesis, 1, 2, 3\}`. Давайте посмотрим на блок :math:`9`. Его p-past-cone - :math:`\{Genesis, 1,2,3,4,5,9\}`.

source: Of course, any **p-past-cone(b)** inherits the order from the whole **p-dag**, so it can be seen as a POSET as well.
ru: Конечно, любой **p-past-конус(b)** наследует порядок от целого **p-dag**, поэтому его также можно рассматривать как набор POSET.

source: For :math:`\langle A,R\rangle` any POSET, topological sorting of :math:`\langle A,R\rangle` is any linear order :math:`\langle A,T\rangle` such that :math:`identity: \langle A,R\rangle \rightarrow \langle A,T\rangle` is monotonic. In other words, topological sorting is converting a POSET into a total order in a way that preserves the original order. For a given POSET, this can usually be done in many ways.
ru: Для :math:`\langle A,R\rangle` любое частично упорядоченное множество, топологически сортирующее :math:`\langle A,R\rangle` это любой линейный порядок :math:`\langle A,T\rangle` такой, что :math:`identity: \langle A,R\rangle \rightarrow \langle A,T\rangle` является монотонной. Другими словами, топологическая сортировка конвертирует частично упорядоченное множество POSET в полностью упорядоченное, путем, который сохраняет изначальный порядок. Для данного частично упорядоченного множества, это может быть обычно сделано множеством способов.

source: \ **Example:**\ Let’s take the :math:`p\_past\_cone(3)` from our example. As a POSET it looks like this:
ru: \ **Пример:**\ Возьмем :math:`p\_past\_cone(3)` из нашего примера. В качестве частично упорядоченного множества оно выглядит так:

source: It can be topo-sorted in two ways only:
ru: Оно может быть топологически отсортировано только двумя способами:

source: Example: Let’s take the p-past-cone(9) from our example. As a POSET it looks like this:
ru: Пример: возьмем p-past-cone(9) из нашего примера. В качестве частично упорядоченного множества оно выглядит так:

source: It can be topo-sorted in many ways. One such topo-sort is shown below:
ru: Он может быть отсортирован по топологии многими способами. Одна из таких топографических сортировок показана ниже:

source: The context of merging problem
ru: Контекст проблемы слияния

source: Let’s assume that current p-dag as seen by a validator **v** looks like this:
ru: Давайте предположим, что текущий p-dag, как его видит валидатор **v**, выглядит так:

source: To add a new block :math:`x`, validator :math:`V` needs to decide which blocks to take as parents of :math:`x`. In other words, decide which variants of a transactions history block :math:`x` will continue. Merging is all about defining what it means that **x** continues more than one version of the history:
ru: Чтобы добавить новый блок :math:`x`, валидатор :math:`V` должен решить, какие блоки взять в качестве родителей :math:`x`. Другими словами, решить, какие варианты транзакций исторический блок :math:`x` продолжит. Слияние здесь говорит об определении, что значит **x** продолжает более одной версий истории:

source: We have blocks 8, 9 and 10 as current tips of p-dag, so they are candidates for becoming parents of the new block. But usually, we won’t be able to take all such tips as parents because the versions of the transactions history they represent are in conflict.
ru: У нас есть блоки 8, 9 и 10 в качестве текущих советов p-dag, поэтому они являются кандидатами на то, чтобы стать родителями нового блока. Но обычно мы, как родители, не сможем воспользоваться всеми такими советами, потому что версии истории транзакций, которые они представляют, находятся в конфликте.

source: Formal definition of merging
ru: Формальное определение слияния

source: We say that a set of blocks :math:`B = \{b_1, b_2, ..., b_n\}` is **mergeable** (= **not in conflict**) when the following holds:
ru: Мы говорим, что набор блоков :math:`B = \{b_1, b_2, ..., b_n\}` является **объединяемым** (= **не конфликтует**), когда выполняется следующее:

source: take the sum :math:`S` of :math:`p\_past\_cone(b_i)` for :math:`i=1,..., n` - this is a sub-POSET of p-dag
ru: возьмем сумму :math:`S` от :math:`p\_past\_cone(b_i)` для :math:`i=1,..., n` - это частично упорядоченное подмножество p-dag

source: given any topo-sort :math:`T` of :math:`S`
ru: с любой топологической сортировкой: :math:`T` из :math:`S`

source: the execution of transactions in :math:`B` along :math:`T` give:
ru: выполнение транзакций в: :math:`B` с :math:`T` дают:

source: the same final global state (regardless of the selection of **T)**
ru: такое же окончательное глобальное состояние (независимо от выборки **Т)**

source: the same subset of transactions that failed (regardless of the selection of **T**)
ru: то же подмножество транзакций, которое дало ошибку (независимо от выборки **Т)**

source: Operation of a validator
ru: Работа валидатора

source: The spec is written from the perspective of a validator. We say it as **local validator** in order to reference the validator which is running the algorithm. Let **vid** be the id of the local validator.
ru: Эта спецификация написана с точки зрения валидатора. Мы говорим о нем как о **локальном валидаторе** для того, чтобы обратиться к валидатору, который запускает алгоритм. Пусть **vid** будет идентификатором локального валидатора.

source: Validators P2P protocol - messages
ru: Протокол P2P валидатора - сообщения

source: Validators exchange messages which can be of 2 types:
ru: Валидаторы обмениваются сообщениями, которые могут быть 2-х типов:

source: **blocks**
ru: **блоки**

source: **ballots**
ru: **бюллетени**

source: A **block** contains the following data:
ru: **Блок** содержит следующие данные:

source: **block id**
ru: **id блока**

source: **creator id** (= id of validator that created this block)
ru: **id создателя** (= id валидатора, создавшего этот блок)

source: **main parent** (id of another block)
ru: **главный родитель** (id другого блока)

source: **secondary parents** (collection of block ids, may be empty)
ru: **второстепенные родители** (коллекция id блоков, могут быть пустыми)

source: **justifications** (collection of message ids that the creator confirms as seen at the moment of creation of this block; excluding main parent and secondary parents; may be empty)
ru: **обоснования** (коллекция id сообщений, которые создатель подтверждает, как он видит на момент создания этого блока; исключая главного родителя и второстепенных родителей; могут быть пустыми)

source: **transactions list** (nonempty)
ru: **список транзакций** (не пустой)

source: **pre-state-hash** - hash of global state that represents state after executing all parents of this block
ru: **хеш предсостояния** - хеш глобального состояния, который представляет состояние после исполнения всех родительских блоков этого блока

source: **post-state hash** - hash of global state achieved after executing transactions in this block (and all previous blocks, as implied by p-dag)
ru: **хеш пост-состояния** - хеш глобального состояния, достигнутый после исполнения транзакций в этом блоке (и всех предыдущих блоках, как подразумевается в p-dag)

source: For a block :math:`b` we define the collection :math:`b.all\_justifications` as main parent + secondary parents + justifications. This collection is always non-empty because **main parent** is a mandatory field.
ru: Для блока :math:`b` мы определяем коллекцию обоснований :math:`b.all\_justifications` как главного родителя + второстепенных родителей + обоснования. Эта коллекция всегда не пустая, потому что **главный родитель** - обязательное поле.

source: A **ballot** contains the following data:
ru: **Бюллетень** содержит следующую информацию:

source: **creator id** (= id of validator that created this ballot)
ru: **id создателя** (= id валидатора, создавшего этот бюллетень)

source: **target block** (id of a block)
ru: **целевой блок** (id блока)

source: **justifications** (collection of message ids that the creator confirms as seen at the moment of creation of this ballot, excluding the target block; may be empty)
ru: **обоснования** (коллекция id сообщений, которые создатель подтверждает, как он видит на момент создания этого бюллетеня; исключая целевой блок; могут быть пустыми)

source: For a ballot **b** we define the collection :math:`b.all\_justifications` as target block + additional justifications. This collection is always non-empty because target block is a mandatory field.
ru: Для бюллетеня **b** мы определяем коллекцию обоснований :math:`b.all\_justifications` как целевой блок + дополнительные обоснования. Эта коллекция всегда не пустая, так как целевой блок - обязательное поле.

source: From the definitions above it follows that for every message :math:`m` there is a **j-dag** path from :math:`m` to :math:`Genesis`.
ru: Из определений данных выше следует, что для каждого сообщения :math:`m` есть **j-dag** путь из :math:`m` в :math:`Genesis`.

source: Validators P2P protocol - behavior
ru: P2P протокол валидаторов - поведение

source: We use the same assumptions on a message-passing network as were stated in the Abstract Casper Consensus model. So, validators only exchange information by broadcasting messages where the broadcasting implementation provides an exactly-once delivery guarantee, but the delays and shuffling of messages are arbitrary.
ru: Мы используем те же предположения в сети передачи сообщений, что и в Абстрактной модели консенсуса Casper. Таким образом, валидаторы обмениваются информацией только посредством широковещательных сообщений, когда реализация широковещания обеспечивает гарантию доставки точно один раз, но задержки и перетасовка сообщений являются произвольными.

source: During its lifetime, a validator maintains the following data structures:
ru: В течение всего срока работы валидатор поддерживает следующие структуры данных:

source: **deploys-buffer** - a buffer of transactions sent by clients, to be executed on the blockchain computer
ru: **буфер развертываний** - буфер транзакций, отправленных клиентами на развертывание в блокчейн-компьютер

source: **blockdag** - keeping all blocks and ballots either produced by or received from other validators
ru: **блокдаг** - удерживает все блоки и бюллетени произведенные или полученные валидаторами

source: **messages-buffer** - a buffer of messages received, but not yet incorporated into the **blockdag**
ru: **буфер сообщений** - буфе сообщений, полученных, но еще не включенных в **блокдаг**

source: **latest-honest-messages** - a mapping from validator id to message id, pointing every validator known in the **blockdag**, excluding **equivocators**, to the corresponding swimlane tip
ru: **последние честные сообщения** - картировка из id валидатора до id сообщений, указывающая всех известных в **блокдаг** валидаторов, исключая **двусмысленных**, с соответствующей заметкой плавательной дорожки
