Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: ru

source: **FTT(0) = ceiling(WP \* total-weight(post-state of Genesis))**
ru: **FTT(0) = потолок(WP \* total-weight(post-state of Genesis))**

source: Behaviour - the general plan
ru: Поведение - общий план

source: The operation of a finalizer can be decomposed as the following, partially independent activities:
ru: Работу финализатора можно разложить на следующие частично независимые действия:

source: Maintaining equivocators collection corresponding to current protocol state.
ru: Поддержание коллекции двусмысленностей, соответствующей текущему состоянию протокола.

source: Building the **LFB** chain
ru: Построение цепочки **LFB**

source: Propagating **LFB** chain finality via secondary parents (indirect finalization).
ru: Распространение **LFB** завершенности цепочки через вторичных родителей (косвенное завершение).

source: Monitoring old games in **LFB** chain for the possibility of equivocation catastrophe.
ru: Мониторинг старых игр в цепочке **LFB** на предмет возможности катастрофы с двусмысленностями.

source: Reacting to equivocation catastrophe (by recalculating the **LFB** chain).
ru: Реагирование на катастрофу двусмысленности (путем пересчета цепочки **LFB**).

source: Publishing the stream of finalized blocks (over some streaming API) - this includes possibly also maintaining the collection of subscribers.
ru: Публикация потока завершенных блоков (через некоторый потоковый API) - это, возможно, также включает в себя ведение коллекции подписчиков.

source: LFB chain
ru: LFB цепочка

source: **LFB(i)** is supposed to be the “i-th last finalized block”. **LFB** chain is achieved in the following way:
ru: **LFB(i)** должен быть “i-последним завершенным блоком”. **Цепочка LFB** достигается следующим образом:

source: Take **LFB(0) = Genesis**
ru: Возьмем **LFB(0) = Genesis**

source: Let’s assume that LFB(m) is the last-so-far element of the chain. So in other words, it is the last finalized block.
ru: Давайте предположим, что LFB(m) является последним на данный момент элементом цепочки. Другими словами, это последний завершенный блок.

source: For deciding which main-tree child of LFB(m) should be taken as LFB(m+1) we need to start a new empty instance of finality detector.
ru: Чтобы решить, какой дочерний элемент главного дерева LFB(m) следует считать LFB(m+1), нам нужно запустить новый пустой экземпляр детектора завершенности.

source: **initial-players(m)** = validators staked at post-state of **m**, excluding current contents of **equivocators**
ru: **начальные игроки(m)** = валидаторы, поставленные в состоянии после **m**, исключая текущее содержимое **двусмысленных игроков**

source: **excluded-players(m)** = empty set
ru: **исключено-игроки(m)** = пустой набор

source: Finality detector observes the LFB(m)-game, with:
ru: Детектор завершенности наблюдает за игрой LFB(m), с:

source: game-level acknowledgement level **K** same as defined by parameters of this finalizer
ru: уровнем подтверждения игрового уровня **K** таким же, как определен параметрами этого финализатора

source: **FTT(m) = ceiling(WP \* total-weight(post-state of m))**, where \**ceiling(_)*\* is integer rounding towards positive infinity.
ru: **FTT(m) = потолок(WP \* общий вес(постсостояние m))**, где \**потолок(_)*\* - целое число, округленное в сторону положительной бесконечности.

source: Once **LFB(m)**-game reaches finality, the next element of **LFB** chain is established.
ru: Как только **LFB(m)**-игра достигает завершения, устанавливается следующий элемент цепочки **LFB**.

source: Indirect finalization
ru: Непрямая финализация

source: Once **LFB(m)** is established, we consider the whole **p-past-cone(LFB(m))** as finalized.
ru: Как только **LFB(m)** будет установлен, мы рассмотрим весь **p-past-конус(LFB(m))** как завершенный.

source: Equivocation catastrophe
ru: Катастрофа двусмысленностей

source: For any **LFB(m)**, the **LFB(m)-game** may “crash” by total weight of equivocators exceeding **FTT(m)**. Such situation we call **the equivocation catastrophe**.
ru: Для любого **LFB(m)**, **LFB(m)-игра** может “рухнуть” из-за общего веса двусмысленностей, превышающих **FTT(m)**. Такую ситуацию мы называем **катастрофой двусмысленности**.

source: Discovery of equivocation catastrophe works as follows. -- Whenever a new message **m** is added to a local blockdag, the following handling is done by the finalizer:
ru: Обнаружение катастрофы двусмысленности работает следующим образом. -- Всякий раз, когда новое сообщение **m** добавляется в локальный блокдаг, завершитель выполняет следующую обработку:

source: If **m.creator** is already included in **equivocators** collection - do nothing.
ru: Если **m.creator** уже включен в коллекцию **двусмыслителей** - ничего не делайте.

source: Otherwise - check if m is not introducing a new equivocation. If yes - add **m.creator** to equivocators and:
ru: В противном случае - проверьте, не вводит ли m новую двусмысленность. Если да - добавьте **m.creator** к двусмысленностям и:

source: for every i such that m \in initial-players(i):
ru: для каждого i такого, что m \in начальные игроки(i):

source: add m to **excluded-players(i)**
ru: добавьте m к **исключенным-игрокам(i)**

source: using weights map from **LFB(i)** post-state, check if total weight of **excluded-players(i)** exceeds **FTT(i)**
ru: используя карту весов из **LFB(i)** постсостояния, проверьте, превышает ли общий вес **исключенных игроков(i)** *FTT(i)**

source: if for some **LFB(i)** exceeding **FTT(i)** case happened - take the smallest such **i** - we will call the block **LFB(i)** **the catastrophic point**
ru: если для какого - то **LFB(i)** превышения **FTT(i)** произошел случай - возьмем наименьший такой **i** - назовем блок **LFB(i)** **катастрофической точкой**

source: Once an equivocation catastrophe is discovered, the following handling must be applied:
ru: Как только обнаружена катастрофа двусмысленности, необходимо применить следующую обработку:

source: Starting from the catastrophic point, re-calculate the **LFB chain** (initializing initial players accordingly to current contents of **equivocators**).
ru: Начиная с катастрофической точки, пересчитайте **цепочку LFB** (инициализируя начальных игроков в соответствии с текущим содержанием **двусмыслителей**).

source: 2. Find the first **i** such that the new LFB-chain differs from old LFB chain at index **i**. Usually such **i** will be bigger than the catastrophic point. 2. Publish a rollback event at the level of external API. 4. Publish re-calculated LFB stream, starting from first difference.
ru: 2. Найдите первую **i** такую, чтобы новая цепочка LFB отличалась от старой цепочки LFB индексом **i**. Обычно такое **i** будет больше, чем катастрофическая точка. 2. Опубликуйте событие отката на уровне внешнего API. 4. Опубликуйте пересчитанный поток LFB, начиная с первой разницы.

source: External API of a finalizer
ru: Внешняя API финализатора

source: The API should be stream-based. The decision on the actual streaming technology to use is beyond the scope of this specification.
ru: API должен быть потоковым. Решение об использовании фактической потоковой технологии выходит за рамки данной спецификации.

source: We only assume that:
ru: Мы только предполагаем, что:

source: external software components may subscribe to the API (to be notified
ru: внешние программные компоненты могут подписаться на API (для уведомления

source: subscribed observers may unsubscribe
ru: подписавшиеся наблюдатели могут отказаться от подписки

source: what a subscribed observer receives is a sequence of events
ru: подписанный наблюдатель получает последовательность событий

source: **Events:**
ru: **События:**

source: Event type
ru: Тип события

source: Contents
ru: Содержание

source: Semantics
ru: Семантика

source: event idLFB(i).idisequence of indirectly finalized blocks
ru: событие idLFB(i).idi последовательность косвенно завершенных блоков

source: published as soon as **LFB(i)** is finalized
ru: публикуется, как только **LFB(i)** будет завершено

source: CATASTROPHY
ru: КАТАСТРОФА

source: event idsequence id of catastrophy point
ru: идентификатор события идентификатор последовательности точки катастрофы

source: signal that equivocation catastrophe happened
ru: сигнал о том, что произошла катастрофа с двусмысленностью

source: Event
ru: Событие

source: Current snapshot of LFB chain
ru: Текущий снимок цепочки LFB

source: CATASTROPHY(4, 2)
ru: КАТАСТРОФА(4, 2)
