Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: ru

source: Naive Casper Blockchain
ru: Наивный блокчейн Casper NCB

source: Introduction
ru: Введение

source: Blockchain is a P2P network where the collection of nodes (**validators**) concurrently update a decentralized, shared database. They do this by collectively building an ever-growing chain of **transactions**. For performance reasons transactions are bundled in **blocks**.
ru: Блокчейн-это P2P-сеть, в которой совокупность нод (**валидаторов**) одновременно обновляет децентрализованную общую базу данных. Они делают это, коллективно выстраивая постоянно растущую цепочку **транзакций**. По соображениям производительности транзакции объединяются в **блоки**.

source: For the “outside world”, the blockchain looks like a computer. This blockchain computer has a memory (= shared database) and can execute programs (= transactions). Execution of a program changes the state of the memory. Anybody can send a program to the computer and the computer will do a best effort attempt to execute this program.
ru: Для “внешнего мира” блокчейн выглядит как компьютер. Этот блокчейн-компьютер имеет память (= общую базу данных) и может выполнять программы (= транзакции). Выполнение программы изменяет состояние памяти. Любой может отправить программу на компьютер, и компьютер приложит все усилия, чтобы выполнить эту программу.

source: We say that a blockchain computer is **decentralized**, i.e. there is no single point of failure in the infrastructure. A significant portion of the network of validators could be suddenly destroyed and nevertheless the blockchain will continue to work. Also, the system is resistant to malicious validators (as long as the total weight of malicious validators is below 50% of the total weight of all validators).
ru: Мы говорим, что блокчейн-компьютер **децентрализован**, то есть в инфраструктуре нет единой точки отказа. Значительная часть сети валидаторов может быть внезапно уничтожена, и тем не менее блокчейн продолжит работать. Кроме того, система устойчива к вредоносным валидаторам (до тех пор, пока общий вес вредоносных валидаторов составляет менее 50% от общего веса всех валидаторов).

source: The core of blockchain mechanics is the continuous work of validators struggling to agree on a consistent history of programs executed on the blockchain computer. We describe this central idea as “achieving **consensus** on the chain of blocks”. Because every block contains a chain of transactions, this “consistent history” results in being a sequence of transactions.
ru: Ядром механики блокчейна является непрерывная работа валидаторов, пытающихся согласовать согласованную историю программ, выполняемых на блокчейн-компьютере. Мы описываем эту центральную идею как “достижение **консенсуса** по цепочке блоков”. Поскольку каждый блок содержит цепочку транзакций, эта “последовательная история” приводит к последовательности транзакций.

source: Note that in this spec we use the terms **shared database** and **blockchain computer memory** interchangeably.
ru: Обратите внимание, что в этой спецификации мы используем термины **общая база данных** и **блокчейн-память компьютера** взаимозаменяемо.

source: Computing model
ru: Вычислительная модель

source: Memory and programs
ru: Память и программы

source: We need to define the “computational semantics” of a blockchain computer; what programs are and how they execute. However, because the consensus protocol we introduce is compatible with a wide range of computing models, it is convenient to approach this abstractly. Therefore, we represent the “computational semantics” of a blockchain computer as a triple :math:`\langle GS, Zero, P\rangle` where:
ru: Нам нужно определить “вычислительную семантику” блокчейн-компьютера; что такое программы и как они выполняются. Однако, поскольку протокол консенсуса, который мы представляем, совместим с широким спектром вычислительных моделей, удобно подходить к этому абстрактно. Поэтому мы представляем “вычислительную семантику” блокчейн-компьютера в виде тройки :math:`\langle GS, Zero, P\rangle`, где:

source: :math:`GS` is a set of states of the shared database (think that each point :math:`gs \in GS` represents a “snapshot” of the shared database) we call “global states”
ru: :math:`GS` - это набор состояний общей базы данных (подумайте, что каждая точка :math:`gs \in GS` представляет собой "снимок" общей базы данных), который мы называем "глобальными состояниями".

source: :math:`Zero \in GS` is the initial state of the database
ru: :math:`Zero \in GS` это начальное состояние базы данных

source: :math:`P \subset Partial(GS \rightarrow GS)` is a non-empty set of partial functions from :math:`GS` to :math:`GS`, closed under composition; elements of :math:`P` we call **transactions** (we think of them as “executable programs”)
ru: :math:`P \subset Partial(GS \rightarrow GS)` - это непустой набор частичных функций от :math:`GS` до :math:`GS`, замкнутых по составу; элементы :math:`P` мы называем **транзакциями** (мы думаем о них как о “исполняемых программах”)

source: Given a state :math:`gs \in GS` and a transaction :math:`p \in P`, we can calculate the value :math:`p(gs)` only in the case when :math:`p` is defined at :math:`gs`. We refer to this as **the execution of p**.
ru: Учитывая состояние :math:`gs \in GS` и транзакцию :math:`p \in P`, мы можем вычислить значение :math:`p(gs)` только в том случае, когда :math:`p` определяется в :math:`gs`. Мы называем это **исполнением p**.

source: When :math:`p` is not defined at point :math:`gs`, we say that **execution of p on state gs failed**. This is how we represent errors in program execution.
ru: Когда :math:`p` не определена в точке :math:`gs`, мы говорим, что **выполнение p в состоянии gs не удалось**. Именно так мы представляем ошибки при выполнении программы.

source: Executing sequences of transactions
ru: Выполнение последовательности транзакций

source: We want to generalize this notion to sequences of transactions in such a way that the information on execution errors is retained.
ru: Мы хотим обобщить это понятие на последовательности транзакций таким образом, чтобы информация об ошибках выполнения сохранялась.

source: Having a sequence of transactions :math:`p_1, p_2, ...., p_n\in P` we'll keep the information on execution success/error as a function :math:`status: [1,2,...,n] \rightarrow \{false, true\}`.
ru: Имея последовательность транзакций :math:`p_1, p_2, ...., p_n\in P` мы сохраним информацию об успешном выполнении/ошибке в виде функции :math:`status: [1,2,...,n] \rightarrow \{false, true\}`.

source: For any :math:`p \in P` let :math:`\triangle p: GS \rightarrow GS` be a total function that extends :math:`p` by applying identity whenever :math:`p` is not defined, hence formally as:
ru: Для любой :math:`p \in P` пусть :math:`\triangle p: GS \rightarrow GS` будет полной функцией, которая расширяет :math:`p`, применяя идентификатор всякий раз, когда :math:`p` не определен, следовательно, формально как:

source: **Status(i)** represents the overall result (success vs failure) of the execution of **i-th** transaction in the sequence.
ru: **Статус(i)** представляет общий результат (успех или неудача) выполнения **i-й** транзакции в последовательности.

source: Let:
ru: Пусть:

source: :math:`TSeq` be the set of finite sequences of transactions: :math:`TSeq = P^{Int}`
ru: :math:`TSeq` будет набором законченных последовательностей транзакций: :math:`TSeq = P^{Int}`

source: :math:`StatusTraces` be the set of finite sequences of Booleans
ru: :math:`StatusTraces` будет набором законченных последовательностей логических значений

source: We define the execution of a sequence of transactions as:
ru: Мы определяем выполнение последовательности транзакций как:

source: … where:
ru: ... где:

source: Intuitively, **exec** takes a pair - the initial global state and a sequence of transactions to execute. The result is also a pair - the resulting global state reached by sequentially applying all transactions and a trace of this execution saying which transactions failed along the way.
ru: Интуитивно понятно, что **exec** принимает пару - начальное глобальное состояние и последовательность транзакций для выполнения. Результатом также является пара - результирующее глобальное состояние, достигнутое путем последовательного применения всех транзакций, и след этого выполнения, указывающий, какие транзакции завершились неудачей на этом пути.

source: Executing sequences of blocks
ru: Выполнение последовательности блоков

source: A block contains sequences of transactions. Given some initial global state :math:`gs \in GS`, whenever we say “execute a block” we mean executing the sequence of transactions it contains starting from :math:`gs`. We usually call :math:`gs` the **pre-state** of the block, and we say **post-state** to denote the resulting global state returned by :math:`exec(gs, sequence)`.
ru: Блок содержит последовательности транзакций. Учитывая некоторое начальное глобальное состояние :math:`gs \in GS`, всякий раз, когда мы говорим “выполнить блок”, мы имеем в виду выполнение последовательности транзакций, которые он содержит, начиная с :math:`gs`. Обычно мы называем :math:`gs` **предварительным состоянием** блока, и мы говорим **пост-состояние** для обозначения результирующего глобального состояния, возвращаемого :math:`exec(gs, sequence)`.

source: Given any sequence of blocks we may also **execute the sequence of blocks** because it is effectively a sequence of sequences of transactions, so it may be flattened to a single sequence of transactions.
ru: Учитывая любую последовательность блоков, мы также можем **выполнить последовательность блоков**, потому что она фактически представляет собой последовательность последовательностей транзакций, поэтому ее можно свести к одной последовательности транзакций.

source: Given any set of blocks :math:`B`, we sometimes consider different linear orders of such set. Given a linear order :math:`R` on set :math:`B`, we are speaking about **executing the set of blocks B along linear order R**, with the obvious semantics of taking all the blocks, arranging them in a sequence following the order :math:`R`, and then executing the resulting sequence of transactions.
ru: Учитывая любой набор блоков :math:`B`, мы иногда рассматриваем различные линейные порядки такого набора. Учитывая линейный порядок :math:`R` на множестве :math:`B`, мы говорим о **выполнении набора блоков B в линейном порядке R**, с очевидной семантикой взятия всех блоков, упорядочивания их в последовательности, следующей за порядком :math:`R`, а затем выполнения результирующей последовательности транзакций.

source: Blockchain participants
ru: Участники блокчейн

source: We envision the infrastructure of blockchain participants as a collection of actors (processes) communicating over a network, and where each process plays one of the following roles:
ru: Мы представляем инфраструктуру участников блокчейна как совокупность субъектов (процессов), взаимодействующих по сети, и где каждый процесс играет одну из следующих ролей:

source: **validators (aka “ring 0”)** - form a P2P network that attempts to reach consensus on the ever-growing history of executed transactions; they do this by creating and validating blocks
ru: **валидаторы (они же “кольцо 0”)** - формируют P2P-сеть, которая пытается достичь консенсуса по постоянно растущей истории выполненных транзакций; они делают это путем создания и проверки блоков

source: **finalizers (aka “ring 1”)** - they observe validators and try to deduce the subset of history that is considered as “confirmed” (the “confirmed” predicate is parameterized so to reflect the expected trust level)
ru: **финализаторы (они же “кольцо 1”)** - они наблюдают за валидаторами и пытаются вывести подмножество истории, которое считается “подтвержденным” (предикат “подтверждено” параметризован таким образом, чтобы отражать ожидаемый уровень доверия)

source: **clients (aka “ring 2” or “dapps”)** - use the blockchain computer - they send programs to be executed and react to execution results; a client connects to a validator (one or many) to send transactions while it also connects to a finalizer (one or many) to observe execution results
ru: **клиенты (они же “кольцо 2” или “dapps”)** - используют блокчейн - компьютер - они отправляют программы для выполнения и реагируют на результаты выполнения; клиент подключается к валидатору (одному или нескольким) для отправки транзакций, в то время как он также подключается к финализатору (одному или нескольким) для наблюдения за результатами выполнения

source: Stake management
ru: Управление ставками

source: In proof-of-stake blockchains, **stake** is a representation of the voting power a validator has. We leave the question of exact representation of stakes open. We only summarize here the minimal assumptions we need for the mechanics of the blockchain to work.
ru: В цепочках блокчейнов с подтверждением доли участия proof-of-stake, доля участия **стейк** - это представление права голоса, которым обладает валидатор. Мы оставляем открытым вопрос о точном представлении ставок. Здесь мы лишь резюмируем минимальные допущения, необходимые для работы механики блокчейна.

source: Encoding of stakes
ru: Кодирование стейков

source: The main assumption is that a global state encodes (among other things) the “weights map” - a mapping of validators to their voting power. So, mathematically we expect the existence of a function that assigns to every global state a function mapping validators to their weights:
ru: Основное предположение состоит в том, что глобальное состояние кодирует (среди прочего) “карту весов” - сопоставление валидаторов с их правом голоса. Итак, математически мы ожидаем существования функции, которая присваивает каждому глобальному состоянию функцию, сопоставляющую валидаторов их весам:

source: Intuitively, the stake of a validator will be (usually) defined by the amount of internal blockchain “money” allocated to the corresponding account.
ru: Интуитивно понятно, что доля - стейк - валидатора будет (обычно) определяться суммой внутренних “денег” блокчейна, выделенных на соответствующий счет.

source: Bonding and unbonding
ru: Бондинг и анбондинг

source: Blockchain users can increase/decrease the stake of a given validator. This is to happen via executing (special) transactions.
ru: Пользователи блокчейна могут увеличивать/уменьшать долю данного валидатора. Это должно произойти посредством выполнения (специальных) транзакций.

source: Minimal stake **MIN_STAKE** is a parameter of the blockchain.
ru: Минимальный стейк **MIN_STAKE** - это параметр блокчейна

source: Unbonding stages
ru: Стадии анбондинга

source: Unbonding is always a total unbonding -- a validator transitioning to stake=0. There is no partial unbonding.
ru: Анбондинг всегда полный - валидатор переходит к стейку= 0. Нет частичного анбондинга.

source: Unbonding must be go in stages, leading to the following states of a validator:
ru: Отсоединение должно проходить поэтапно, приводя к следующим состояниям валидатора:

source: While in STAKED, a validator can produce only blocks.
ru: Находясь в STAKED, валидатор может создавать только блоки.

source: While in VOTING_ONLY, a validator can produce only ballots.
ru: Находясь в VOTING_ONLY, валидатор может производить только бюллетени.

source: While in UNBONDING_ESCROW and ZEROED, a validator is not supposed to produce messages.
ru: Находясь в UNBONDING_ESCROW и ZEROED, валидатор не производит сообщений.

source: The how of transitioning between states is beyond the scope of this specification (it can be based on wall clock, p-time, j-daglevel, block generation and other approaches).
ru: Способ перехода между состояниями выходит за рамки данной спецификации (он может быть основан на настенных часах, p-времени, уровне j-dag, генерации блоков и других подходах).

source: Slashing
ru: Слэшинг

source: Slashing is forced unbonding where the money used for the stake is burned. The intention is to penalizing equivocators.
ru: Слэшинг - сокращение - это принудительный анбондинг, когда деньги, использованные для стейка, сгорают. Цель этой меры - наказание за двусмысленности.

source: Blockdag
ru: Блокдаг

source: Visual introduction
ru: Визуальное введение

source: The consensus protocol is based on a data structure we call a **blockdag**, represented as a graph it looks like the following:
ru: Протокол консенсуса основан на структуре данных, которую мы называем **блокдаг**, представленной в виде графика, который выглядит следующим образом:

source: The meaning of symbols:
ru: Значение символов:

source: The 3 types of vertices in the graph are as follows:
ru: 3 типа вершин в графике следующие:

source: **normal blocks** - contain transactions to be executed against the blockchain computer
ru: **обычные блоки** - содержат транзакции, которые должны быть выполнены на блокчейн-компьютере

source: **ballots** - do not contain transactions, but participate in the consensus
ru: **бюллетени** - не содержат транзакций, но участвуют в консенсусе

source: **genesis** - a special block that stands as a root node of the structure
ru: **генезис** - специальный блок, который выступает в качестве корневой ноды структуры

source: Additionally we say:
ru: Дополнительно мы говорим:

source: **block** - when we mean “normal block or genesis”
ru: **блок** - когда мы имеем в виду “обычный блок или генезис”

source: **message** - when we mean “normal block or ballot”
ru: **сообщение** - когда мы имеем в виду “обычный блок или бюллетень”

source: **vertex** - when we mean “normal block or ballot or genesis”
ru: **вершина** - когда мы имеем в виду “обычный блок, или бюллетень, или генезис”

source: We visually mark the creator of a message by placing it in a relevant swimlane. Genesis is outside swimlanes because genesis is given at blockchain initialization (= it does not have a creator).
ru: Мы визуально отмечаем создателя сообщения, помещая его в соответствующую плавательную дорожку. Генезис находится за пределами плавательных линий, потому что генезис дается при инициализации блокчейна (= у него нет создателя).

source: Every normal block points to its **main parent** block (we visualize this with red arrows). Hence, blocks form a tree we call the **main tree**.
ru: Каждый обычный блок указывает на свой **основной родительский** блок (мы визуализируем это красными стрелками). Следовательно, блоки образуют дерево, которое мы называем **главным деревом**.

source: Additionally, any normal block may point to an arbitrary number of blocks as **secondary parents**. We visualize them with blue arrows. Blocks + red arrows + blue arrows together form a directed acyclic graph we call **the p-dag**.
ru: Кроме того, любой обычный блок может указывать на произвольное количество блоков в качестве **вторичных родителей**. Мы визуализируем их синими стрелками. Блоки + красные стрелки + синие стрелки вместе образуют направленный ациклический граф, который мы называем **p-dag**.

source: Any ballot points to exactly one block. We call this block “the target block of a ballot”.
ru: Любой бюллетень указывает ровно на один блок. Мы называем этот блок “целевым блоком избирательного бюллетеня”.

source: Additionally, any message may point to an arbitrary number of vertices as **additional justifications**. We visualize them with **dashed arrows**.
ru: Кроме того, любое сообщение может указывать на произвольное количество вершин в качестве **дополнительных обоснований**. Мы визуализируем их с помощью **пунктирных стрелок**.

source: All arrows together with all vertices form a directed acyclic graph we call the **j-dag**.
ru: Все стрелки вместе со всеми вершинами образуют направленный ациклический граф, который мы называем **j-dag**.

source: DAG vs POSET language
ru: DAG против POSET

source: DAG is a common abbreviation for “directed acyclic graph”.
ru: DAG - это распространенная аббревиатура для “направленного ациклического графа”.

source: POSET is a common abbreviation for “partially ordered set”.
ru: POSET-это распространенная аббревиатура для “частично упорядоченного набора”.

source: When a DAG has at most one edge between any pair of vertices, we say this DAG is “simple”.
ru: Когда DAG имеет не более одного ребра между любой парой вершин, мы говорим, что этот DAG “простой”.

source: Any POSET can be seen as a simple DAG when you define an edge **a \rightarrow b** to be present whenever **a < b**.
ru: Любой набор POSET можно рассматривать как простой DAG, когда вы определяете ребро **a \rightarrow b**, которое будет присутствовать всякий раз, когда **a < b**.

source: Any simple DAG leads to a POSET by taking its transitive closure and saying that **a < b** iff there is an edge **a \rightarrow b**. By symmetry, taking **a < b** iff there is an edge **b \rightarrow a** is also a POSET (just based on inverted order). Going in the other direction - from POSET to a DAG - is analogous.
ru: Любой простой DAG приводит к множеству POSET, принимая его транзитивное замыкание и говоря, что **a < b**, если есть ребро **a \rightarrow b**. По симметрии, принимая **a < b**, если есть ребро **b \right, a** также является частично упорядоченным множеством (только на основе перевернутого порядка). Движение в другом направлении - от POSET к DAG - аналогично.

source: In practice, POSET is “like a simple DAG” where we do not distinguish between DAGs with the same transitive closure. In particular, for visualization purposes it is convenient to draw a POSET as a transitive reduction of a corresponding DAG.
ru: На практике POSET “похож на простой DAG”, где мы не различаем DAG с одинаковым транзитивным замыканием. В частности, в целях визуализации удобно нарисовать последовательность как транзитивное сокращение соответствующей DAG.

source: When talking about **j-dag** and **p-dag**, we blur the difference between DAG language and POSET language, because essentially one language is convertible to another.
ru: Когда мы говорим о **j-dag** и **p-dag**, мы стираем разницу между языком DAG и языком POSET, потому что, по сути, один язык преобразуется в другой.

source: Understanding the layers of the blockdag
ru: Понимание слоев блокдага

source: Here we explain only the intuition behind the blockdag. These ideas are formalized later in this document.
ru: Здесь мы объясняем только интуицию, лежащую в основе блокдага. Эти идеи формализованы далее в этом документе.

source: **J-dag** is all about attesting what I have seen so far. When I am a validator creating a new message (= block or ballot), I have to attest what is my current protocol state -- i.e., what my current blockdag looks like. I do this by including on the justifications list (which is part of the new message) pointers to all **j-dag** tips present in my blockdag. Please note that we continue to use the terminology established for j-dag from previous chapters (*See* the topic on J-dag).
ru: **J-dag** - это все для подтверждения того, что я видел до сих пор. Когда я валидатор, создающий новое сообщение (= блок или бюллетень), я должен подтвердить, каково мое текущее состояние протокола, т.е. Как выглядит мой текущий блокдаг. Я делаю это, включив в список обоснований (который является частью нового сообщения) указатели на все **j-dag** советы, присутствующие в моем блокдаге. Пожалуйста, обратите внимание, что мы продолжаем использовать терминологию, установленную для j-dag из предыдущих глав (*См.* раздел о J-dag).
