Repository: Venoox/docs
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: ru

source: **equivocators** - a collection of validators for which current blockdag contains an equivocation
ru: **двусмысленные** - коллекция валидаторов, для которых текущий блокдаг содержит двусмысленности

source: **reference-finalizer** - an instance of finalizer used internally (*see* **Operation of a finalizer** later in this spec for more information about what finalizers are)
ru: **финализатор ссылок** - экземпляр финализатора, используемый внутренне (*см. **Работа финализатора** далее в этой спецификации, где более детально рассказано, что это такое)

source: **global-states-db** - mapping of global state hash to global state
ru: **db глобальных состояний** картировка хеша глобального состояния к глобальному состоянию

source: A message :math:`m` can be added to the :math:`blockdag` only if all justifications of :math:`m` are already present in the blockdag. So if a validator receives a message before receiving some of its justifications, the received message must wait in the :math:`messages\_buffer`.
ru: Сообщение :math:`m` может быть добавлено в :math:`blockdag` только если все обоснования :math:`m` уже присутствуют в блокдаг. Так что если валидатор получает сообщение до получения некоторых его обоснований, полученное сообщение должно ожидать в буфере :math:`messages\_buffer`.

source: A validator is concurrently executing two infinite loops of processing:
ru: Валидатор параллельно выполняет два бесконечных процесса по кругу:

source: **Listening loop:**
ru: **Прослушивание по кругу:**

source: Listen to messages incoming from other validators. Whenever a message :math:`m` (block or ballot) arrives, follow this handling scenario:
ru: Прослушивайте сообщения, поступающие от других валидаторов. Всякий раз, когда приходит сообщение :math:`m` (блок или бюллетень), следуйте этому сценарию обработки:

source: Validate the formal structure of :math:`m`. In case of any error - drop :math:`m` (invalid message) and exit.
ru: Проверьте формальную структуру :math:`m`. В случае какой-либо ошибки-отбросьте :math:`m` (неверное сообщение) и выйдите.

source: Check if all justifications of :math:`m` are already included in :math:`blockdag`.
ru: Проверьте, что все обоснования :math:`m` уже включены в :math:`blockdag`.

source: if yes: continue
ru: Если да: продолжаем

source: otherwise: append :math:`m` to the :math:`messages\_buffer`, then exit
ru: В ином случае: присоедините :math:`m` к буферу :math:`messages\_buffer`, затем выйдите

source: Perform processing specific to type of :math:`m` (block or ballot) - see below.
ru: Осуществите процесс специфичный для типа :math:`m` (блок или бюллетень) - см. ниже

source: If :math:`equivocators` does not contain :math:`m.creator`:
ru: Если :math:`equivocators` не содержит :math:`m.creator`:

source: Check if :math:`m` introduces new equivocation - this is the case when :math:`latest\_honest\_messages(m.creator)` is not member of :math:`j\_past\_cone(m)`
ru: Проверьте, если :math:`m` представляет новую двусмысленность - это случай, когда создатель :math:`latest\_honest\_messages(m.creator)` не является членом :math:`j\_past\_cone(m)`

source: If yes then add :math:`m.creator` to :math:`equivocators`
ru: Если да, то добавьте создателя :math:`m.creator` к двусмысленностям :math:`equivocators`

source: If :math:`equivocators` does not contain :math:`m.creator`, update :math:`latest\_honest\_messages` map by setting :math:`latest\_honest\_messages(m.creator) = m`
ru: Если двусмысленности :math:`equivocators` не содержат создателя :math:`m.creator`, обновите карту последних честных сообщений :math:`latest\_honest\_messages` с настройкой :math:`latest\_honest\_messages(m.creator) = m`

source: Check if there is any message :math:`x` in :math:`messages\_buffer` that can now leave the buffer and be included in the :math:`blockdag` because of :math:`x.all\_justifications` are now present in the :math:`blockdag`. For first such :math:`x` found, apply steps (3) - (4) - (5) .
ru: Проверьте, если любое сообщение :math:`x` в буфере :math:`messages\_buffer`, которое может теперь покинуть буфер и быть включенным в :math:`blockdag` , поскольку обоснования :math:`x.all\_justifications` теперь присутствуют в блокдаг :math:`blockdag`. Для первого такого найденного :math:`x` примените шаги (3) - (4) - (5) .

source: (“Buffer pruning cascade”) Repeat step (6) as many times as there are blocks that can be released from the buffer.
ru: (“Каскад обрезки буфера”) Повторите шаг (6) столько раз, сколько есть блоков, которые могут быть освобождены из буфера.

source: Processing specific to type of :math:`m` goes as follows:
ru: Осуществите процесс специфичный для типа :math:`m` :

source: If :math:`m` is a block:
ru: Если :math:`m` - это блок:

source: Validate whether :math:`m` parents (main parent and secondary parents) were selected correctly:
ru: Подтвердите, что родители :math:`m` (главный и второстепенные) были избраны правильно:

source: run the fork-choice for the protocol state derived from justifications of :math:`m`
ru: запустите выбор вилки для состояния протокола, полученного из обоснований :math:`m`

source: compare calculated parents with actual parent of :math:`m`:
ru: сравните вычисленных родителей с актуальным родителем :math:`m`:

source: if they are the same: append :math:`m` to :math:`blockdag`.
ru: Если они совпадают: примените :math:`m` к :math:`blockdag`.

source: otherwise - drop the block (invalid block) and exit
ru: в ином случае: отбросьте блок (неверный блок) и выйдите

source: Check if parents of :math:`m` are not conflicting. If they are conflicting, then drop the block (invalid block) and exit.
ru: Проверьте, что родители :math:`m` не конфликтуют. Если они конфликтуют, тогда отбросьте блок (неверный блок) и выйдите.

source: Calculate pre-state for :math:`m` by executing the transactions in the merged history that is determined by all parents of :math:`m`. Check if calculated hash of pre-state is equal to pre-state-hash stored in :math:`m`. If not, then drop :math:`m` (invalid block) and exit.
ru: Вычислите предсостояние для :math:`m` , выполняя транзакции в истории слияний, которая определяется всеми родителями :math:`m`. Проверьте, что вычисленный хеш предсостояний тождественен хешу предсостояния, сохраненному в :math:`m`. Если нет, отбросьте блок (неверный блок) и выйдите.

source: Calculate post-state for :math:`m` by sequentially applying all transactions in :math:`m` on top of global state calculated in step (3). Check if calculated hash of post-state is equal to post-state-hash stored in :math:`m`. If not, then drop :math:`m` (invalid block) and exit.
ru: Вычислите постсостояние для :math:`m`, последовательно применяя все транзакции в :math:`m` сверху глобального состояний, вычисленного в шаге (3). Проверьте, что вычисленный хеш постсостояния тождественен хешу постсостояния, сохраненному в :math:`m`. Если нет, отбросьте :math:`m` (неверный блок) и выйдите.

source: Store post-state calculated in step (4) in :math:`global\_states\_db`.
ru: Сохраните постсостояние, вычисленное в шаге (4) в :math:`global\_states\_db`.

source: If :math:`m` is a ballot:
ru: Если :math:`m` - это бюллетень:

source: Validate whether :math:`m.target\_block` was selected correctly:
ru: Подтвердите, что целевой блок :math:`m.target\_block` был избран правильно:

source: compare calculated main parent candidate with actual :math:`m.target\_block`:
ru: сравните вычисленного кандидата на главного родителя с актуальным :math:`m.target\_block`:

source: **Publishing loop:**
ru: **Публикация по кругу:**

source: Sleep unless the next time for proposing a block arrives (typically this may be a periodic activity based on wall clock).
ru: Спите, пока не наступит следующий момент для предложения блока (обычно это может быть периодическое действие, основанное на настенных часах).

source: Run fork-choice against the current blockdag (see next section). The result is:
ru: Запустите выбор вилки для текущего блокдага (см. Следующий раздел). В результате получается:

source: Main parent - :math:`mp`.
ru: Главный родитель - :math:`mp`.

source: Collection of secondary parents - :math:`sp` - sorted by preference.
ru: Коллекция второстепенных родителей - :math:`sp` - отобранная по предпочтению.

source: Pick the maximal non-conflicting subset :math:`mncsp \subset sp`, respecting the selection of :math:`mp` and the ordering of :math:`sp`.
ru: Выберите максимальное неконфликтующее подмножество :math:`mncsp \subset sp`, учитывая выборку :math:`mp` и порядок :math:`sp`.

source: Calculate merged global state :math:`merged\_gs` derived from :math:`\{mp\} \cup mncsp`.
ru: Вычислите глобальное состояние слияний :math:`merged\_gs` полученное из :math:`\{mp\} \cup mncsp`.

source: Check the weight of local validator in merged global state: :math:`weights\_map(merged\_gs)(vid)`
ru: Проверьте вес локального валидатора в глобальном состоянии слияний: :math:`weights\_map(merged\_gs)(vid)`

source: If weight is non-zero and :math:`deploys-buffer` is nonempty, we will be creating and publishing a new block.
ru: Если вес ненулевой и буфер развертываний :math:`deploys-buffer` не пустой, мы будем создавать и публиковать новый блок.

source: otherwise - check the status of local validator:
ru: в ином случае - проверьте статус локального валидатора:

source: VOTING_ONLY => create and publish a new ballot
ru: VOTING_ONLY => создать и опубликовать новый бюллетень

source: otherwise => exit
ru: в ином случае => выйти

source: Case 1: new block
ru: Случай 1: новый блок

source: Take desired subset of transactions :math:`trans` from :math:`deploys-buffer` (this part of behavior is subject to a separate spec; on this level of abstraction we accept any strategy of picking transactions from the buffer).
ru: Возьмите желаемое подмножество транзакций :math:`trans` из буфера развертываний :math:`deploys-buffer` (эта часть поведения является предметом отдельной спецификации; на этом уровне абстракции мы принимаем любую стратегию выбора транзакций из буфера).

source: Apply :math:`trans` sequentially on top of :math:`merged\_gs`. Let :math:`post\_gs` be the resulting global state.
ru: Примените :math:`trans` последовательно сверху :math:`merged\_gs`. Пусть :math:`post\_gs` будет результирующим глобальным состоянием.

source: Create new block:
ru: Создать новый блок:

source: block id = hash of the binary representation of this block
ru: id блока = хеш двоичного представления этого блока

source: creator id = :math:`vid`
ru: id создателя = :math:`vid`

source: main parent = :math:`mp`
ru: главный родитель = :math:`mp`

source: secondary parents = :math:`mncsp`
ru: второстепенные родители = :math:`mncsp`

source: justifications = :math:`latest\_honest\_messages` after removing main parent, secondary parents, and redundant messages (see explanation below)
ru: обоснования = :math:`latest\_honest\_messages` после удаления главного родителя, второстепенных родителей и избыточных сообщений (см. объяснение ниже)

source: transactions list = :math:`trans`
ru: список транзакций = :math:`trans`

source: pre-state-hash = :math:`hash(merged\_gs)`
ru: хеш предсостояния = :math:`hash(merged\_gs)`

source: post-state hash = :math:`hash(post\_gs)`
ru: хеш постсостояния = :math:`hash(post\_gs)`

source: Store :math:`post\_gs` in :math:`global\_states\_db`
ru: Сохраните :math:`post\_gs` в :math:`global\_states\_db`

source: Broadcast new block across validators P2P network.
ru: Транслируйте новый блок валидаторам в P2P сети.

source: Case 2: new ballot
ru: Случай 2: новый бюллетень

source: Create new ballot:
ru: Создайте новый бюллетень:

source: target block = :math:`mp`
ru: целевой блок = :math:`mp`

source: justifications = :math:`latest\_honest\_messages` after removing: target block and redundant messages (see explanation below)
ru: обоснования = :math:`latest\_honest\_messages` после удаления целевого блока и избыточных сообщений (см. объяснение ниже)

source: Broadcast new ballot across validators P2P network.
ru: Транслируйте новый бюллетень валидаторам P2P сети.

source: Note: we generally want to keep the collection :math:`m.justifications` as short as possible. For this, we never include there main parent, secondary parents, and target block. Also, we want the collection of justifications included in the message to be transitively reduced (= included justifications form an antichain).
ru: Примечание: как правило, мы хотим, чтобы коллекция обоснований :math:`m.justifications` была как можно короче. Для этого мы никогда не включаем туда основного родителя, вторичных родителей и целевой блок. Кроме того, мы хотим, чтобы коллекция обоснований, включенных в сообщение, была транзитивно сокращена (= включенные обоснования образуют антицепь).

source: Relative votes
ru: Родственные голоса

source: We will need the concept of “last message created by validator **v** that was a non-empty vote in **b-game**”. Given any block :math:`b` and any validator :math:`V` let us take look at the swimlane of :math:`V`. If :math:`v` is honest, then this swimlane is a chain. Any message :math:`m` counts as a non-empty vote in **b-game** only if:
ru: Нам понадобится концепция “последнее сообщение, созданное валидатором **v**, которое было непустым голосованием в **b-игре**”. Учитывая любой блок :math:`b` и любого валидатора :math:`V` , давайте взглянем на плавательную дорожку :math:`V`. Если :math:`v` честна, то эта плавательная дорожка представляет собой цепочку. Любое сообщение :math:`m` считается непустым голосованием в **b-игре** только в том случае, если:

source: :math:`m` is a block and the ancestor of :math:`m` (in main-tree) is :math:`b`
ru: :math:`m` это блок и его предок :math:`m` (в главном дереве) :math:`b`

source: :math:`m` is a ballot and the ancestor of :math:`m.target\_block` (in main-tree) is :math:`b`
ru: :math:`m` это бюллетень и предок :math:`m.target\_block` (в главном дереве) - :math:`b`

source: We start from the latest (= top-most on the diagram) message in the :math:`swimlane(v)` and we traverse the swimlane down, stopping as soon as we find a message that counts as a non-empty vote in **b-game**.
ru: Мы начинаем с последнего (= самого верхнего на диаграмме) сообщения в :math:`swimlane(v)` и проходим по плавательной дорожке вниз, останавливаясь, как только находим сообщение, которое считается непустым голосованием в **b-игре**.

source: \ **Example:**\
ru: \ **Пример:**\

source: Below is the original example of the blockdag, but with all messages that are non-empty votes in 3-game highlighted with green:
ru: Ниже приведен оригинальный пример блокдага, но со всеми сообщениями, которые не являются пустыми голосами в 3-игре, выделенными зеленым цветом:

source: **Example:**
ru: **Пример:**

source: Let us again look at the example of a blockdag:
ru: Давайте снова посмотрим на пример блокдага:

source: Let’s apply this definition using validator 3 as the example and find the last votes of validator 3 in various games.
ru: Давайте применим это определение, используя валидатора 3 в качестве примера, и найдем последние голоса валидатора 3 в различных играх.

source: Block b
ru: Блок b

source: Last non-empty vote of validator 3 in b-game
ru: Последний непустой голос валидатора 3 в игре b

source: Genesis
ru: Генезис

source: (none)
ru: (пусто)

source: Fork choice
ru: Выбор вилки

source: The goal of fork-choice is to take the decision on top of the version of the shared database history we want to build in the next step. This decision can be seen as an iterative application of the reference estimator from the “Abstract Casper Consensus”. As a result we want to get a list of blocks (ordered by preference) which will serve as parent candidates for the new block.
ru: Цель выбора вилки-принять решение поверх версии истории общей базы данных, которую мы хотим создать на следующем шаге. Это решение можно рассматривать как итеративное применение эталонной оценки из “Абстрактного консенсуса Casper”. В результате мы хотим получить список блоков (упорядоченных по предпочтениям), которые будут служить родительскими кандидатами для нового блока.

source: The algorithm goes as follows:
ru: Алгоритм выглядит следующим образом:

source: Decide which protocol state :math:`ps` to use: 1. When using fork choice for creation of new block this is the point where the validator can decide on the subset of his local knowledge to reveal to outside world. Ideally, the validator reveals all local knowledge, so it takes as protocol state the whole local blockdag.
ru: Решите, какое состояние протокола :math:`ps` использовать: 1. При использовании выбора вилки для создания нового блока это точка, в которой валидатор может выбрать подмножество своих локальных знаний для раскрытия внешнему миру. В идеале, валидатор раскрывает все локальные знания, поэтому он принимает в качестве состояния протокола весь локальный блокдаг.

source: When using fork choice for validation of received message :math:`m`, the protocol state to take is :math:`j\_past\_cone(m)`.
ru: При использовании выбора вилки для проверки полученного сообщения :math:`m`, мы берем состояние протокола :math:`j\_past\_cone(m)`.

source: Take :math:`HV` - all honest validators (all creators of messages in :math:`ps` minus those seen equivocating with messages in :math:`ps`).
ru: Берем :math:`HV` - всех честных валидаторов (всех создателей сообщений в :math:`ps` с вычетом тех, кто создавал двусмысленности с сообщениями в :math:`ps`).

source: Find latest message :math:`lm(v)` created by each validator :math:`v \in HV`, ignoring validators that produced no message.
ru: Найдите последнее сообщение :math:`lm(v)` , созданное каждым валидатором :math:`v \in HV`, игнорируя валидаторов, которые не производили сообщений.

source: For all validators that have :math:`lm(v)` defined take:
ru: Для всех валидаторов, которые имеют определенный :math:`lm(v)` берем:

source: Take :math:`lca\_block` = latest common ancestor along main-tree of all :math:`tipBlock(v)`
ru: Берем :math:`lca\_block` = последний общий предок по длине главного дерева из всех :math:`tipBlock(v)`

source: Initialize resulting collection of blocks as one-element list :math:`Result = [lca\_block]`
ru: Инициализируйте итоговую коллекцию блоков как однокомпонентный список :math:`Result = [lca\_block]`

source: For each block :math:`b` in :math:`Result` replace :math:`b` with its direct children in main-tree: :math:`c_1, c_2, ..., c_n`, where the list of children is ordered following this recipe:
ru: Для каждого блока :math:`b` в:math:`Result` замените :math:`b` его прямым потомком в главном дереве: :math:`c_1, c_2, ..., c_n`, где список детей расположен в порядке согласно этому рецепту:

source: For each honest validator :math:`v` find :math:`lmb(v)` - the last message by :math:`v` voting in **b-game.**
ru: Для каждого честного валидатора :math:`v` найдите :math:`lmb(v)` - последнее сообщение от :math:`v` , голосовавшее в b-игре

source: Find a child :math:`c_i` that :math:`lmb(v)` is voting for - by traversing down the main-tree.
ru: Найдите потомка :math:`c_i` за которого :math:`lmb(v)` голосовал - пройдя вниз по главному дереву.

source: Using :math:`validator\_weights(b)` count the votes.
ru: Используя вес валидаторов :math:`validator\_weights(b)` посчитайте голоса.

source: Order the sequence :math:`c_i` by calculated votes, using :math:`ci.id` (= block hash) as tie-breaker.
ru: Упорядочите последовательность :math:`c_i` с вычисленными голосами, используя :math:`ci.id` (= хеш блока) как тай-брейк.

source: Repeat step 7 as long as it is changing **Result**.
ru: Повторяйте шаг 7 до тех пор, пока он изменяет **Результат**.

source: The **Result** is the list of blocks we want. The first block on the list is the main parent candidate, remaining blocks are secondary parents candidates.
ru: **Результат** - это список блоков, которые мы хотим. Первый блок в списке - основной кандидат в родители, остальные блоки - кандидаты в второстепенные родители.

source: Operation of a finalizer
ru: Работа финализатора

source: The objective
ru: Цель

source: Finalizer observes the growing blockchain. The objective is to recognize the subset of transactions history that:
ru: Финализатор наблюдает за растущим блокчейном. Цель состоит в том, чтобы распознать подмножество истории транзакций, которое:

source: is already agreed (as a result of on-going consensus)
ru: уже согласовано (в результате продолжающегося консенсуса)

source: cannot be reverted (unless the equivocators collection exceeds - by total weight - predefined threshold)
ru: не может быть отменено (если коллекция двусмысленностей не превышает - по общему весу - заданный порог)

source: Parameters
ru: Параметры

source: In general - different finalizers will be based on different finality criteria. For the current design we assume that the criterion described in the previous chapter is in use.
ru: В целом - разные финализаторы будут основываться на разных критериях завершенности. Для текущего проекта мы предполагаем, что используется критерий, описанный в предыдущей главе.

source: Hence, the finalizer is parameterized by:
ru: Таким образом, параметры финализатора задаются с:

source: the type of finality detector to be used
ru: типом детектора завершенности, который будет использоваться

source: **K** - acknowledgement level
ru: **K** - уровень признания

source: **WP** (weight percentage) - expressed as a number between 0 and 1
ru: **WP** (процент веса) - выраженный как номер между 0 и 1

source: State
ru: Состояние

source: The assumption is that a finalizer can traverse the blockdag, reading contents of blocks. Also, for any block b it should be able to read post-state of b, and in particular get the weights-map from this post-state.
ru: Предполагается, что финализатор может проходить через блокдаг, считывая содержимое блоков. Кроме того, для любого блока b он должен иметь возможность считывать пост-состояние b и, в частности, получать карту весов из этого пост-состояния.

source: The internal state of the “reference” implementation of a finalizer would be:
ru: Внутреннее состояние “эталонной” реализации финализатора будет следующим:

source: current finality detector instance - the one observing **LFB(current-game-id)-game**
ru: текущий экземпляр детектора завершенности - тот, который наблюдает **игру LFB(идентификатор текущей игры)**

source: **LFB: Seq[Block]** for **i=0 … current-game-id**
ru: **LFB: Seq[Block]** for **i=0 … id-текущей-игры**

source: **initial-players: Seq[Set[ValidatorId]]**
ru: **начальные игроки: Seq[Set[ValidatorId]]**

source: **excluded-players: Seq[Set[ValidatorId]]**
ru: **исключенные игроки: Seq[Set[ValidatorId]]**

source: Initial state (on the beginning of the blockchain, the only block is Genesis):
ru: Начальное состояние (в начале блокчейна единственным блоком является Genesis):

source: **equivocators** = empty set
ru: **двусмысленные** = пустой набор

source: **current-game-id** = 0
ru: идентификатор текущей игры **current-game-id** = 0

source: current finality detector instance = new instance (according to configured type of finality detector to be used)
ru: текущий экземпляр детектора завершенности = новый экземпляр (в соответствии с настроенным типом используемого детектора завершенности)

source: **LFB** = empty sequence
ru: **LFB** = пустая последовательность

source: **initial-players** = one element sequence, with the single element being the set of ids of validators bonded at Genesis
ru: **начальные игроки** = последовательность из одного элемента, причем единственным элементом является набор идентификаторов валидаторов, связанных в Genesis

source: **excluded-players** = one element sequence, with the single element being the empty set
ru: **исключено-игроки** = последовательность из одного элемента, причем один элемент является пустым набором
